#Sun Sep 17 21:30:01 MSK 2017
task1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0441 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u042D\u0442\u0430 \u0438\u0441\u0442\u043E\u0440\u0438\u044F \u0431\u0435\u0440\u0435\u0442 \u043D\u0430\u0447\u0430\u043B\u043E \u0432 \u0441\u0440\u0435\u0434\u043D\u0435\u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u043C \u0433\u043E\u0440\u043E\u0434\u0435. \u0412 \u043C\u0435\u0441\u0442\u0435, \u0433\u0434\u0435 \u0435\u0441\u0442\u044C \u0440\u0435\u043A\u0430 \u0438 \u043D\u0430\u0431\u0435\u0440\u0435\u0436\u043D\u0430\u044F \u0438 \u043F\u0430\u0440\u0430 \u0444\u043E\u043D\u0442\u0430\u043D\u043E\u0432. \u0418\u043C\u0435\u043D\u043D\u043E \u0432 \u044D\u0442\u043E\u043C \u043C\u0435\u0441\u0442\u0435 \u0441\u0438\u0434\u0435\u043B \u0447\u0435\u043B\u043E\u0432\u0435\u043A, \u0438 \u0447\u0438\u0442\u0430\u043B \u043A\u043D\u0438\u0433\u0443 \u043E \u0441\u043A\u0430\u0437\u043E\u0447\u043D\u043E\u0439 \u043E\u0433\u043D\u0435\u043D\u043D\u043E\u0439 \u043F\u0442\u0438\u0446\u0435.\n(\u0427\u0442\u043E\u0431\u044B \u0437\u0430\u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043E\u0432\u0430\u0442\u044C \u0435\u0433\u043E \u043F\u0440\u043E\u0447\u0442\u0438\u0442\u0435 \u0441\u0442\u0438\u0445 \u043E\u0431 \u044D\u0442\u043E\u0439 \u043F\u0442\u0438\u0446\u0435)\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1
gamelegend=\u0417\u0435\u043C\u043B\u044F \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u043D\u0435\u0434\u0430\u043B\u0451\u043A\u043E\u0433\u043E \u0431\u0443\u0434\u0443\u0449\u0435\u0433\u043E, \u043C\u043D\u043E\u0433\u0438\u0435 \u0438\u0437\u043C\u0435\u043D\u0438\u043B\u043E\u0441\u044C \u043D\u0430 \u043F\u043B\u0430\u043D\u0435\u0442\u0435 \u0437\u0430 \u044D\u0442\u043E \u0432\u0440\u0435\u043C\u044F. \u0412 \u044D\u0442\u0438 \u043D\u043E\u0432\u0435\u0439\u0448\u0438\u0435 \u0432\u0440\u0435\u043C\u0435\u043D\u0430 \u043F\u043E\u0436\u0430\u0440\u043D\u044B\u0435 \u043A\u043E\u043C\u0430\u043D\u0434\u044B \u043D\u0435 \u0441\u0440\u0430\u0436\u0430\u044E\u0442\u0441\u044F \u0441 \u043E\u0433\u043D\u0451\u043C. \u0421\u043E\u0432\u0441\u0435\u043C \u0434\u0430\u0436\u0435 \u043D\u0430\u043E\u0431\u043E\u0440\u043E\u0442. \u0418\u0445 \u0437\u0430\u0434\u0430\u0447\u0430 \u043E\u0442\u044B\u0441\u043A\u0438\u0432\u0430\u0442\u044C \u043A\u043D\u0438\u0433\u0438 \u0438 \u043F\u0440\u0435\u0434\u0430\u0432\u0430\u0442\u044C \u043E\u0433\u043D\u044E \u0438\u0445.
hint2.2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0414\u043E\u043C \u041F\u0435\u0447\u0430\u0442\u0438.
taskcode6=3AN9G3
startcode=sc
hint2.1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u043E\u043C\u0435\u0447\u0430\u044F \u043A\u0440\u0443\u0433\u0430\u043C\u0438 \u043D\u0430 \u043A\u0430\u0440\u0442\u0435, \u044D\u0442\u0438 \u0414\u043E\u043C\u0430 \u041F\u0435\u0447\u0430\u0442\u0438, \u043E\u043D \u0440\u0430\u0437 \u0437\u0430 \u0440\u0430\u0437\u043E\u043C \u0443\u043D\u0438\u0447\u0442\u043E\u0436\u0430\u0435\u0442 \u043A\u043D\u0438\u0433\u0438.
taskcode4=A4N5G2
taskcode3=7ANG19
hint4.2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0443\u043B.\u041A\u0435\u0440\u043C\u0435\u043D\u0438\u0441\u0442\u043E\u0432, \u0437\u0430\u0432\u043E\u0434 \u041C\u0435\u0442\u0430\u043B\u043B\u0443\u0440\u0433, \u0437\u0430\u0431\u0440\u043E\u0448\u0435\u043D\u043D\u043E\u0435 \u0437\u0434\u0430\u043D\u0438\u0435.
taskcode2=A13N4G
taskcode1=A3N8G1
hint4.1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041A\u0435\u0440\u043C\u0435\u043D\u0438\u0441\u0442\u043D\u0430\u044F \u043F\u043E\u0447\u0432\u0430 \u0438\u0445 \u043E\u0442\u043D\u043E\u0448\u0435\u043D\u0438\u0439 \u043D\u0435 \u0434\u0430\u043B\u0430 \u0432\u0437\u0445\u043E\u0434\u043E\u0432. \u041F\u043E\u0442\u043E\u043C\u0441\u0442\u0432\u0430 \u0443 \u043D\u0438\u0445 \u043D\u0435 \u0431\u044B\u043B\u043E \u0443\u0436\u0435 \u043B\u0435\u0442 7.
hint6.2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0442\u0440\u043E\u0439\u043A\u0430 \u043C\u0435\u0436\u0434\u0443 \u0443\u043B.\u0411\u0440\u0430\u0442\u044C\u0435\u0432 \u0429\u0443\u043A\u0438\u043D\u044B\u0445 \u0438 \u041C\u043E\u0431\u0438\u043B 1.
hint6.1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0430\u0439\u0434\u0438 \u0431\u0440\u0430\u0442\u044C\u0435\u0432 \u0429\u0443\u043A, \u043E\u043D\u0438 \u0442\u0435\u0431\u0435 \u043E\u0431\u044F\u0437\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u043F\u043E\u043C\u043E\u0433\u0443\u0442, \u043D\u043E \u043A \u043D\u0438\u043C \u043D\u0435 \u0437\u0430\u0445\u043E\u0434\u0438.
starttime=22-00
hint1.2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041D\u0430\u0431\u0435\u0440\u0435\u0436\u043D\u0430\u044F \u043E\u043A\u043E\u043B\u043E \u0440\u0435\u0441\u0442\u043E\u0440\u0430\u043D\u0430 \u0416\u0430\u0440-\u043F\u0442\u0438\u0446\u0430.
hint1.1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0430 \u043F\u0435\u0440\u0435\u043F\u043B\u0435\u0442\u0435 \u043A\u043D\u0438\u0433\u0438 \u043A\u0440\u0430\u0441\u043E\u0432\u0430\u043B\u0430\u0441\u044C \u0416\u0430\u0440-\u043F\u0442\u0438\u0446\u0430.
taskcode5=A9N7G6
hint3.2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0411\u044B\u0432\u0448\u0435\u0435 \u043A\u0430\u0444\u0435 \u0410\u043C\u0430\u0437\u043E\u043D\u043A\u0430, \u043F\u043E \u0410\u0440\u0445\u043E\u043D\u0441\u043A\u043E\u043C\u0443 \u0448\u043E\u0441\u0441\u0435, \u043D\u0435 \u0434\u043E\u0435\u0437\u0436\u0430\u044F \u0434\u043E \u0420\u0435\u0433\u0430\u0445\u0430.
hint3.1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u042E\u043D\u0430\u044F \u0410\u041C\u0410\u0417\u041E\u041D\u041A\u0410 \u0437\u0430\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u041C\u043E\u043D\u0442\u044D\u0433\u0430 \u043F\u043E-\u043D\u043E\u0432\u043E\u043C\u0443 \u0432\u0437\u0433\u043B\u044F\u043D\u0443\u0442\u044C \u043D\u0430 \u0436\u0438\u0437\u043D\u044C. \u041E\u043D \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0430 \u0410\u0432\u0442\u043E\u0432\u043E\u043A\u0437\u0430\u043B. \u0414\u0435\u043B\u0438\u043A\u0430\u0442\u043D\u043E \u0433\u043B\u044F\u0434\u044F \u0432 \u043E\u043A\u043D\u043E, \u0435\u0434\u0435\u0442 \u043F\u043E \u0448\u043E\u0441\u0441\u0435 \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u0434\u043E\u043C\u0430. \u041F\u0440\u043E\u0435\u0437\u0436\u0430\u0435\u0442 \u0448\u0430\u0448\u043B\u044B\u0447\u043D\u044B\u0435 \u0438 \u0434\u0432\u0435 \u0437\u0430\u043F\u0440\u0430\u0432\u043A\u0438, \u0442\u0440\u0435\u0442\u044C\u044F \u043D\u0430 \u0435\u0433\u043E \u043F\u0443\u0442\u0438 \u043D\u0435 \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442, \u0445\u043E\u0442\u044F \u043E\u043D \u043F\u043E\u043C\u043D\u0438\u0442 \u0432\u0440\u0435\u043C\u044F \u043A\u043E\u0433\u0434\u0430 \u043E\u043D\u0430 \u0440\u0430\u0431\u043E\u0442\u0430\u043B\u0430, \u043A\u0430\u043A \u0438 \u043A\u0430\u0444\u0435 \u043E\u043A\u043E\u043B\u043E \u043D\u0435\u0435.
hint5.2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0443\u043B.\u0427\u0430\u043F\u0430\u0435\u0432\u0430 10, \u0441\u0442\u0440\u043E\u0439\u043A\u0430.
hint5.1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0415\u0433\u043E \u0442\u043E\u0432\u0430\u0440\u0438\u0449 \u0412\u0435\u0430 \u041F\u0430\u0447, \u0431\u044B\u043B \u043D\u0430 10 \u043B\u0435\u0442 \u0441\u0442\u0430\u0440\u0448\u0435, \u0438 \u0438\u0441\u043A\u0440\u0435\u043D\u043D\u0435 \u043D\u0435 \u043F\u043E\u043D\u0438\u043C\u0430\u043B, \u0447\u0442\u043E \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442 \u0441 \u0434\u0440\u0443\u0433\u043E\u043C.
task6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n\u0412 \u043A\u043D\u0438\u0433\u0435 \u043E\u043D \u043D\u0430\u0445\u043E\u0434\u0438\u0442 \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0439 \u0448\u0438\u0444\u0440. \u0422\u0443\u0442 \u0431\u0435\u0437 100 \u0433\u0440\u0430\u043C\u043C \u043D\u0435 \u043E\u0431\u043E\u0439\u0442\u0438\u0441\u044C, \u043F\u043E\u0434\u0443\u043C\u0430\u043B \u041C\u043E\u043D\u0442\u044D\u0433, \u0440\u0430\u0437\u0438\u043D\u0443\u0432 \u0440\u043E\u04421!! -  \u0420\u041F\u041A\u0415\u0419 \u041F\u0423 \u0420\u0421\u041F\u041C\u0416\u0422\u041B\u0411 \u041E\u0411\u041C\u0416\u0413\u041F \u041B \u0412\u0421\u0411\u0423\u042D\u0410\u041D \u042A\u0424\u041B \u041B \u041E\u0419\u041D \u041E\u0416 \u0418\u0411\u0426\u041F\u0415\u0419 \u0423\u0416\u0412\u0416 \u0415\u0411\u041C\u042D\u0429\u0416.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3
startdate=22-09-2017
task5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u0428\u0430\u0433 \u0437\u0430 \u0428\u0430\u0433\u043E\u043C, \u043C\u0438\u043C\u043E\u043B\u0451\u0442\u043D\u044B\u0435 \u0432\u0441\u0442\u0440\u0435\u0447\u0438 \u0441 \u041A\u043B\u0430\u0440\u0438\u0441\u0441\u043E\u0439 \u043F\u0440\u0438\u0432\u043E\u0434\u044F\u0442 \u043A \u0442\u043E\u043C\u0443, \u0447\u0442\u043E \u041C\u043E\u043D\u0442\u044D\u0433 \u043F\u0440\u0435\u0432\u0440\u0430\u0449\u0430\u0435\u0442\u0441\u044F \u0432 \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0441\u043C\u0443\u0449\u0430\u0435\u0442 \u0441\u0432\u043E\u0438\u0445 \u043A\u043E\u043B\u043B\u0435\u0433 \u043D\u0435\u0443\u043C\u0435\u0441\u0442\u043D\u044B\u043C\u0438 \u0432\u043E\u043F\u0440\u043E\u0441\u0430\u043C\u0438 \u0438 \u0440\u0435\u043F\u043B\u0438\u043A\u0430\u043C\u0438.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2\n\u041C\u0410\u041A\u0421\u0418\u041C\u0410\u041B\u042C\u041D\u0410\u042F \u0422\u0418\u0428\u0418\u041D\u0410 \u041D\u0410 \u0423\u0420\u041E\u0412\u041D\u0415.
task4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n\u041C\u043E\u043D\u0442\u044D\u0433 \u0438 \u041C\u0438\u043B\u0434\u0440\u0435\u0434 \u0436\u0435\u043D\u0430\u0442\u044B \u0443\u0436\u0435 \u0434\u0430\u0432\u043D\u043E, \u043D\u043E \u0438\u0445 \u0431\u0440\u0430\u043A \u043F\u0440\u0435\u0432\u0440\u0430\u0442\u0438\u043B\u0441\u044F \u0438\u0437 \u0443\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u0430, \u0441\u043E\u0437\u0434\u0430\u043D\u043E\u0433\u043E \u0410\u043D\u044C\u043E\u0448\u0435\u043C \u0419\u0435\u0434\u043B\u0438\u043A\u043E\u043C \u0432 \u043D\u0435 \u043F\u043E\u043D\u044F\u0442\u043D\u043E \u0447\u0442\u043E. \u0418 \u0437\u0430\u043F\u0447\u0430\u0441\u0442\u0438 \u043D\u0430 \u044D\u0442\u043E \u0443\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u043E, \u043A \u0441\u043E\u0436\u0430\u043B\u0435\u043D\u0438\u044E, \u043D\u0435 \u0432\u044B\u043F\u0443\u0441\u043A\u0430\u0435\u0442 \u0443\u0436\u0435 \u043D\u0438 \u043E\u0434\u0438\u043D \u0437\u0430\u0432\u043E\u0434.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3
task3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n\u0412\u0441\u0442\u0440\u0435\u0447\u0430 \u0441 \u044E\u043D\u043E\u0439 \u0430\u043C\u0430\u0437\u043E\u043D\u043A\u043E\u0439 \u041A\u043B\u0430\u0440\u0438\u0441\u0441\u043E\u0439 \u041C\u0430\u043A\u043B\u0435\u043B\u0430\u043D\u0434 \u0432\u044B\u0431\u0438\u0432\u0430\u0435\u0442 \u0433\u0435\u0440\u043E\u044F \u0438\u0437 \u043A\u043E\u043B\u0435\u0438 \u043F\u0440\u0438\u0432\u044B\u0447\u043D\u043E\u0433\u043E \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043E\u0432\u0430\u043D\u0438\u044F. \u041A\u043B\u0430\u0440\u0438\u0441\u0441\u0430 \u0440\u0435\u0437\u043A\u043E \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F \u0438\u0437 \u043C\u0430\u0441\u0441\u044B \u0441\u0432\u043E\u0438\u0445 \u0441\u0432\u0435\u0440\u0441\u0442\u043D\u0438\u043A\u043E\u0432, \u043F\u043E\u043C\u0435\u0448\u0430\u043D\u043D\u044B\u0445 \u043D\u0430 \u0430\u0432\u0442\u043E\u0440\u0430\u0437\u0431\u043E\u0440\u043A\u0430\u0445, \u043F\u044C\u044F\u043D\u044B\u0445 \u0432\u0435\u0447\u0435\u0440\u0438\u043D\u043A\u0430\u0445 \u0432 \u0437\u0430\u043C\u043A\u0430\u0445-\u0440\u0435\u0441\u0442\u043E\u0440\u0430\u043D\u0430\u0445.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3
task2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u0412\u043E\u0442 \u0443\u0436\u0435 \u0434\u0435\u0441\u044F\u0442\u044C \u043B\u0435\u0442 \u0413\u0430\u0439 \u041C\u043E\u043D\u0442\u044D\u0433 \u0438\u0441\u043F\u0440\u0430\u0432\u043D\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u044F\u0435\u0442 \u0441\u0432\u043E\u0438 \u043E\u0431\u044F\u0437\u0430\u043D\u043D\u043E\u0441\u0442\u0438, \u043D\u0435 \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u044F\u0441\u044C \u043E \u0441\u043C\u044B\u0441\u043B\u0435 \u0438 \u043F\u0440\u0438\u0447\u0438\u043D\u0430\u0445 \u0442\u0430\u043A\u043E\u0433\u043E \u043A\u043D\u0438\u0433\u043E\u043D\u0435\u043D\u0430\u0432\u0438\u0441\u0442\u043D\u0438\u0447\u0435\u0441\u0442\u0432\u0430. \u0423\u043D\u0438\u0447\u0442\u043E\u0436\u0430\u044F \u0432\u0441\u0435 \u0447\u0442\u043E \u0441\u0432\u044F\u0437\u0430\u043D\u043E \u0441 \u043F\u0435\u0447\u0430\u0442\u044C\u044E, \u0430 \u0442\u0430\u043A\u0436\u0435 \u0434\u043E\u043C\u0430 \u0442\u0435\u0445, \u043A\u0442\u043E \u043E\u0441\u043C\u0435\u043B\u0438\u043B\u0441\u044F \u0434\u0435\u0440\u0436\u0430\u0442\u044C \u0432 \u043D\u0438\u0445 \u0442\u0430\u043A\u0443\u044E \u043A\u0440\u0430\u043C\u043E\u043B\u0443.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2