#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="\u041D\u043E\u0447\u043D\u043E\u0439 \u0414\u043E\u0437\u043E\u0440"\n\n\u041B\u0435\u0433\u0435\u043D\u0434\u044B \u0441\u0435\u0433\u043E\u0434\u043D\u044F \u043D\u0435\u0442, \u0432\u0441\u0435 \u0437\u043D\u0430\u044E\u0442, \u0447\u0442\u043E \u0442\u0430\u043A\u043E\u0435 \u041D\u043E\u0447\u043D\u043E\u0439 \u0434\u043E\u0437\u043E\u0440, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u0441\u043E\u0431\u0440\u0430\u043B\u0438\u0441\u044C \u0438 \u0432\u043F\u0435\u0440\u0435\u0434!!!! \u041A \u043A\u043E\u043D\u0446\u0443 \u0438\u043D\u044B\u0445 \u043E\u0441\u0442\u0430\u0442\u044C\u0441\u044F \u043D\u0435 \u0434\u043E\u043B\u0436\u043D\u043E!!! \u0418 \u0435\u0449\u0451 \u0440\u0435\u0431\u044F\u0442\u0430, \u0441\u043F\u0430\u0441\u0438\u0431\u043E \u0437\u0430 \u0441\u0435\u0437\u043E\u043D!!!
START_CODE=nw
START_DATE=08-09-2018
START_TIME=14-40
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439)\n\u041A\u0430\u0440\u0430\u043A\u0430\u0441 802\n\u041C\u043E\u0441\u043A\u0432\u0430 752\n\u0420\u0435\u0439\u043A\u044C\u044F\u0432\u0438\u043A 021\n\u0412\u0435\u043D\u0430 345\n\u0421\u043A\u043E\u043F\u044C\u0435 707\n\u041B\u0443\u0430\u043D\u0434\u0430\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1,1,1,1,1,1
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0410\u043D\u0442\u043E\u043D \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u043B \u043D\u043E\u043C\u0435\u0440\u0430 \u043C\u0435\u0436\u0434\u0443\u043D\u0430\u0440\u043E\u0434\u043D\u044B\u0445 \u0440\u0435\u0439\u0441\u043E\u0432, \u0438 \u0432 37 \u043C\u0438\u043D\u0443\u0442 \u0412\u0442\u043E\u0440\u043E\u0433\u043E \u043F\u043E \u041C\u043E\u0441\u043A\u043E\u0432\u0441\u043A\u043E\u043C\u0443 \u0432\u0440\u0435\u043C\u0435\u043D\u0438, \u0432\u044B\u043B\u0435\u0442\u0435\u043B \u0438\u0437 \u0410\u044D\u0440\u043E\u043F\u043E\u0440\u0442\u0430.
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0422\u0426 \u00AB\u0421\u0442\u043E\u043B\u0438\u0446\u0430\u00BB. \u041F\u0430\u0440\u043A\u043E\u0432\u043A\u0430, \u043D\u043E\u043C\u0435\u0440\u0430 \u043C\u0430\u0448\u0438\u043D.
TASK_CODE_1=4F5LN8
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u0421\u0442\u043E\u043B\u0438\u0446\u0430 \u0431\u044B\u043B\u0430 \u043F\u043E\u0437\u0430\u0434\u0438, \u043C\u0438\u043D\u0443\u043B\u043E 2 \u0434\u043D\u044F, \u0410\u043D\u0442\u043E\u043D \u043D\u0430\u0447\u0430\u043B \u043F\u043E\u0438\u0441\u043A\u0438 \u0438\u043D\u043E\u0433\u043E. \u041D\u043E \u044D\u0442\u043E \u0432\u0440\u0435\u043C\u044F \u043D\u0430 \u043E\u0434\u043D\u043E\u043C \u0438\u0437 "\u0412\u0418\u041F"-\u0437\u0430\u0432\u043E\u0434\u043E\u0432 \u043F\u0440\u043E\u0433\u0440\u0435\u043C\u0435\u043B\u043E 5 \u0432\u0437\u0440\u044B\u0432\u043E\u0432. \u041E\u0447\u0435\u043D\u044C \u0433\u0440\u043E\u043C\u043A\u0438\u0445. \u041D\u0430\u0432\u0435\u0440\u043D\u043E \u044D\u0442\u043E \u043F\u0440\u043E\u0434\u0435\u043B\u043A\u0438 \u0417\u0430\u0432\u0443\u043B\u043E\u043D\u0430. \u0423 \u0410\u043D\u0442\u043E\u043D\u0430 \u043D\u0435 \u0431\u044B\u043B\u043E \u0432\u044B\u0431\u043E\u0440\u0430 \u0438 \u043E\u043D \u043F\u043E\u0441\u043F\u0435\u0448\u0438\u043B \u0442\u0443\u0434\u0430. \u041E\u0434\u043D\u0430\u043A\u043E \u0431\u044B\u043B\u043E \u043F\u043E\u0437\u0434\u043D\u043E!! \u0417\u0430\u0432\u0443\u043B\u043E\u043D \u0441\u043A\u0440\u044B\u043B\u0441\u044F. \u0412\u0435\u0440\u043D\u0443\u0432\u0448\u0438\u0441\u044C \u043A \u0434\u043E\u0440\u043E\u0433\u0435, \u0410\u043D\u0442\u043E\u043D \u043F\u043E\u043D\u044F\u043B, \u0447\u0442\u043E \u0417\u0430\u0432\u0443\u043B\u043E\u043D \u043C\u043E\u0433 \u0443\u0439\u0442\u0438 \u0442\u043E\u043B\u044C\u043A\u043E \u043F\u0440\u044F\u043C\u043E \u043F\u043E \u043D\u0435\u0439...\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0410\u043D\u0442\u043E\u043D \u0435\u0445\u0430\u043B \u043F\u043E \u0422\u0435\u043B\u044C\u043C\u0430\u043D\u0430,   \u043C\u0438\u043C\u043E \u041F\u0438\u0432\u043E\u0432\u0430\u0440\u0435\u043D\u043D\u043E\u0433\u043E \u0437\u0430\u0432\u043E\u0434\u0430, \u043F\u043E\u0442\u043E\u043C \u043D\u0430 \u043F\u043E\u0432\u043E\u0440\u043E\u0442\u0435 \u043D\u0430 \u0437\u0430\u0432\u043E\u0434\u0441\u043A\u043E\u0439 \u0440\u0430\u0439\u043E\u043D \u0433\u043E\u0440\u043E\u0434\u0430, \u043F\u043E\u0435\u0445\u0430\u043B \u043F\u0440\u044F\u043C\u043E (\u041D\u0435 \u043F\u043E\u0432\u043E\u0440\u0430\u0447\u0438\u0432\u0430\u043B), \u0438 \u0434\u0430\u043B\u0435\u0435 \u043F\u043E\u0435\u0445\u0430\u043B \u043F\u043E \u044D\u0442\u043E\u0439 \u0434\u043E\u0440\u043E\u0433\u0435, \u0434\u043E \u0442\u043E\u0433\u043E \u043C\u043E\u043C\u0435\u043D\u0442\u0430 \u043A\u0430\u043A \u0434\u043E\u0440\u043E\u0433\u0430 \u0431\u0443\u0434\u0435\u0442 \u0443\u0445\u043E\u0434\u0438\u0442\u044C \u043B\u0435\u0432\u0435\u0435, \u043D\u043E \u043D\u0435 \u043E\u043D \u043D\u0435 \u043F\u0435\u0440\u0435\u0436\u0438\u0432\u0430\u043B, \u0442.\u043A \u043D\u0430 \u0434\u043E\u0440\u043E\u0433\u0435 \u0443\u0432\u0438\u0434\u0435\u043B \u043A\u0440\u0435\u0441\u0442. \u0430 \u0437\u043D\u0430\u0447\u0438\u0442  \u043F\u0440\u044F\u043C\u043E \u043C\u0435\u0442\u0440\u043E\u0432 50 \u043F\u0440\u043E\u0435\u0445\u0430\u0442\u044C \u0438 \u0442\u0430\u043C \u043D\u0430 \u0431\u0435\u0442\u043E\u043D\u0435 \u0441\u043D\u0438\u0437\u0443 \u043E\u043A\u043E\u043B\u043E \u0434\u0435\u0440\u0435\u0432\u0430 \u043A\u043E\u0434 F2L4N7 \u0431\u0443\u0434\u0435\u0442 \u043D\u0430\u043F\u0438\u0441\u0430\u043D. \u041D\u043E \u0431\u044B\u043B\u043E \u0442\u0435\u043C\u043D\u043E, \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u044B \u043E\u0448\u0438\u0431\u043A\u0438.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0420\u0435\u0431\u044F\u0442\u0430, \u0432 \u043F\u0435\u0440\u0432\u043E\u0439 \u043F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0435 \u0441\u043A\u0440\u044B\u0442\u0430 \u0438\u0441\u0442\u0438\u043D\u0430. \u041D\u0435 \u043F\u043E\u0432\u043E\u0440\u0430\u0447\u0438\u0432\u0430\u0439\u0442\u0435 \u0432 \u0417\u0430\u0432\u043E\u0434\u0441\u043A\u043E\u0439, \u0432\u0441\u0435 \u0432\u0440\u0435\u043C\u044F \u043F\u0440\u044F\u043C\u043E!!!!!!!
TASK_CODE_2=F4l7n3
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n(\u0410\u0433\u0435\u043D\u0442)\n\u0411\u043B\u0438\u0437\u0438\u043B\u0430\u0441\u044C \u043D\u043E\u0447\u044C, \u0410\u043D\u0442\u043E\u043D\u0430 \u043A\u043B\u043E\u043D\u0438\u043B\u0430 \u0432 \u0441\u043E\u043D. \u0421 \u044D\u0442\u0438\u043C \u043D\u0430\u0434\u043E \u0431\u044B\u043B\u043E \u0447\u0442\u043E \u0442\u043E \u0434\u0435\u043B\u0430\u0442\u044C. \u0412\u0435\u0434\u044C \u0441\u043F\u0430\u0441\u0442\u044C \u0410\u043D\u0442\u043E\u043D\u0443 \u043D\u0438 \u0432 \u043A\u043E\u0435\u043C \u0441\u043B\u0443\u0447\u0430\u0435 \u043D\u0435\u043B\u044C\u0437\u044F, \u043E\u043D \u0434\u043E\u043B\u0436\u0435\u043D \u043F\u0435\u0440\u0435\u0431\u043E\u0440\u043E\u0442\u044C \u0441\u0432\u043E\u0439 \u0441\u043E\u043D. \u041F\u043E\u043D\u044F\u0432, \u0447\u0442\u043E \u043F\u0440\u043E\u0441\u0442\u043E \u0442\u0430\u043A, \u044D\u0442\u043E \u0441\u043E\u0441\u0442\u043E\u044F\u043D\u0438\u0435 \u043D\u0435 \u043F\u0440\u043E\u0439\u0434\u0435\u0442, \u0410\u043D\u0442\u043E\u043D \u0440\u0435\u0448\u0438\u043B \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u0442\u044C\u0441\u044F \u043D\u0430 \u043F\u043E\u0438\u0441\u043A\u0438 \u043D\u0430\u043F\u0438\u0442\u043A\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0441\u043C\u043E\u0436\u0435\u0442 \u0438\u0437\u0431\u0430\u0432\u0438\u0442\u044C \u0435\u0433\u043E \u043E\u0442 \u0436\u0435\u043B\u0430\u043D\u0438\u044F \u0441\u043F\u0430\u0442\u044C. \u042D\u0442\u043E \u043D\u0435 \u0441\u0430\u043C\u0430\u044F \u043F\u0440\u043E\u0441\u0442\u0430\u044F \u0437\u0430\u0434\u0430\u0447\u0430, \u043D\u043E \u0410\u043D\u0442\u043E\u043D \u0432\u0441\u043F\u043E\u043C\u043D\u0438\u043B, \u0447\u0442\u043E \u0432\u0447\u0435\u0440\u0430 \u043E\u043D \u043E\u0442\u0433\u0430\u0434\u044B\u0432\u0430\u043B \u043A\u0440\u043E\u0441\u0441\u0432\u043E\u0440\u0434, \u0433\u0434\u0435 \u043A\u043B\u044E\u0447\u0435\u0432\u044B\u043C \u0441\u043B\u043E\u0432\u043E\u043C \u0431\u044B\u043B\u043E \u043A\u0430\u043A \u0440\u0430\u0437 \u0442\u043E \u043C\u0435\u0441\u0442\u043E, \u0433\u0434\u0435 \u043F\u0440\u043E\u0434\u0430\u044E\u0442 \u043D\u0435\u043E\u0431\u044B\u0447\u043D\u044B\u0439 \u043D\u0430\u043F\u0438\u0442\u043E\u043A, \u0441\u043B\u043E\u0432\u043E \u0431\u044B\u043B\u043E \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u043E \u0441 \u0432\u0435\u0440\u0445\u0443 \u0432\u043D\u0438\u0437.  \u0412\u044B\u0431\u0440\u0430\u0432 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u0439 \u043D\u0430\u043F\u0438\u0442\u043E\u043A,  \u0410\u043D\u0442\u043E\u043D \u0432\u044B\u043B\u043E\u0436\u0438\u043B \u0437\u0430 \u043D\u0435\u0433\u043E \u0440\u043E\u0432\u043D\u043E 88 \u0440\u0443\u0431\u043B\u0435\u0439 \u043F\u043E\u0434 \u0440\u0430\u0441\u0447\u0435\u0442.  \u0418 \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u043B\u0441\u044F \u0434\u0430\u043B\u044C\u0448\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0410\u043D\u0442\u043E\u043D\u0443 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0431\u044B\u043B\u043E \u043F\u043E\u0447\u0438\u043D\u0438\u0442\u044C \u0434\u043E\u043C\u0430 \u043A\u0440\u044B\u0448\u0443, \u0438  \u043F\u043E\u043A\u0443\u043F\u0430\u044F \u043D\u0430\u043F\u0438\u0442\u043E\u043A \u043E\u043D  \u0432\u0441\u0442\u0440\u0435\u0442\u0438\u043B \u043C\u0430\u0441\u0442\u0435\u0440\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043F\u043E\u0434\u0441\u043A\u0430\u0437\u0430\u043B \u0435\u043C\u0443, \u0433\u0434\u0435 \u043F\u0440\u0438\u043E\u0431\u0440\u0435\u0441\u0442\u0438 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E\u0435.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0422\u0426 \u0412\u0435\u0440\u0442\u0438\u043A\u0430\u043B\u044C, \u041C\u0430\u0448\u0438\u043D\u0430 \u0427\u0430\u0439, \u041A\u043E\u0444\u0435.
TASK_CODE_3=1F2L3N
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2\n \u041C\u0410\u041A\u0421\u0418\u041C\u0410\u041B\u042C\u041D\u0410\u042F \u0422\u0418\u0428\u0418\u041D\u0410 \u041D\u0410 \u0423\u0420\u041E\u0412\u041D\u0415!
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0420\u0430\u0437\u0433\u0430\u0434\u0430\u0432 \u0448\u0438\u0444\u0440 \u043D\u0435\u043C\u0435\u0446\u043A\u043E\u0433\u043E \u0433\u0440\u0430\u0444\u0430 \u0413\u0440\u043E\u0441\u0444\u0435\u043B\u044C\u0434\u0430, \u0410\u043D\u0442\u043E\u043D \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u043B\u0441\u044F \u0434\u0430\u043B\u044C\u0448\u0435 \u043D\u0430 \u043F\u043E\u0438\u0441\u043A\u0438 \u0417\u0430\u0432\u0443\u043B\u043E\u043D\u0430.
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u0438\u043D\u043E\u0442\u0435\u0430\u0442\u0440 \u00AB\u0420\u0430\u043A\u0435\u0442\u0430\u00BB. \u041D\u0430 \u041A\u043E\u043B\u044C\u0431\u0443\u0441\u0430.
TASK_CODE_4=4F7ln9
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u041F\u0440\u043E\u0432\u043E\u0434\u0438\u0432 \u0441\u0432\u043E\u0435\u0433\u043E \u0434\u0440\u0443\u0433\u0430 \u043E\u0431\u0440\u0430\u0442\u043D\u043E \u0432 \u0413\u0435\u0440\u043C\u0430\u043D\u0438\u044E, \u0410\u043D\u0442\u043E\u043D \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u043B\u0441\u044F \u043D\u0430 \u0441\u0445\u0432\u0430\u0442\u043A\u0443 \u0441 \u0417\u0430\u0432\u0443\u043B\u043E\u043D\u043E\u043C.  \u041D\u0430 \u0441\u0442\u0430\u043D\u0446\u0438\u0438 "\u0410\u043B\u0435\u043A\u0441\u0435\u0435\u0432\u0441\u043A\u0430\u044F" \u043A \u043D\u0435\u043C\u0443 \u043F\u043E\u0434\u043E\u0448\u0435\u043B \u043D\u0435\u0437\u043D\u0430\u043A\u043E\u043C\u0435\u0446, \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u0432\u0448\u0438\u0441\u044C "\u0414\u043E\u0434\u043E\u0442\u043E\u043C", \u043E\u043D \u0432\u0434\u0440\u0443\u0433 \u0441\u043A\u0430\u0437\u0430\u043B, \u0447\u0442\u043E \u0437\u043D\u0430\u0435\u0442 \u043A\u0443\u0434\u0430 \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u043B\u0441\u044F \u0417\u0430\u0432\u0443\u043B\u043E\u043D, \u0438 \u0445\u043E\u0447\u0435\u0442 \u0435\u043C\u0443 \u043F\u043E\u043C\u043E\u0447\u044C \u0410\u043D\u0442\u043E\u043D\u0443. \u0422.\u043A  \u0414\u043E\u0434\u043E\u0442, \u0441\u0443\u0434\u044F \u043F\u043E \u0432\u0441\u0435\u043C\u0443, \u0431\u044B\u043B \u0433\u0440\u0435\u043A\u043E\u043C, \u043E\u043D \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0438\u043B \u0410\u043D\u0442\u043E\u043D\u0443 \u0434\u043E\u0431\u0440\u0430\u0442\u044C\u0441\u044F \u0434\u043E \u043C\u0435\u0441\u0442\u0430 \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F, \u043D\u0430 \u0432\u0435\u0441\u044C\u043C\u0430 \u043D\u0435\u043E\u0431\u044B\u0447\u043D\u043E\u043C \u0442\u0440\u0430\u043D\u0441\u043F\u043E\u0440\u0442\u0435. \u042D\u0442\u043E \u0431\u044B\u043B \u041F\u0435\u0433\u0430\u0441. \u041D\u043E \u0418\u0445 \u0431\u044B\u043B\u043E \u0434\u0432\u043E\u0435, \u0438 \u043A\u0430\u043A \u0441\u043B\u0435\u0434\u0441\u0442\u0432\u0438\u0435 \u0438\u043C \u043F\u0440\u0438\u0448\u043B\u043E\u0441\u044C \u0441\u043D\u0430\u0440\u044F\u0434\u0438\u0442\u044C \u043A\u043E\u043D\u043A\u0443. \u041F\u0440\u0438\u0435\u0445\u0430\u0432 \u043D\u0430 \u043C\u0435\u0441\u0442\u043E \u043E\u043D\u0438 \u0437\u0430\u043C\u0435\u0442\u0438\u043B\u0438 \u043E\u0433\u0440\u043E\u043C\u043D\u044B\u0439 \u0433\u043B\u0430\u0437, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0441\u043B\u043E\u0432\u043D\u043E, \u043D\u0430 \u0447\u0442\u043E \u0442\u043E \u0438\u043C \u043D\u0430\u043C\u0435\u043A\u0430\u0435\u0442. \u0414\u043E\u0434\u043E\u0442 \u0432\u0437\u044F\u043B \u0441 \u0441\u043E\u0431\u043E\u0439 \u0432\u0441\u0435 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E\u0435: \u0425\u043B\u0435\u0431, \u0447\u0438\u043F\u0441\u044B, \u041A\u043E\u043B\u0443, \u041C\u0430\u043A\u0430\u0440\u043E\u043D\u044B.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u0440\u043E\u043B\u0435\u0442\u0430\u044F \u043C\u0438\u043C\u043E  \u0441\u0442\u0430\u043D\u0446\u0438\u0438 \u041C\u0435\u0442\u0440\u043E \u00AB\u041C\u043E\u0441\u043A\u043E\u0432\u0441\u043A\u0430\u044F\u00BB. \u041F\u0435\u0433\u0430\u0441 \u0432\u043D\u0435\u0437\u0430\u043F\u043D\u043E \u043D\u0430\u0447\u0430\u043B \u0434\u0435\u0440\u0433\u0430\u0442\u044C \u043F\u043E\u0432\u043E\u0434\u044C\u044F, \u0410\u043D\u0442\u043E\u043D\u0443 \u0431\u044B\u043B\u043E \u0442\u044F\u0436\u0435\u043B\u043E \u0443\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u043C\u044F\u0442\u0435\u0436\u043D\u043E\u0433\u043E \u041A\u043E\u043D\u044F, \u0435\u0433\u043E \u043C\u044B\u0448\u0446\u044B \u043D\u0430\u043F\u0440\u044F\u0433\u043B\u0438\u0441\u044C, \u0441\u043B\u043E\u0432\u043D\u043E \u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0435 \u043A\u0430\u043D\u0430\u0442\u044B. \u0418 \u0435\u043C\u0443 \u043D\u0430 \u043F\u043E\u043C\u043E\u0449\u044C \u043F\u0440\u0438\u0448\u0435\u043B \u0414\u043E\u0434\u043E\u0442.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u0430\u043D\u0430\u0442\u043D\u0430\u044F \u0434\u043E\u0440\u043E\u0433\u0430. \u041D\u0430 \u043C\u043E\u0441\u043A\u043E\u0432\u0441\u043A\u043E\u0439. \u041D\u0430 \u043C\u0435\u0441\u0442\u0435 \u0432\u0441\u0442\u0440\u0435\u0442\u0438\u0442\u0435  \u0414\u043E\u0434\u043E\u0442\u0430)))))
TASK_CODE_5=F1L9N4
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439)\n\u041F\u043E \u043F\u0440\u0435\u0434\u0430\u043D\u0438\u044F\u043C \u041D\u043E\u0447\u043D\u043E\u0433\u043E \u0434\u043E\u0437\u043E\u0440\u0430 \u0410\u043D\u0442\u043E\u043D \u0434\u043E\u043B\u0436\u0435\u043D \u0431\u044B\u0442\u044C \u043F\u0440\u0435\u043E\u0434\u043E\u043B\u0435\u0442\u044C  \u0438\u0441\u043F\u044B\u0442\u0430\u043D\u0438\u044F  \u041B\u0435\u0433\u0438\u043E\u043D\u0430, \u0441\u043E\u0437\u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u043E\u043C \u043F\u043E \u0438\u043C\u0435\u043D\u0438 \u042D\u0440\u043D\u0441\u0442 16 \u0430\u043F\u0440\u0435\u043B\u044F. \u0410\u043D\u0442\u043E\u043D  \u0434\u043E\u043B\u0436\u0435\u043D \u043F\u043E\u0431\u0435\u0434\u0438\u0442\u044C \u0432 \u0431\u043E\u044E  13 \u0434\u0435\u043C\u043E\u043D\u043E\u0432  \u0442\u0435\u043C\u043D\u044B\u0445 \u0441\u0438\u043B. \u0410\u0441\u0442\u0430\u0440\u043E\u0442\u0430, \u0410\u0441\u0442\u0430\u0440\u0442\u0443, \u0410\u0431\u0431\u0430\u0434\u043E\u043D\u0430, \u0410\u0441\u043C\u0430\u0434\u0435\u044F, \u0410\u0437\u0435\u0437\u0435\u043B\u044C, \u0410\u0441\u043C\u0430\u0434\u0435\u044F, \u0410\u043B\u0430\u0441\u0442\u043E\u0440\u0430, \u0410\u0441\u0442\u0430\u043D\u043E\u0440\u0430, \u0410\u0440\u0430\u043C\u0437\u0435\u0441\u0430, \u0410\u0440\u0431\u0438\u0434\u043E\u043B\u0430, \u0410\u0440\u0430\u0440\u0430\u0442\u0430, \u0410\u043D\u0430\u0441\u0442\u0435\u0442\u0430 \u0438 \u0410\u0446\u0435\u0442\u043E\u043D\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,2,2
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0412\u0445\u043E\u0434 \u043D\u0430 \u0410\u0440\u0435\u043D\u0443 \u043E\u0445\u0440\u0430\u043D\u044F\u043B \u043C\u043E\u043D\u0441\u0442\u0440, \u0441\u0434\u0435\u043B\u0430\u043D\u043D\u044B\u0439 \u043F\u043E\u043B\u043D\u043E\u0441\u0442\u044C\u044E \u0438\u0437 \u0431\u0435\u043B\u044B\u0445 \u0448\u0438\u043D.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0422\u0435\u043B\u044C\u043C\u0430\u043D\u0430 13\u0430, \u0437\u0430\u0431\u0440\u043E\u0448\u0435\u043D\u043D\u044B\u0439 \u0434\u0435\u0442\u0441\u043A\u0438\u0439 \u0441\u0430\u0434.
TASK_CODE_6=F24L6N
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u0434 \u0447\u0443\u0433\u0443\u043D\u043D\u044B\u043C \u043C\u043E\u0441\u0442\u043E\u043C.
TASK_CODE_7=FLN123
BONUS_FIVE_MINUTES=C2H5OH
BONUS_TEN_MINUTES=Koffe
BONUS_FIFTEEN_MINUTES=Trup