#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="\u0423\u0431\u043E\u0439\u043D\u044B\u0435 \u043A\u0430\u043D\u0438\u043A\u0443\u043B\u044B"\n\n\u0412\u044B \u043A\u0443\u043F\u0438\u043B\u0438  \u0434\u043E\u043C \u0432 \u043B\u0435\u0441\u0443, \u043C\u0435\u0447\u0442\u0443 \u0441\u0432\u043E\u0435\u0433\u043E \u0434\u0435\u0442\u0441\u0442\u0432\u0430, \u0434\u0430 \u0447\u0442\u043E \u0443\u0436 \u0442\u0430\u043C, \u0432\u0441\u0435\u0439 \u0436\u0438\u0437\u043D\u0438. \u041A\u0430\u0437\u0430\u043B\u043E\u0441\u044C \u0432\u043E\u0442 \u043E\u043D\u043E \u0441\u0447\u0430\u0441\u0442\u044C\u0435, \u043D\u043E \u043D\u0435 \u0432\u0441\u0435 \u0442\u0430\u043A \u043F\u0440\u043E\u0441\u0442\u043E. \u0412\u0435\u0434\u044C \u0432 \u043B\u0435\u0441\u0430\u0445 \u0432\u0441\u0435\u0433\u0434\u0430 \u0441\u043A\u0440\u044B\u0442\u043E \u0447\u0442\u043E-\u0442\u043E. \u0411\u0443\u0434\u044C \u0442\u043E \u0431\u0440\u043E\u0448\u0435\u043D\u043D\u0430\u044F \u043C\u0430\u0448\u0438\u043D\u0430 \u0445\u0438\u043F\u043F\u0438, \u0438\u043B\u0438 \u0447\u0435\u0439-\u043D\u0438\u0431\u0443\u0434\u044C \u0431\u0443\u043D\u043A\u0435\u0440 \u043D\u0430 \u0441\u043B\u0443\u0447\u0430\u0439 \u0430\u0442\u043E\u043C\u043D\u043E\u0439 \u0432\u043E\u0439\u043D\u044B. \u0410 \u043C\u043E\u0436\u0435\u0442 \u044D\u0442\u043E \u0442\u0430\u0439\u043D\u0430, \u0447\u0442\u043E \u043F\u0440\u043E\u043D\u0435\u0441\u043B\u0430\u0441\u044C \u0447\u0435\u0440\u0435\u0437 \u0433\u043E\u0434\u0430, \u043D\u0430\u0433\u043D\u043E\u0438\u043B\u0430\u0441\u044C \u0438 \u0433\u043E\u0442\u043E\u0432\u0430 \u0432\u044B\u043B\u0438\u0442\u044C\u0441\u044F \u043D\u0430 \u0412\u0430\u0441. \u0418 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0432\u044B \u0443\u0436\u0435 \u043D\u0435 \u0441\u043C\u043E\u0436\u0435\u0442\u0435 \u0432\u044B\u0440\u0432\u0430\u0442\u044C\u0441\u044F \u0438\u0437 \u044D\u0442\u043E\u0433\u043E. \u0410 \u0435\u0441\u043B\u0438 \u0412\u044B, \u0432 \u0434\u043E\u0431\u0430\u0432\u043E\u043A, \u043F\u0440\u043E\u0441\u0442\u043E\u0432\u0430\u0442\u044B, \u0430 \u0432\u043E\u043A\u0440\u0443\u0433 \u0442\u043E\u043B\u043F\u0430 \u043D\u0435\u043B\u0435\u043F\u044B\u0445 \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u0438\u043A\u043E\u0432, \u044D\u0442\u043E \u043C\u043E\u0436\u0435\u0442 \u043F\u0435\u0440\u0435\u0440\u0430\u0441\u0442\u0438 \u0432 \u043E\u0447\u0435\u043D\u044C, \u043E\u0447\u0435\u043D\u044C-\u043E\u0447\u0435\u043D\u044C \u0431\u043E\u043B\u044C\u0448\u0438\u0435 \u043D\u0435\u043F\u0440\u0438\u044F\u0442\u043D\u043E\u0441\u0442\u0438.\n\u0414\u043E\u043F\u044B:\n\u0421\u043F\u0438\u0447\u0435\u0447\u043D\u044B\u0439 \u043A\u043E\u0440\u043E\u0431\u043E\u043A \u0438 \u0441\u0432\u0435\u0447\u0430\n\u041A\u0443\u043F\u0430\u043B\u044C\u043D\u044B\u0439 \u043A\u043E\u0441\u0442\u044E\u043C, \u0434\u043B\u044F \u043E\u0442\u043A\u0440\u044B\u0442\u0438\u044F \u0441\u0435\u0437\u043E\u043D\u0430.\n\u041C\u043E\u0431\u0438\u043B\u044C\u043D\u043E\u0435 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u041A\u0430\u0434\u0430\u0441\u0442\u0440\n\u041A\u0443\u043F\u0447\u0430\u044F \u043D\u0430 \u0434\u0430\u0447\u0443 \u0432 \u043B\u0435\u0441\u0443, \u0441\u043E \u0432\u0441\u0435\u043C\u0438 \u043F\u043E\u0434\u043F\u0438\u0441\u044F\u043C\u0438 \u0438 \u043F\u0435\u0447\u0430\u0442\u044F\u043C\u0438!
START_CODE=td
START_DATE=25-05-2018
START_TIME=22-00
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0414\u0435\u0439\u043B \u0438 \u0422\u0430\u043A\u0435\u0440 \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u043B\u0438\u0441\u044C \u043D\u0430 \u043A\u0443\u043F\u043B\u0435\u043D\u043D\u0443\u044E \u0432 \u043B\u0435\u0441\u0443 \u0434\u0430\u0447\u0443, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0432\u0435\u0441\u0442\u0438 \u0442\u0430\u043C \u0443\u0438\u043A\u0435\u043D\u0434. \u041E\u0442\u0434\u043E\u0445\u043D\u0443\u0442\u044C, \u0440\u0430\u0441\u0441\u043B\u0430\u0431\u0438\u0442\u044C\u0441\u044F \u0437\u0430 \u0447\u0430\u0448\u0435\u0447\u043A\u043E\u0439 \u0447\u0435\u0433\u043E-\u043B\u0438\u0431\u043E \u043D\u0430 \u043B\u043E\u043D\u0435 \u043F\u0440\u0438\u0440\u043E\u0434\u044B. \u041F\u043E\u0447\u0438\u0442\u0430\u0442\u044C \u0433\u0430\u0437\u0435\u0442\u0443 \u043F\u043E\u0434 \u0442\u0440\u0435\u0441\u043A \u043A\u043E\u0441\u0442\u0440\u0430 \u0438 \u043E\u0449\u0443\u0442\u0438\u0442\u044C \u0435\u0433\u043E \u0442\u0435\u043F\u043B\u043E. \u0414\u0430\u0447\u0430 \u0440\u0430\u0441\u043F\u043E\u043B\u0430\u0433\u0430\u043B\u0430\u0441\u044C \u0432 \u0433\u043B\u0443\u0431\u0438\u043D\u0435 \u043B\u0435\u0441\u0430. \u042D\u043B\u0435\u043A\u0442\u0440\u0438\u0447\u0435\u0441\u0442\u0432\u043E\u043C \u0437\u0434\u0435\u0441\u044C \u0438 \u043D\u0435 \u043F\u0430\u0445\u043B\u043E.  \u2013 \u0422\u044B \u0432\u0437\u044F\u043B \u0433\u0430\u0437\u0435\u0442\u0443 \u00AB\u041C\u0438\u0441\u0441\u0443\u0440\u0438 \u0414\u0435\u0439\u043B\u0438 \u0422\u0435\u043B\u0435\u0433\u0440\u0430\u0444 \u0421\u0430\u043D\u0434\u044D\u0439\u00BB? \u2013 \u0441\u043F\u0440\u043E\u0441\u0438\u043B \u0414\u044D\u0439\u043B.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u0443\u0442\u044C \u043D\u0430 \u043D\u043E\u0432\u0443\u044E \u0434\u0430\u0447\u0443 \u043F\u0440\u043E\u043B\u0435\u0433\u0430\u043B \u043F\u043E \u0433\u043B\u0430\u0432\u043D\u043E\u0439 \u0430\u0440\u0442\u0435\u0440\u0438\u0438 \u0448\u0442\u0430\u0442\u0430. \u041E\u0434\u043D\u0430\u043A\u043E \u0448\u043E\u0441\u0441\u0435 \u0431\u043E\u043B\u044C\u0448\u0435 \u043D\u0430\u043F\u043E\u043C\u0438\u043D\u0430\u043B\u043E \u0437\u0430\u0445\u0443\u0434\u0430\u043B\u0443\u044E \u0442\u0440\u0430\u0441\u0441\u0443 \u0434\u043B\u044F \u0431\u043E\u043B\u044C\u0448\u0435\u0433\u0440\u0443\u0437\u043E\u0432. \u0427\u0442\u043E \u043D\u0435 \u0441\u043A\u0430\u0436\u0435\u0448\u044C \u043E  \u043B\u0435\u0441\u0435, \u043E\u043D  \u0431\u044B\u043B \u0436\u0438\u0432\u043E\u043F\u0438\u0441\u043D\u044B\u0439, \u0438\u043D\u043E\u0433\u0434\u0430 \u0434\u0430\u0436\u0435 \u043C\u043E\u0436\u043D\u043E \u0431\u044B\u043B\u043E \u0432\u0441\u0442\u0440\u0435\u0442\u0438\u0442\u044C \u043D\u0430 \u0442\u0440\u043E\u043F\u0435 \u043A\u043E\u0441\u0443\u043B\u044E \u0438\u043B\u0438 \u043E\u043B\u0435\u043D\u044F.
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0414\u0435\u043D\u0434\u0440\u0430\u0440\u0438\u0439(\u0430\u0433\u0435\u043D\u0442)
TASK_CODE_1=F4L5N1
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0412 \u0442\u0435 \u0436\u0435 \u043E\u043A\u0440\u0435\u0441\u0442\u043D\u043E\u0441\u0442\u0438 \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0433\u0440\u0443\u043F\u043F\u0430 \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u043E\u0432. \u041E\u043D\u0438 \u0432\u0441\u0442\u0440\u0435\u0442\u0438\u043B\u0438 \u043D\u0430\u0448\u0438\u0445 \u0433\u0435\u0440\u043E\u0435\u0432 \u0432 \u043F\u0440\u043E\u043C\u0433\u043E\u0440\u043E\u0434\u043A\u0435 \u043D\u0435\u0434\u0430\u043B\u0435\u043A\u043E \u043E\u0442 \u043B\u0435\u0441\u0430. \u0418\u0445 \u043F\u0435\u0440\u0432\u043E\u0435 \u0437\u043D\u0430\u043A\u043E\u043C\u0441\u0442\u0432\u043E \u043D\u0435\u043B\u044C\u0437\u044F \u043D\u0430\u0437\u0432\u0430\u0442\u044C \u0443\u0434\u0430\u0447\u043D\u044B\u043C, \u0432\u0435\u0434\u044C \u0422\u0430\u043A\u0435\u0440 \u0438 \u0414\u0435\u0439\u043B \u043D\u0430\u043F\u0443\u0433\u0430\u043B\u0438 \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u0438\u043A\u043E\u0432. \u00AB\u0422\u0440\u0438. \u0410\u0441\u043F\u0438\u0440\u0438\u043D\u0430 \u043F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430\u00BB - \u0437\u0430\u0438\u043A\u0430\u044F\u0441\u044C \u0432\u044B\u0434\u0430\u0432\u0438\u043B \u0438\u0437 \u0441\u0435\u0431\u044F \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u0438\u043A, \u043D\u0430\u0434\u0435\u044F\u0441\u044C \u043F\u043E \u0441\u043A\u043E\u0440\u0435\u0435 \u0441\u0432\u0430\u043B\u0438\u0442\u044C \u043F\u0440\u043E\u0447\u044C, \u043F\u043E\u0434\u0430\u043B\u044C\u0448\u0435 \u043E\u0442 \u044D\u0442\u0438\u0445 \u0441\u0435\u043B\u044C\u0441\u043A\u0438\u0445. \u0418\u0445 \u0441\u0442\u0440\u0430\u0445 \u0443\u0441\u0438\u043B\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u043E\u0442 \u0440\u0430\u0441\u0441\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0439 \u043D\u043E\u0447\u044C\u044E \u0438\u0441\u0442\u043E\u0440\u0438\u0438 \u043E \u043C\u0430\u043D\u044C\u044F\u043A\u0435 \u0435\u0449\u0451 \u0441\u0438\u043B\u044C\u043D\u0435\u0439.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,2
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u043E\u0447\u044C\u044E \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u044B \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u043A\u0443\u043F\u0430\u0442\u044C\u0441\u044F \u043D\u0430 \u043E\u0437\u0435\u0440\u043E, \u0432\u0435\u0434\u044C \u0431\u0430\u043D\u0438 \u0440\u044F\u0434\u043E\u043C \u043D\u0435\u0442. \u0410 \u0432 \u0438\u0445 \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u0438 \u0435\u0449\u0451 \u0438 \u0436\u0435\u043D\u0449\u0438\u043D\u044B. \u041A\u043E\u043D\u0435\u0447\u043D\u043E \u0434\u0430\u0447\u0430 \u0443 \u043D\u0430\u0448\u0438\u0445 \u0433\u0435\u0440\u043E\u0435\u0432 \u043D\u0435 \u0422\u0440\u0438\u0410\u043D\u043E\u043D, \u043D\u043E \u0447\u0442\u043E \u0435\u0449\u0451 \u043C\u043E\u0436\u043D\u043E \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u043E\u043A\u043E\u043B\u043E \u043F\u0440\u043E\u043C\u044B\u0448\u043B\u0435\u043D\u043D\u043E\u0433\u043E \u0433\u043E\u0440\u043E\u0434\u043A\u0430 \u0432 \u0437\u0430\u0445\u043E\u043B\u0443\u0441\u0442\u044C\u0435.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0440\u043E\u043C\u044B\u0448\u043B\u0435\u043D\u043D\u0430\u044F 3\u0430
TASK_CODE_2=F254LN
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u042D\u043B\u043B\u0438\u0441\u043E\u043D \u043E\u0442\u043E\u0448\u043B\u0430 \u043A\u0443\u043F\u0430\u0442\u044C\u0441\u044F \u043F\u043E\u0434\u0430\u043B\u044C\u0448\u0435, \u0447\u0442\u043E\u0431\u044B \u043F\u043E\u043F\u043B\u0430\u0432\u0430\u0442\u044C \u0432 \u043E\u0434\u0438\u043D\u043E\u0447\u0435\u0441\u0442\u0432\u0435, \u043D\u043E \u0435\u0451 \u043F\u0443\u0433\u0430\u0435\u0442 \u0414\u0435\u0439\u043B, \u0440\u044B\u0431\u0430\u0447\u0430\u0449\u0438\u0439 \u043D\u0435\u043F\u043E\u0434\u0430\u043B\u0451\u043A\u0443, \u0438 \u043E\u043D\u0430 \u043F\u0430\u0434\u0430\u0435\u0442 \u0432 \u0432\u043E\u0434\u0443. \u042D\u043B\u043B\u0438\u0441\u043E\u043D \u0443\u0434\u0430\u0440\u044F\u0435\u0442\u0441\u044F \u0433\u043E\u043B\u043E\u0432\u043E\u0439 \u043E \u043A\u0430\u043C\u0435\u043D\u044C \u0438 \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442 \u0442\u043E\u043D\u0443\u0442\u044C, \u0414\u0435\u0439\u043B \u0438 \u0422\u0430\u043A\u0435\u0440 \u0441\u043F\u0430\u0441\u0430\u044E\u0442 \u0435\u0451, \u043E\u043D\u0438 \u043F\u044B\u0442\u0430\u044E\u0442\u0441\u044F \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u0441\u043A\u043E\u0440\u0443\u044E, \u043D\u043E \u0432 \u0442\u0430\u043A\u043E\u0439 \u0433\u043B\u0443\u0448\u0438, \u043D\u0435\u0442 \u0441\u0432\u044F\u0437\u0438 \u0438 \u043C\u043E\u0431\u0438\u043B\u044C\u043D\u044B\u0435 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u043D\u0435 \u0440\u0430\u0431\u043E\u0442\u0430\u044E\u0442. \u0421\u0442\u0443\u0434\u0435\u043D\u0442\u044B \u0440\u0435\u0448\u0430\u044E\u0442 \u0436\u0435, \u0447\u0442\u043E \u0435\u0451 \u043F\u043E\u0445\u0438\u0442\u0438\u043B\u0438. \u0422\u0435\u043C \u0431\u043E\u043B\u0435\u0435 \u043E\u043D\u0438 \u043D\u0430\u0448\u043B\u0438 \u0441\u0442\u0440\u0430\u043D\u043D\u0443\u044E \u0437\u0430\u043F\u0438\u0441\u043A\u0443 \u0438 \u043A\u0430\u043A \u0432\u043E\u0434\u0438\u0442\u044C\u0441\u044F \u0432 \u0444\u0438\u043B\u044C\u043C\u0430\u0445 \u0443\u0436\u0430\u0441\u0430\u0445, \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u044E\u0442 \u044D\u0442\u043E\u0442 \u043A\u0430\u043F\u0438\u0442\u0430\u0441\u0442\u0440\u0443\u043C \u043D\u0430 \u0441\u0432\u043E\u0439 \u0441\u0447\u0451\u0442 - (2+1+1+9-3+8-6+2+1):(5-5)(4-2+8-1):(5-5)(5-5)(500-87+25-21+100-200)(5-5)(550+39-550-38):(900-639+36).\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,2
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0414\u0435\u0439\u043B \u0438 \u0422\u0430\u043A\u0435\u0440 \u043D\u0430\u0438\u0437\u0443\u0441\u0442\u044C \u043F\u043E\u043C\u043D\u0438\u043B\u0438 \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0441\u0432\u043E\u0435\u0439 \u0434\u0430\u0447\u0438. \u0412\u0435\u0434\u044C \u0441\u0432\u043E\u044F \u0434\u0430\u0447\u0430 \u043C\u0435\u0447\u0442\u0430 \u0434\u0435\u0442\u0441\u0442\u0432\u0430.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041C\u043E\u0441\u043A\u043E\u0432\u0441\u043A\u0430\u044F \u0448\u043E\u0441\u0441\u0435, \u043E\u043A\u043E\u043B\u043E \u043C\u043E\u0439\u043A\u0438.
TASK_CODE_3=F43L7N
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0414\u0440\u0443\u0437\u044C\u044F \u0440\u0435\u0448\u0438\u043B\u0438 \u043E\u0442\u0432\u0435\u0437\u0442\u0438 \u042D\u043B\u043B\u0438\u0441\u043E\u043D \u0432 \u0431\u043E\u043B\u044C\u043D\u0438\u0446\u0443, \u043D\u043E \u0432 \u043D\u043E\u0447\u0438 \u0437\u0430\u043F\u043B\u0443\u0442\u0430\u043B\u0438 \u0438 \u0433\u043E\u043D\u044F\u043B\u0438 \u043F\u043E \u043A\u0440\u0443\u0433\u0443. \u0412 \u044D\u0442\u043E \u0432\u0440\u0435\u043C\u044F \u042D\u043B\u043B\u0438\u0441\u043E\u043D \u0432 \u0431\u0435\u0441\u043F\u0430\u043C\u044F\u0442\u0441\u0442\u0432\u0435 \u043F\u043E\u0432\u0442\u043E\u0440\u044F\u043B\u0430 \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0435 \u0441\u043B\u043E\u0432\u0430: \u041C\u043E\u0441\u043A\u043E\u0432\u0441\u043A\u0430\u044F \u0414\u0432\u043E\u0440\u044F\u043D\u0441\u043A\u0430\u044F \u041A\u043E\u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044F \u041C\u0430\u0440\u044C\u0438\u043D\u0441\u043A\u0430\u044F. \u0418 \u0442\u0430\u043A 504 \u0440\u0430\u0437\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0421\u0442\u0430\u0440\u044B\u0439 \u041B\u0435\u043A\u0441\u0443\u0441, \u0447\u0435\u0440\u043D\u043E\u0433\u043E \u0446\u0432\u0435\u0442\u0430, \u0422\u0430\u043A\u0435\u0440\u0430 \u043D\u0430\u043A\u043E\u043D\u0435\u0446 \u0442\u043E \u0432\u044B\u0435\u0445\u0430\u043B \u043E\u0431\u0440\u0430\u0442\u043D\u043E \u043A \u0434\u043E\u043C\u0443. \u0412 \u044D\u0442\u043E \u0432\u0440\u0435\u043C\u044F \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u044B \u0433\u043E\u0442\u043E\u0432\u044F\u0442 \u043F\u043B\u0430\u043D \u043F\u043E \u043E\u0441\u0432\u043E\u0431\u043E\u0436\u0434\u0435\u043D\u0438\u044E \u042D\u043B\u043B\u0438\u0441\u043E\u043D \u0438\u0437 \u043F\u043B\u0435\u043D\u0430. \u041E\u043D\u0438 \u0440\u0430\u0437 \u0437\u0430 \u0440\u0430\u0437\u043E\u043C \u043E\u0431\u0445\u043E\u0434\u044F\u0442 \u0434\u043E\u043C \u043A\u0440\u0443\u0433\u0430\u043C\u0438, \u043F\u043E\u043A\u0430 \u043D\u0430\u043A\u043E\u043D\u0435\u0446 \u043D\u0435 \u0437\u0430\u043C\u0435\u0447\u0430\u044E\u0442 \u043F\u043E\u0434\u044A\u0435\u0437\u0436\u0430\u044E\u0449\u0438\u0439 \u041B\u0435\u043A\u0441\u0443\u0441 \u0422\u0430\u043A\u0435\u0440\u0430.
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041D\u0430\u0439\u0434\u0438\u0442\u0435 \u0447\u0435\u0440\u043D\u044B\u0439 \u041B\u0435\u043A\u0441\u0443\u0441 \u0433\u043E\u0441\u043D\u043E\u043C\u0435\u0440 504, \u0434\u0432\u0438\u0433\u0430\u044F\u0441\u044C \u043F\u043E \u043A\u0440\u0443\u0433\u0443 \u043D\u0430 \u0443\u043B\u0438\u0446\u0430\u0445 \u041A\u0438\u0440\u043E\u0432\u0430, \u041B\u0435\u043D\u0438\u043D\u0430, \u0414\u0436\u0430\u043D\u0430\u0435\u0432\u0430, \u041C\u0430\u0440\u043A\u0443\u0441\u0430.
TASK_CODE_4=F7L7N7
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u042D\u043B\u043B\u0438\u0441\u043E\u043D \u043F\u043E\u043C\u043E\u0433\u0430\u0435\u0442 \u0414\u0435\u0439\u043B\u0443 \u0440\u044B\u0442\u044C \u044F\u043C\u0443 \u0434\u043B\u044F \u043E\u0442\u0432\u043E\u0434\u0430 \u0432\u043E\u0434\u044B \u043E\u0442 \u0440\u0435\u043A\u0438, \u0430 \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u044B \u0440\u0435\u0448\u0430\u044E\u0442, \u0447\u0442\u043E \u043C\u0430\u043D\u044C\u044F\u043A\u0438 \u0437\u0430\u0441\u0442\u0430\u0432\u0438\u043B\u0438 \u0435\u0451 \u043A\u043E\u043F\u0430\u0442\u044C \u0441\u0435\u0431\u0435 \u043C\u043E\u0433\u0438\u043B\u0443. \u041E\u043D\u0438 \u043F\u044B\u0442\u0430\u044E\u0442\u0441\u044F \u0441\u043F\u0430\u0441\u0442\u0438 \u0435\u0451, \u043D\u043E \u043E\u0434\u0438\u043D \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u043E \u043D\u0430\u043F\u0430\u0440\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u043D\u0430 \u0441\u0443\u043A, \u0443\u0431\u0435\u0433\u0430\u044F \u043E\u0442 \u0422\u0430\u043A\u0435\u0440\u0430, \u0440\u0430\u0437\u043C\u0430\u0445\u0438\u0432\u0430\u044E\u0449\u0435\u0433\u043E \u0431\u0435\u043D\u0437\u043E\u043F\u0438\u043B\u043E\u0439 (\u0422\u0430\u043A\u0435\u0440 \u0434\u0430\u0436\u0435 \u043D\u0435 \u0437\u0430\u043C\u0435\u0442\u0438\u043B \u044D\u0442\u043E\u0433\u043E, \u0435\u0433\u043E \u043F\u043E\u043A\u0443\u0441\u0430\u043B\u0438 \u043F\u0447\u0451\u043B\u044B \u0438 \u043E\u043D \u0431\u0435\u0436\u0430\u043B \u043E\u0442 \u043D\u0438\u0445), \u0434\u0440\u0443\u0433\u043E\u0439 \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u043E \u043F\u0440\u043E\u0442\u044B\u043A\u0430\u0435\u0442 \u0441\u0435\u0431\u044F \u043A\u043E\u043B\u043E\u043C, \u0442\u0440\u0435\u0442\u0438\u0439 \u0441\u0442\u0443\u0434\u0435\u043D\u0442 \u0438\u0437 \u0410\u0437\u0438\u0438 \u043F\u0440\u044B\u0433\u0430\u0435\u0442 \u0432 \u0434\u0435\u0440\u0435\u0432\u043E\u0434\u0440\u043E\u0431\u0438\u043B\u043A\u0443 \u0438 \u043F\u043E\u0433\u0438\u0431\u0430\u0435\u0442. \u041E\u0441\u0442\u0430\u0432\u0448\u0438\u0435\u0441\u044F \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u044B \u0440\u0435\u0448\u0430\u044E\u0442, \u0447\u0442\u043E \u0438\u0445 \u0442\u043E\u0432\u0430\u0440\u0438\u0449\u0435\u0439 \u0443\u0431\u0438\u043B\u0438 \u0443\u0436\u0430\u0441\u043D\u044B\u0435 \u043C\u0430\u043D\u044C\u044F\u043A\u0438, \u0430 \u0434\u0435\u0440\u0435\u0432\u0435\u043D\u0441\u043A\u0438\u0435 \u043F\u0430\u0440\u043D\u0438, \u043F\u0440\u0438\u0441\u0435\u0432 \u043D\u0430 \u043B\u0430\u0432\u043E\u0447\u043A\u0443, \u043D\u0430\u0447\u0438\u043D\u0430\u044E\u0442 \u0441\u0447\u0438\u0442\u0430\u0442\u044C, \u0447\u0442\u043E \u00AB\u0441\u0442\u0443\u0434\u0435\u043D\u0442\u044B \u043F\u0440\u0438\u0435\u0445\u0430\u043B\u0438 \u0438 \u0441\u0430\u043C\u043E\u0443\u0431\u0438\u0432\u0430\u044E\u0442\u0441\u044F \u043D\u0430 \u0441\u0432\u0435\u0436\u0435\u043C \u0432\u043E\u0437\u0434\u0443\u0445\u0435\u00BB. \u041A\u0441\u0442\u0430\u0442\u0438, \u0432 \u044F\u043C\u0435 \u043E\u043D\u0438 \u043D\u0430\u0448\u043B\u0438 \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043D\u0443\u044E \u043C\u043E\u043D\u0435\u0442\u0443, \u043A \u0441\u043E\u0436\u0430\u043B\u0435\u043D\u0438\u044E, \u0434\u0440\u0443\u0433\u0430\u044F \u0441\u0442\u043E\u0440\u043E\u043D\u0430 \u0431\u0435\u0437\u0432\u043E\u0437\u0432\u0440\u0430\u0442\u043D\u043E \u0438\u0441\u043F\u043E\u0440\u0447\u0435\u043D\u0430. \u0410 \u0442\u0430\u043A \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043D\u043E \u0447\u0442\u043E \u0436\u0435 \u043D\u0430 \u0434\u0440\u0443\u0433\u043E\u0439 \u0441\u0442\u043E\u0440\u043E\u043D\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0421\u0442\u0443\u0434\u0435\u043D\u0442\u044B \u0432\u044B\u0437\u044B\u0432\u0430\u044E\u0442 \u0448\u0435\u0440\u0438\u0444\u0430 \u0421\u0438\u0445\u0443, \u043D\u043E \u0442\u043E\u0442 \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u043E \u043F\u043E\u0433\u0438\u0431\u0430\u0435\u0442 \u043F\u0440\u044F\u043C\u043E \u0432 \u0434\u043E\u043C\u0435 \u0422\u0430\u043A\u0435\u0440\u0430. \u041F\u0440\u043E\u0431\u0438\u0432 \u0431\u0430\u0448\u043A\u0443 \u043A\u0443\u0441\u043A\u043E\u043C \u0431\u0430\u043B\u043A\u0438 \u0441 \u0433\u0432\u043E\u0437\u044F\u043C\u0438. \u0421\u043D\u044F\u0432 \u043F\u0438\u0441\u0442\u043E\u043B\u0435\u0442 \u0448\u0435\u0440\u0438\u0444\u0430 \u0441 \u043F\u0440\u0435\u0434\u043E\u0445\u0440\u043D\u0438\u0442\u0435\u043B\u044F, \u0433\u0438\u0431\u043D\u0435\u0442 \u0438 \u0422\u043E\u0434\u0434. \u042D\u043A\u0448\u0435\u043D \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0430\u0435\u0442\u0441\u044F, \u0427\u0435\u0434 \u0431\u0435\u0440\u0451\u0442 \u0432 \u0437\u0430\u043B\u043E\u0436\u043D\u0438\u043A\u0438 \u043F\u0441\u0430 \u0414\u0435\u0439\u043B\u0430, \u0438 \u0433\u0440\u043E\u0437\u0438\u0442\u0441\u044F \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u0441 \u043D\u0438\u043C \u0443\u0436\u0430\u0441\u043D\u044B\u0435 \u0432\u0435\u0449\u0438, \u0431\u0443\u0434\u0442\u043E \u0443 \u043D\u0435\u0433\u043E \u0430\u0437\u0438\u0430\u0442\u0441\u043A\u0438\u0435 \u043A\u043E\u0440\u043D\u0438. \u041D\u043E \u0422\u0430\u043A\u0435\u0440 \u0441\u043F\u0430\u0441\u0430\u0435\u0442 \u0441\u043E\u0431\u0430\u043A\u0443, \u0441\u0442\u0440\u0435\u043B\u044F\u044F \u043F\u043E \u0433\u043B\u0430\u0437\u0430\u043C \u0438\u0437 \u0432\u043E\u0434\u043D\u043E\u0439 \u043F\u0443\u0448\u043A\u0438. \u0421\u0442\u0443\u0434\u0435\u043D\u0442\u044B \u0431\u0435\u0440\u0443\u0442 \u0422\u0430\u043A\u0435\u0440\u0430 \u0432 \u0437\u0430\u043B\u043E\u0436\u043D\u0438\u043A\u0438 \u0438 \u043E\u0442\u0440\u0443\u0431\u0430\u044E\u0442 \u043F\u0430\u043B\u044C\u0446\u044B \u043D\u0435\u0441\u0447\u0430\u0441\u0442\u043D\u043E\u043C\u0443 \u0444\u0435\u0440\u043C\u0435\u0440\u0443, \u043A\u0430\u043A \u0432 \u0434\u0435\u0448\u0451\u0432\u043E\u043C \u043A\u0438\u0442\u0430\u0439\u0441\u043A\u043E\u043C \u0431\u043E\u0435\u0432\u0438\u043A\u0435.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u0438\u0442\u0430\u0439\u0441\u043A\u0430\u044F \u0432\u043E\u0434\u043D\u0430\u044F \u0441\u043F\u0443\u0441\u043A \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u0410\u0442\u0435\u044F
TASK_CODE_5=F3L1N6
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u041F\u043E\u043A\u0430 \u0414\u0435\u0439\u043B \u0432\u044B\u0440\u0443\u0447\u0430\u0435\u0442 \u0422\u0430\u043A\u0435\u0440\u0430, \u0432 \u0435\u0433\u043E \u0434\u043E\u043C \u043F\u0440\u0438\u0445\u043E\u0434\u044F\u0442 \u0427\u0435\u0434 \u0438 \u041D\u0430\u043E\u043C\u0438, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043F\u044B\u0442\u0430\u044E\u0442\u0441\u044F \u00AB\u0441\u043F\u0430\u0441\u0442\u0438\u00BB \u042D\u043B\u043B\u0438\u0441\u043E\u043D. \u041F\u043E \u043F\u0440\u0438\u0445\u043E\u0434\u0443 \u0434\u0440\u0443\u0437\u0435\u0439 \u042D\u043B\u043B\u0438\u0441\u043E\u043D \u0443\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u0435\u0442 \u0427\u0435\u0434\u0443 \u0438 \u0414\u0435\u0439\u043B\u0443 \u043E\u0447\u043D\u0443\u044E \u0441\u0442\u0430\u0432\u043A\u0443, \u043D\u043E \u0432 \u0434\u043E\u043C \u0432\u0440\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0435 \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u044B \u0438 \u0443\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u044E\u0442 \u043F\u0435\u0440\u0435\u043F\u043E\u043B\u043E\u0445. \u0414\u043E\u043C \u0437\u0430\u0433\u043E\u0440\u0430\u0435\u0442\u0441\u044F, \u0438 \u043E\u0433\u043E\u043D\u044C \u043E\u0445\u0432\u0430\u0442\u044B\u0432\u0430\u0435\u0442 \u0435\u0433\u043E \u0432\u0435\u0441\u044C. \u041F\u043E\u0433\u0438\u0431\u0430\u044E\u0442 \u043F\u043E\u0447\u0442\u0438 \u0432\u0441\u0435 \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u044B, \u043D\u043E \u043D\u0430\u0448\u0438 \u0434\u0440\u0443\u0437\u044C\u044F \u0443\u0441\u043F\u0435\u0432\u0430\u044E\u0442 \u0432\u044B\u0431\u0440\u0430\u0442\u044C\u0441\u044F. \u0412 \u043E\u0442\u0431\u043B\u0435\u0441\u043A\u0435 \u0417\u0432\u0435\u0437\u0434\u043D\u043E\u0433\u043E \u043F\u0443\u0442\u0438 \u0427\u044D\u0434 \u0440\u0438\u0441\u0443\u0435\u0442 \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0435 \u0441\u0438\u043C\u0432\u043E\u043B\u044B \u043D\u0430 \u043F\u0435\u0441\u043A\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,3+
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0420\u0435\u0431\u044F\u0442\u0430 \u043F\u044B\u0442\u0430\u044E\u0442\u0441\u044F \u0441\u0431\u0435\u0436\u0430\u0442\u044C, \u043D\u043E \u043F\u043E\u043F\u0430\u0434\u0430\u044E\u0442 \u0432 \u0430\u0432\u0430\u0440\u0438\u044E. \u0427\u0435\u0434 \u0445\u0432\u0430\u0442\u0430\u0435\u0442 \u042D\u043B\u043B\u0438\u0441\u043E\u043D \u0438 \u0442\u0430\u0449\u0438\u0442 \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u043B\u0435\u0441\u0430. \u00AB\u0421\u0435\u0439\u0447\u0430\u0441 \u0442\u044B \u0443 \u043C\u0435\u043D\u044F \u043F\u043E\u043B\u0443\u0447\u0438\u0448\u044C, \u0431\u0435\u0441\u043F\u043E\u043B\u0435\u0437\u043D\u044B\u0439 \u043C\u0435\u0448\u043E\u043A, \u043F\u0440\u0435\u0438\u043C\u0443\u0449\u0435\u0441\u0442\u0432\u0435\u043D\u043D\u043E \u0441 \u0432\u043E\u0434\u043E\u0439\u00BB. \u041E\u043D\u0438 \u0441\u043A\u0440\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u0432 \u043B\u0435\u0441\u0443. \u0410 \u043D\u0430\u0448\u0438 \u0434\u0435\u0440\u0435\u0432\u0435\u043D\u0441\u043A\u0438\u0435 \u0434\u0440\u0443\u0437\u044C\u044F \u0440\u0430\u0437\u0434\u0435\u043B\u044F\u044E\u0442\u0441\u044F, \u0442\u0430\u043A \u043A\u0430\u043A \u0422\u0430\u043A\u0435\u0440\u0430 \u0437\u0430\u0436\u0430\u043B\u043E \u0432 \u0430\u0432\u0442\u043E\u043C\u043E\u0431\u0438\u043B\u0435. \u0414\u0435\u0439\u043B \u0431\u0440\u043E\u0441\u0430\u0435\u0442\u0441\u044F \u043D\u0430 \u0432\u044B\u0440\u0443\u0447\u043A\u0443 \u043E\u0434\u0438\u043D.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u043F\u043E\u0432 \u0445\u0443\u0442\u043E\u0440.
TASK_CODE_6=F91LN3
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0414\u0435\u0439\u043B \u043F\u0435\u0440\u0435\u0432\u043E\u043F\u043B\u043E\u0449\u0430\u0435\u0442\u0441\u044F \u0432 \u00AB\u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0435\u0433\u043E \u043C\u0430\u043D\u044C\u044F\u043A\u0430\u00BB \u0438 \u0431\u0435\u0440\u0451\u0442 \u0431\u0435\u043D\u0437\u043E\u043F\u0438\u043B\u0443 \u0444\u0438\u0440\u043C\u044B Jackdaw 188. \u041E\u043D \u0431\u043B\u0443\u0436\u0434\u0430\u0435\u0442 \u043F\u043E \u043B\u0435\u0441\u043E\u043F\u0438\u043B\u043A\u0435, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0434\u043B\u044F \u043D\u0435\u0433\u043E \u043F\u0440\u0435\u0432\u0440\u0430\u0442\u0438\u043B\u0430\u0441\u044C \u0432 \u0431\u0435\u0441\u043A\u043E\u043D\u0435\u0447\u043D\u044B\u0439 \u0442\u0443\u043F\u0438\u043A. \u041D\u0430\u043A\u043E\u043D\u0435\u0446 \u043E\u043D \u0432\u0438\u0434\u0438\u0442 \u0441\u0432\u043E\u044E \u0432\u043E\u0437\u043B\u044E\u0431\u043B\u0435\u043D\u043D\u0443\u044E, \u0437\u043B\u043E\u0434\u0435\u0439 \u043F\u043E\u043C\u0435\u0441\u0442\u0438\u043B \u0435\u0435 \u0432 \u043E\u0433\u0440\u043E\u043C\u043D\u044B\u0439 \u0440\u0435\u0437\u0435\u0440\u0432\u0443\u0430\u0440 \u0441 \u0432\u043E\u0434\u043E\u0439 \u0438 \u0445\u043E\u0447\u0435\u0442 \u0443\u0442\u043E\u043F\u0438\u0442\u044C. \u041D\u0430\u0448 \u0433\u0435\u0440\u043E\u0439 \u0431\u0440\u043E\u0441\u0430\u0435\u0442\u0441\u044F \u043D\u0430 \u0432\u044B\u0440\u0443\u0447\u043A\u0443\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442 (\u0437\u0430 \u0431\u0443\u0439\u043A\u0438 \u043D\u0435 \u0437\u0430\u043F\u043B\u044B\u0432\u0430\u0442\u044C) \u2013 (\u0441\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439)
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u044B\u0440\u043D\u0443\u0432 \u043D\u0430 \u0441\u0430\u043C\u0443\u044E \u0433\u043B\u0443\u0431\u0438\u043D\u0443 \u043E\u043D \u0441\u043F\u0430\u0441\u0430\u0435\u0442 \u042D\u043B\u0438\u0441\u0441\u043E\u043D. \u041F\u043E\u0431\u0435\u0434\u0438\u043B \u043C\u0430\u043B\u0435\u043D\u044C\u043A\u043E\u0433\u043E \u043C\u0430\u043D\u044C\u044F\u043A\u0430, \u043E\u043D\u0438 \u0432\u044B\u0445\u043E\u0434\u044F\u0442 \u043D\u0430 \u0443\u043B\u0438\u0446\u0443, \u0441\u0432\u0435\u0442\u0430\u0435\u0442 \u0438 \u0433\u0434\u0435 \u0442\u043E \u0432 \u0434\u0435\u0440\u0435\u0432\u044C\u044F\u0445 \u043F\u043E\u044E\u0442 \u043F\u0442\u0438\u0446\u044B. \u041A\u0430\u0436\u0435\u0442\u0441\u044F \u0433\u0430\u043B\u043A\u0438. \u041D\u0435\u043C\u043D\u043E\u0433\u043E \u043F\u043E\u0437\u0436\u0435, \u0414\u0435\u0439\u043B \u043D\u0430\u0432\u0435\u0449\u0430\u0435\u0442 \u0434\u0440\u0443\u0433\u0430 \u0432 \u0431\u043E\u043B\u044C\u043D\u0438\u0446\u0435, \u0433\u0434\u0435 \u0435\u043C\u0443 \u043F\u0440\u0438\u0448\u0438\u043B\u0438 \u043F\u0430\u043B\u044C\u0446\u044B (\u043E\u0434\u0438\u043D \u2014 \u0436\u0435\u043D\u0441\u043A\u0438\u0439).  \u0414\u0435\u0439\u043B \u0447\u0438\u0442\u0430\u0435\u0442 \u043A\u043D\u0438\u0433\u0443 \u043E\u0434\u043D\u043E\u0433\u043E \u0430\u0432\u0442\u043E\u0440\u0430, \u0437\u0430\u043D\u044F\u0432\u0448\u0435\u0433\u043E 12 \u043C\u0435\u0441\u0442\u043E \u0441\u0440\u0435\u0434\u0438 \u0441\u0430\u043C\u044B\u0445 \u0432\u043B\u0438\u044F\u0442\u0435\u043B\u044C\u043D\u044B\u0445 \u0438\u043D\u0442\u0435\u043B\u043B\u0435\u043A\u0442\u0443\u0430\u043B\u043E\u0432 \u0441\u0442\u0440\u0430\u043D\u044B. \u0412\u043E \u0432\u0440\u0435\u043C\u044F \u0441\u0432\u0438\u0434\u0430\u043D\u0438\u044F \u0432 \u0431\u043E\u0443\u043B\u0438\u043D\u0433-\u0446\u0435\u043D\u0442\u0440\u0435 \u00AB188\u00BB \u0414\u0435\u0439\u043B \u0438 \u042D\u043B\u043B\u0438\u0441\u043E\u043D \u0446\u0435\u043B\u0443\u044E\u0442\u0441\u044F. \u0414\u0435\u0439\u043B \u043F\u043E\u043D\u0438\u043C\u0430\u0435\u0442, \u0447\u0442\u043E \u00AB\u0436\u0438\u0437\u043D\u044C \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u043A\u043E\u0440\u043E\u0442\u043A\u0430, \u0447\u0442\u043E\u0431\u044B \u043A\u043E\u043C\u043F\u043B\u0435\u043A\u0441\u043E\u0432\u0430\u0442\u044C \u043F\u043E \u043F\u0443\u0441\u0442\u044F\u043A\u0430\u043C\u00BB.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0413\u0430\u043B\u043A\u043E\u0432\u0441\u043A\u043E\u0433\u043E 188.
TASK_CODE_7=FL696N
BONUS_FIVE_MINUTES=DB87
BONUS_TEN_MINUTES=FB89
BONUS_FIFTEEN_MINUTES=ZR34