#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="\u0427\u0438\u043F \u0438 \u0414\u0435\u0439\u043B \u0441\u043F\u0435\u0448\u0430\u0442 \u043D\u0430 \u043F\u043E\u043C\u043E\u0449\u044C"\n\n\u041D\u0430\u0434 \u0433\u043E\u0440\u043E\u0434\u043E\u043C \u0437\u0430\u0442\u0438\u0448\u044C\u0435. \u0421\u043F\u0430\u0441\u0430\u0442\u0435\u043B\u0438 \u0438\u0437\u043D\u044B\u0432\u0430\u044E\u0442 \u043E\u0442 \u0441\u043A\u0443\u043A\u0438. \u0413\u0430\u0439\u043A\u0430 \u043F\u0440\u0438\u0432\u043E\u0434\u0438\u0442 \u0432 \u043F\u043E\u0440\u044F\u0434\u043E\u043A \u0432\u0435\u0447\u043D\u043E \u043B\u043E\u043C\u0430\u044E\u0449\u0438\u0439\u0441\u044F \u0441\u0430\u043C\u043E\u043B\u0435\u0442. \u0427\u0438\u043F \u0441\u043F\u043E\u0440\u0438\u0442 \u0441 \u0414\u0435\u0439\u043B\u043E\u043C, \u0442\u043E \u0438 \u0434\u0435\u043B\u043E, \u0440\u0430\u0437\u0432\u043E\u0434\u044F \u0434\u0440\u0430\u043A\u0438. \u0420\u043E\u043A\u0444\u043E\u0440 \u043D\u0430\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u0435\u0442 \u043D\u043E\u0441 \u0434\u043B\u044F \u043B\u0443\u0447\u0448\u0435\u0433\u043E \u0432\u043E\u0441\u043F\u0440\u0438\u044F\u0442\u0438\u044F \u0437\u0430\u043F\u0430\u0445\u0430 \u0441\u044B\u0440\u0430. \u0412\u0436\u0438\u043A, \u0436\u0443\u0436\u0436\u0430, \u043F\u0435\u0440\u0435\u043B\u0435\u0442\u0430\u0435\u0442 \u043E\u0442 \u043E\u0434\u043D\u043E\u0433\u043E \u043A \u0434\u0440\u0443\u0433\u043E\u043C\u0443.\n\u0413\u0434\u0435 \u0442\u043E \u0432 \u0433\u043E\u0440\u043E\u0434\u0435 \u0441\u0433\u043E\u0440\u0435\u043B\u0430 \u043F\u043E\u0434\u0441\u0442\u0430\u043D\u0446\u0438\u044F. \u041F\u043E\u0440\u0430 \u0432 \u043F\u0443\u0442\u044C, \u0440\u0430\u0437\u043E\u0431\u0440\u0430\u0442\u044C\u0441\u044F, \u0447\u0442\u043E \u043F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u043E.
START_CODE=cd
START_DATE=06-10-2018
START_TIME=22-00
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0410\u0433\u0435\u043D\u0442)\n\u0412\u0441\u0435 \u0438\u043C\u0435\u0435\u0442 \u0441\u0432\u043E\u0435 \u043D\u0430\u0447\u0430\u043B\u043E \u0438 \u043A\u043E\u043D\u0435\u0446. \u041B\u044E\u0431\u0430\u044F \u0438\u0441\u0442\u043E\u0440\u0438\u044F. \u0410 \u0433\u0434\u0435 \u0431\u0435\u0440\u0435\u0442 \u043D\u0430\u0447\u0430\u043B\u043E \u043D\u0430\u0448\u0435 \u043F\u043E\u0432\u0435\u0441\u0442\u0432\u043E\u0432\u0430\u043D\u0438\u0435? \u0413\u0434\u0435 \u0442\u043E \u0441\u0435\u043A\u0440\u0435\u0442\u043D\u043E\u0435 \u043C\u0435\u0441\u0442\u043E? \u041D\u0443 \u0434\u0430 \u043B\u0430\u0434\u043D\u043E, \u0430\u0432\u043E\u0441\u044C \u0434\u043E\u0433\u0430\u0434\u0430\u0435\u0442\u0435\u0441\u044C. \u0410 \u043F\u043E\u043A\u0430 \u0432\u0435\u0440\u043D\u0435\u043C\u0441\u044F \u043A \u043D\u0430\u0448\u0438\u043C \u0431\u0430\u0440\u0430\u043D\u0430\u043C, \u0442\u044C\u0444\u0443, \u0442\u043E \u0435\u0441\u0442\u044C \u0431\u0443\u0440\u0443\u043D\u0434\u0443\u043A\u0430\u043C. \u0427\u0438\u043F \u0438 \u0414\u0435\u0439\u043B \u043F\u0440\u043E\u0431\u0440\u0430\u043B\u0438\u0441\u044C \u0432 \u043F\u043E\u043B\u0438\u0446\u0435\u0439\u0441\u043A\u0438\u0439 \u0443\u0447\u0430\u0441\u0442\u043E\u043A \u0438 \u0436\u0434\u0430\u043B\u0438, \u043A\u043E\u0433\u0434\u0430 \u0436\u0435 \u0438\u043C \u043F\u043E\u0434\u0432\u0435\u0440\u043D\u0435\u0442\u0441\u044F \u0438\u0445 \u043F\u0435\u0440\u0432\u043E\u0435 \u0437\u0430\u0434\u0430\u043D\u0438\u0435. \u041E\u0436\u0438\u0434\u0430\u043D\u0438\u0435, \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u043B\u043E \u043F\u043E\u0434 \u0448\u0443\u043C \u0440\u0430\u0431\u043E\u0442\u043D\u0438\u043A\u043E\u0432 \u0443\u0447\u0430\u0441\u0442\u043A\u0430, \u043F\u043E\u0434 \u0441\u043A\u0440\u0438\u043F \u0440\u0443\u0447\u0435\u043A, \u0437\u0430\u043F\u043E\u043B\u043D\u044F\u0432\u0448\u0438\u0445 \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u044B\u0435 \u0437\u0430\u044F\u0432\u043A\u0438 \u0438 \u0434\u043E\u0433\u043E\u0432\u043E\u0440\u0430. \u0420\u043E\u043A\u0444\u043E\u0440 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u043B \u0441\u0442\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0435 \u044D\u043B\u0435\u043A\u0442\u0440\u0438\u0447\u0435\u0441\u0442\u0432\u0430 \u2013 \u0421\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u0438 \u0437\u0430\u043F\u043E\u043C\u0438\u043D\u0430\u0439\u0442\u0435, \u043D\u0430\u0434\u043E \u043F\u043E\u0442\u0435\u0440\u0435\u0442\u044C \u0448\u0435\u0440\u0441\u0442\u044C, \u0447\u0442\u043E\u0431\u044B \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0437\u0430\u0440\u044F\u0434, \u0430 \u043F\u043E\u0442\u043E\u043C \u0440\u0430\u0437\u0440\u044F\u0434. \u0418 \u0440\u0430\u0437\u0440\u044F\u0434\u0438\u043B \u0435\u0433\u043E \u0432 \u0427\u0438\u043F\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0430 \u0441\u0442\u043E\u043B\u0435 \u0448\u0435\u0440\u0438\u0444\u0430 \u0441\u0442\u043E\u044F\u043B\u0430 \u0432\u0430\u0437\u0430. \u0426\u0432\u0435\u0442\u044B \u044F\u0440\u043A\u043E \u0432\u044B\u0434\u0435\u043B\u044F\u043B\u0438\u0441\u044C \u043D\u0430 \u0440\u0430\u0431\u043E\u0447\u0435\u043C \u0441\u0442\u043E\u043B\u0435. \u0411\u0440\u0438\u0444\u0438\u043D\u0433 \u0431\u044B\u043B \u0432 \u0441\u0430\u043C\u043E\u043C \u0440\u0430\u0437\u0433\u0430\u0440\u0435. \u0427\u0438\u043F \u044D\u043A\u0441\u043F\u0435\u0440\u0438\u043C\u0435\u043D\u0442\u0438\u0440\u043E\u0432\u0430\u043B \u0441 \u044D\u043B\u0435\u043A\u0442\u0440\u0438\u0447\u0435\u0441\u0442\u0432\u043E\u043C \u0438 \u0414\u0435\u0439\u043B\u043E\u043C, \u0437\u0430 \u0447\u0442\u043E \u043F\u043E\u043B\u0443\u0447\u0430\u043B \u0442\u0443\u043C\u0430\u043A\u0438. \u0420\u043E\u043A\u0444\u043E\u0440 \u0443\u0447\u0443\u044F\u043B \u0437\u0430\u043F\u0430\u0445 \u0441\u044B\u0440\u0430 \u043E\u0442 \u0447\u0438\u0437\u0431\u0443\u0440\u0433\u0435\u0440\u0430 \u0438 \u043A\u0430\u043A \u043E\u0433\u043E\u043B\u0442\u0435\u043B\u044B\u0439 \u0431\u0440\u043E\u0441\u0438\u043B\u0441\u044F \u0432 \u0430\u0442\u0430\u043A\u0443.
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041C\u0435\u0441\u0442\u043E \u0431\u0440\u0438\u0444\u0438\u043D\u0433\u0430, \u0414\u043E\u0432\u0430\u0442\u043E\u0440\u0430 248
TASK_CODE_1=F9L9N9
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u0412 \u0442\u043E\u0442 \u0441\u0430\u043C\u044B\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u043A\u043E\u0433\u0434\u0430 \u0448\u0435\u0444 \u043F\u044B\u0442\u0430\u043B\u0441\u044F \u0443\u043A\u0443\u0441\u0438\u0442\u044C \u0447\u0438\u0437\u0431\u0443\u0440\u0433\u0435\u0440, \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u0435\u0433\u043E \u0441\u0442\u043E\u043B\u0430, \u043E\u043A\u043E\u043B\u043E \u043A\u0430\u0440\u0442\u044B \u0433\u043E\u0440\u043E\u0434\u0430, \u043E\u0442\u043A\u0440\u044B\u043B\u0438\u0441\u044C \u0434\u0432\u0435\u0440\u0438. \u0421\u0442\u0435\u043D\u044C\u043A\u0430 \u0441\u043B\u043E\u0432\u043D\u043E \u043E\u0442\u043E\u0434\u0432\u0438\u043D\u0443\u043B\u0430\u0441\u044C \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u0438 \u0432 \u043A\u043E\u043C\u043D\u0430\u0442\u0443 \u0432\u043E\u0448\u043B\u0430 \u0434\u0435\u0432\u043E\u0447\u043A\u0430. \u0420\u0430\u0437\u0438\u043D\u0443\u0432 \u0440\u043E\u0442, \u043E\u043D\u0430 \u0433\u0440\u043E\u043C\u043A\u043E \u0440\u044B\u0434\u0430\u043B\u0430. \u0421\u0442\u0440\u0435\u043B\u043A\u0438 \u043C\u0435\u0434\u043B\u0435\u043D\u043D\u043E \u043A\u0430\u0442\u0438\u043B\u0438\u0441\u044C \u043A \u0447\u0435\u0442\u044B\u0440\u0435\u043C, \u0430 \u0434\u0435\u0432\u043E\u0447\u043A\u0430 \u0432\u0441\u0435 \u043D\u0438\u043A\u0430\u043A \u043D\u0435 \u043C\u043E\u0433\u043B\u0430 \u0443\u0441\u043F\u043E\u043A\u043E\u0438\u0442\u044C\u0441\u044F - \u0425\u0440\u0430\u0431\u0440\u0435\u0446 \u043F\u0440\u043E\u043F\u0430\u043B, \u043F\u043E\u043C\u043E\u0433\u0438\u0442\u0435 \u043D\u0430\u0439\u0442\u0438 \u0445\u0440\u0430\u0431\u0440\u0435\u0446\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0411\u0443\u0434\u0442\u043E \u043A\u043E\u043C\u0441\u043E\u043C\u043E\u043B\u043A\u0430 \u043D\u0430 \u043F\u0430\u0440\u0430\u0434\u0435, \u0434\u0435\u0432\u043E\u0447\u043A\u0430 \u0441\u0442\u043E\u044F\u043B\u0430 \u043F\u0435\u0440\u0435\u0434 \u0448\u0435\u0444\u043E\u043C \u0438 \u0443\u043C\u043E\u043B\u044F\u043B\u0430 \u0435\u0433\u043E \u043D\u0430\u0439\u0442\u0438 \u0435\u0435 \u043A\u043E\u0442\u0438\u043A\u0430. \u042D\u0442\u043E \u0434\u0435\u043B\u043E \u0434\u043B\u044F \u0441\u043F\u0430\u0441\u0430\u0442\u0435\u043B\u0435\u0439. \u0418 \u0442\u0430\u043A \u0440\u0430\u0437\u0434\u0435\u043B\u0438\u043C\u0441\u044F, \u0442\u044B, \u0420\u043E\u043A\u0444\u043E\u0440 \u0431\u0435\u0433\u0438 \u0437\u0430 \u0413\u0430\u0435\u0447\u043A\u043E\u0439, \u0430 \u043C\u044B \u0441 \u0427\u0438\u043F\u043E\u043C \u043E\u0441\u043C\u043E\u0442\u0440\u0438\u043C \u0435\u0435 \u0434\u043E\u043C. \u0414\u043E\u043C \u043D\u0430\u0445\u043E\u0434\u0438\u043B\u0441\u044F \u043D\u0435\u0434\u0430\u043B\u0435\u043A\u043E \u043E\u0442 \u043F\u0430\u0440\u043A\u0430, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u0431\u044B\u043B \u0437\u0430\u0431\u0440\u043E\u0448\u0435\u043D\u043D\u044B\u0439 \u043C\u043E\u0441\u0442, \u043D\u043E \u043D\u0435 \u0431\u044B\u043B\u043E \u0440\u0435\u043A\u0438. \u0418\u0434\u0435\u0430\u043B\u044C\u043D\u043E\u0435 \u043C\u0435\u0441\u0442\u043E \u0434\u043B\u044F \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043B\u0435\u043D\u0438\u044F.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041C\u043E\u0441\u0442\u0438\u043A \u0432 \u043A\u043E\u043C\u0441\u043E\u043C\u043E\u043B\u044C\u0441\u043A\u043E\u043C \u043F\u0430\u0440\u043A\u0435.
TASK_CODE_2=F46LN7
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n\u041E\u0441\u043C\u043E\u0442\u0440\u0435\u0432 \u043C\u0435\u0441\u0442\u043E \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043B\u0435\u043D\u0438\u044F \u0441\u043F\u0430\u0441\u0430\u0442\u0435\u043B\u0438 \u043F\u0440\u0438\u0448\u043B\u0438 \u043A \u0432\u044B\u0432\u043E\u0434\u0443, \u0447\u0442\u043E \u0442\u0430\u043A\u0438\u0435 \u0441\u043B\u0435\u0434\u044B \u043C\u043E\u0433 \u043E\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u043B\u0438\u0431\u043E \u043C\u0435\u0434\u0432\u0435\u0434\u044C, \u043B\u0438\u0431\u043E \u043F\u0443\u043C\u0430. \u041D\u043E \u0441\u043A\u043E\u0440\u0435\u0435 \u0432\u0441\u0435\u0433\u043E \u043C\u0435\u0434\u0432\u0435\u0434\u044C. \u0417\u043D\u0430\u0447\u0438\u0442 \u043D\u0430\u0434\u043E \u0438\u0441\u043A\u0430\u0442\u044C \u0435\u0433\u043E \u043D\u0435\u0434\u0430\u043B\u0435\u043A\u043E \u043E\u0442 \u0441\u043E\u0431\u0441\u0442\u0432\u0435\u043D\u043D\u043E\u0433\u043E \u0436\u0438\u043B\u0438\u0449\u0430. \u041F\u0440\u043E\u0434\u0438\u0440\u0430\u044F\u0441\u044C \u0441\u043A\u0432\u043E\u0437\u044C \u043F\u0430\u0440\u043A, \u0441\u043F\u0430\u0441\u0430\u0442\u0435\u043B\u0438 \u0441\u0442\u0430\u043D\u043E\u0432\u0438\u043B\u0438\u0441\u044C \u043D\u0430 \u043F\u0443\u0442\u044C \u0441\u0432\u043E\u0435\u0439 \u043F\u043E\u0431\u0435\u0434\u044B. \u0427\u0435\u0440\u0435\u0437 \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0420\u043E\u043A\u0444\u043E\u0440 \u0438 \u0427\u0438\u043F \u043E\u043A\u0430\u0437\u0430\u043B\u0438\u0441\u044C \u0432 \u043A\u043E\u0448\u0430\u0447\u044C\u0435\u043C \u043F\u0435\u0440\u0435\u0443\u043B\u043A\u0435, \u0430 \u0442\u0430\u043C \u0442\u0432\u043E\u0440\u0438\u043B\u043E\u0441\u044C \u0444\u043E\u0440\u043C\u0435\u043D\u043D\u043E\u0435 \u0431\u0435\u0437\u043E\u0431\u0440\u0430\u0437\u0438\u0435. \u0412\u0441\u0435 \u0441\u0442\u0435\u043D\u044B \u0431\u044B\u043B\u0438 \u0443\u043B\u0435\u043F\u043B\u0435\u043D\u044B \u043C\u044B\u0448\u0430\u043C\u0438, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0440\u0430\u0437\u0432\u043B\u0435\u043A\u0430\u043B\u0438\u0441\u044C, \u043A\u0430\u043A \u043C\u043E\u0433\u043B\u0438.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0412 \u0431\u0435\u0440\u043B\u043E\u0433\u0435 \u043A\u043E\u0448\u0435\u043A \u0442\u0432\u043E\u0440\u0438\u043B\u043E\u0441\u044C \u0447\u0435\u0440\u0442\u0438 \u0447\u0442\u043E, \u0432\u043E \u0432\u0441\u0435 \u0441\u0442\u043E\u0440\u043E\u043D\u044B, \u043A\u0443\u0434\u0430 \u043D\u0435 \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0438 \u0431\u044B\u043B\u0438 \u0432\u0438\u0434\u043D\u044B \u0441\u0447\u0430\u0441\u0442\u043B\u0438\u0432\u044B\u0435 \u043C\u044B\u0448\u0438. \u041A\u043E\u0448\u0435\u043A \u043D\u0435 \u0431\u044B\u043B\u043E \u0432\u043E\u0432\u0441\u0435. \u041A\u0443\u0434\u0430 \u043E\u043D\u0438 \u043F\u0440\u043E\u043F\u0430\u043B\u0438, \u0420\u043E\u043A\u043A\u0438. \u041D\u0435 \u0437\u043D\u0430\u044E, \u0427\u0438\u043F, \u043D\u043E \u044F \u0437\u043D\u0430\u044E \u043E\u0434\u043D\u043E, \u043B\u0438\u0431\u043E \u0438\u0445 \u0432\u0441\u0435\u0445 \u0437\u0430\u0431\u0440\u0430\u043B\u0438 \u043D\u0430 \u043E\u0434\u043D\u0443 \u0438\u0437 \u0441\u0430\u043C\u044B\u0445 \u044F\u0440\u043A\u0438\u0445 \u0437\u0432\u0451\u0437\u0434 \u0441\u043E\u0437\u0432\u0435\u0437\u0434\u0438\u044F \u0446\u0435\u043D\u0442\u0430\u0432\u0440\u0430, \u043B\u0438\u0431\u043E \u043D\u0430 \u043B\u0438\u0446\u043E \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043B\u0435\u043D\u0438\u0435. \u0414\u0430\u0432\u0430\u0439 \u043C\u044B\u0441\u043B\u0438\u0442\u044C \u043A\u0430\u043A \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043D\u0438\u043A.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0425\u0430\u0434\u0430\u0440\u0446\u0435\u0432\u0430, \u043D\u0435\u0434\u0430\u043B\u0435\u043A\u043E \u043E\u0442 \u0431\u0435\u0440\u043B\u043E\u0433\u0438. \u0418\u0449\u0438\u0442\u0435 \u0441\u0442\u0435\u043D\u0443 \u0437\u0430 \u043A\u0438\u043F\u0430\u0440\u0438\u0441\u0430\u043C\u0438!
TASK_CODE_3=F23L8N
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0422\u043E\u043B\u044C\u043A\u043E \u0441\u0434\u0435\u043B\u0430\u0432 \u043F\u0441\u0435\u0432\u0434\u043E\u043A\u043E\u0448\u043A\u0443, \u0441\u043F\u0430\u0441\u0430\u0442\u0435\u043B\u0438 \u043D\u0430\u0447\u0430\u043B\u0438 \u043F\u0430\u0442\u0440\u0443\u043B\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0443\u043B\u0438\u0446\u0443. \u0415\u0435, \u0442\u0435\u043C\u043D\u044B\u0435 \u0437\u0430\u043A\u0443\u0442\u043A\u0438, \u043D\u0430\u0432\u0435\u0438\u0432\u0430\u043B\u0438 \u0441\u0442\u0440\u0430\u0445. \u041B\u0438\u0448\u044C \u0438\u0437\u0440\u0435\u0434\u043A\u0430 \u0433\u043E\u0440\u0435\u043B\u0438 \u0444\u043E\u043D\u0430\u0440\u0438. \u041C\u044F\u0433\u043A\u0438\u0439 \u0432\u0435\u0442\u0435\u0440, \u043B\u0435\u043D\u0438\u0432\u043E \u0433\u043E\u043D\u044F\u043B  \u043C\u0443\u0441\u043E\u0440. \u041C\u044B\u0448\u0438 \u0443\u0436\u0435 \u043F\u043E\u043F\u0440\u044F\u0442\u0430\u043B\u0438\u0441\u044C. \u0410\u0442\u0430\u043A\u0430 \u0441\u043B\u0443\u0447\u0438\u043B\u0430\u0441\u044C, \u0442\u043E\u0433\u0434\u0430 \u043A\u043E\u0433\u0434\u0430 \u0435\u0435 \u043D\u0435 \u0436\u0434\u0430\u043B\u0438. \u041D\u0430\u0448\u0438 \u0434\u0440\u0443\u0437\u044C\u044F \u043E\u043A\u0430\u0437\u0430\u043B\u0438\u0441\u044C \u0441\u0445\u0432\u0430\u0447\u0435\u043D\u044B \u0440\u043E\u0431\u043E\u043F\u0441\u043E\u043C.  \u0414\u0432\u0430\u0434\u0446\u0430\u0442\u044C \u0432\u043E\u0441\u0435\u043C\u044C \u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0445 \u0437\u0443\u0431\u0430 \u043F\u0440\u0435\u0433\u0440\u0430\u0436\u0434\u0430\u043B\u0438 \u0438\u043C \u0432\u044B\u0445\u043E\u0434 \u0438 \u0432\u044B\u0440\u0443\u0447\u043A\u0443 \u043B\u0435\u0442\u0435\u043B\u0438 \u0434\u0440\u0443\u0433\u0438\u0435 \u0441\u043F\u0430\u0441\u0430\u0442\u0435\u043B\u0438.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+,2
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u201C\u0415\u0441\u043B\u0438 \u0441\u0443\u0434\u044C\u0431\u0430 \u043E\u0441\u043E\u0431\u0435\u043D\u043D\u043E \u0431\u043B\u0430\u0433\u043E\u0441\u043A\u043B\u043E\u043D\u043D\u0430 \u043A \u0442\u0435\u0431\u0435 \u0438 \u0445\u043E\u0447\u0435\u0442 \u043E\u0434\u0430\u0440\u0438\u0442\u044C \u0432\u0435\u043B\u0438\u0447\u0430\u0439\u0448\u0435\u043C \u0441\u0447\u0430\u0441\u0442\u044C\u0435\u043C \u043D\u0430 \u0441\u0432\u0435\u0442\u0435, \u043E\u043D\u0430 \u0434\u0430\u0441\u0442 \u0432\u0435\u0440\u043D\u044B\u0445 \u0434\u0440\u0443\u0437\u0435\u0439\u201D - \u0441\u043A\u0430\u0437\u0430\u043B \u0420\u043E\u043A\u043A\u0438. \u0413\u0430\u0439\u043A\u0430 \u0440\u0430\u0441\u0441\u043C\u0430\u0442\u0440\u0438\u0432\u0430\u043B\u0430 \u0436\u0435\u043B\u0435\u0437\u044F\u043A\u0443, \u043F\u044B\u0442\u0430\u044F\u0441\u044C \u043F\u043E\u043D\u044F\u0442\u044C \u0447\u0442\u043E \u044D\u0442\u043E \u0442\u0430\u043A\u043E\u0435. \u041F\u044F\u0442\u0435\u0440\u043A\u0443 \u0441 \u043F\u043B\u044E\u0441\u043E\u043C \u0441\u043E\u0437\u0434\u0430\u0442\u0435\u043B\u044E \u044D\u0442\u043E\u0433\u043E \u0447\u0443\u0434\u0430, \u043D\u043E \u044F \u043C\u043E\u0433\u0443 \u043F\u0435\u0440\u0435\u0434\u0435\u043B\u0430\u0442\u044C \u0435\u0433\u043E.
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0422\u0435\u043B\u044C\u043C\u0430\u043D\u0430 28.
TASK_CODE_4=F6L2N1
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u041F\u043E\u0431\u0435\u0434\u0438\u0432 \u0440\u043E\u0431\u043E\u043F\u0441\u0430, \u0441\u043F\u0430\u0441\u0430\u0442\u0435\u043B\u0438 \u043F\u0435\u0440\u0435\u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043B\u0438 \u0435\u0433\u043E. \u041C\u043E\u0436\u043D\u043E \u0441\u043A\u0430\u0437\u0430\u0442\u044C \u0432\u0437\u044F\u043B\u0438 \u0432 \u0430\u0440\u0435\u043D\u0434\u0443 \u0441\u0440\u0435\u0434\u0441\u0442\u0432\u043E \u043F\u0435\u0440\u0435\u0434\u0432\u0438\u0436\u0435\u043D\u0438\u044F. \u0420\u043E\u0431\u043E\u043F\u0435\u0441 \u0432\u0435\u043B \u0438\u0445 \u0432\u0434\u043E\u043B\u044C \u0433\u0443\u0441\u0442\u043E\u0433\u043E \u043B\u0435\u0441\u0430, \u043F\u0440\u044F\u043C\u043E \u043A \u0441\u0442\u0430\u0440\u043E\u0439 \u043E\u0431\u0441\u0435\u0440\u0432\u0430\u0442\u043E\u0440\u0438\u0438. \u0412 \u043D\u043E\u0447\u0438 \u0432\u0435\u0442\u043A\u0438 \u0434\u0435\u0440\u0435\u0432\u044C\u0435\u0432, \u0442\u043E \u0438 \u0434\u0435\u043B\u043E \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u043B\u0438 \u0438\u043B\u043B\u044E\u0437\u0438\u044E \u0447\u044C\u0435\u0433\u043E \u0442\u043E \u043F\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0438\u044F, \u0442\u043E \u0438 \u0434\u0435\u043B\u043E \u043C\u0435\u043B\u044C\u043A\u0430\u043B\u0438 \u043B\u0438\u0446\u0430 \u0438 \u0441\u0438\u043B\u0443\u044D\u0442\u044B.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0410\u0440\u0435\u043D\u0434\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0440\u043E\u0431\u043E\u043F\u0435\u0441 \u043A\u0430\u0442\u0438\u043B \u0438\u0445 \u0432\u0434\u043E\u043B\u044C \u0437\u0430\u0431\u043E\u0440\u0430, \u0437\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u0440\u0430\u0441\u043F\u043E\u043B\u0430\u0433\u0430\u043B\u0441\u044F \u0441\u0430\u043C\u044B\u0439 \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u0439 \u043F\u0430\u0440\u043A \u0434\u043B\u044F \u043F\u0440\u043E\u0433\u0443\u043B\u043E\u043A \u0437\u0430 \u0447\u0435\u0440\u0442\u043E\u0439 \u0433\u043E\u0440\u043E\u0434\u0430. \u041F\u0440\u0430\u0432\u0434\u0430, \u0442\u043E \u0438 \u0434\u0435\u043B\u043E \u043F\u043E\u043F\u0430\u0434\u0430\u043B\u0438\u0441\u044C \u043E\u0442\u043A\u0440\u044B\u0442\u044B\u0435 \u043A\u043E\u043B\u043E\u0434\u0446\u044B, \u0432 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043C\u0435\u0434\u043B\u0435\u043D\u043D\u043E \u0440\u0430\u0437\u043B\u0430\u0433\u0430\u043B\u0438\u0441\u044C \u043F\u043E\u043F\u0430\u0432\u0448\u0438\u0435 \u0432 \u043D\u0438\u0445 \u0436\u0438\u0432\u043E\u0442\u043D\u044B\u0435. \u041D\u0443 \u0430 \u0447\u0435 \u0432\u044B \u0445\u043E\u0442\u0435\u043B\u0438? \u0414\u0435\u0442\u0441\u043A\u0438\u0439 \u043C\u0443\u043B\u044C\u0442\u0438\u043A?
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0414\u043E\u0440\u043E\u0436\u043A\u0430 \u0432\u043B\u0435\u0432\u043E, \u043E\u0442 \u0430\u0440\u0435\u043D\u0434\u044B \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434\u043E\u0432 \u043D\u0430 \u041D\u0430\u0440\u0442\u043E\u043D\u0435.
TASK_CODE_5=F15LN5
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u041E\u043A\u0430\u0437\u0430\u0432\u0448\u0438\u0441\u044C \u0432 \u0437\u0434\u0430\u043D\u0438\u0438, \u0441\u043F\u0430\u0441\u0430\u0442\u0435\u043B\u0438 \u0443\u0432\u0438\u0434\u0435\u043B\u0438 \u043C\u043D\u043E\u0436\u0435\u0441\u0442\u0432\u043E \u043A\u043B\u0435\u0442\u043E\u043A, \u0432 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0431\u044B\u043B\u0438 \u0437\u0430\u043A\u043B\u044E\u0447\u0435\u043D\u044B \u043A\u043E\u0448\u043A\u0438. \u0418 \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0439 \u043C\u0435\u0445\u0430\u043D\u0438\u0437\u043C, \u0441 \u0432\u0440\u0430\u0449\u0430\u044E\u0449\u0438\u043C\u0438\u0441\u044F \u043F\u043B\u0430\u0442\u0444\u043E\u0440\u043C\u0430\u043C\u0438 \u0438 \u043E\u0433\u0440\u043E\u043C\u043D\u044B\u043C\u0438 \u0440\u0443\u043A\u0430\u043C\u0438. \u041C\u0435\u0445\u0430\u043D\u0438\u0437\u043C \u0445\u0432\u0430\u0442\u0430\u043B \u043A\u043E\u0448\u0435\u043A \u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u043B \u0438\u0445 \u0432 \u043A\u0440\u0443\u0433\u043E\u0432\u0435\u0440\u0442\u044C, \u043F\u043E\u043A\u0430 \u043D\u0435 \u0434\u043E\u0431\u0438\u0432\u0430\u043B\u0441\u044F \u043E\u0442 \u043D\u0438\u0445 \u0437\u0430\u0440\u044F\u0434\u0430 \u0441\u0442\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u044D\u043B\u0435\u043A\u0442\u0440\u0438\u0447\u0435\u0441\u0442\u0432\u0430. \u041E\u0441\u043D\u043E\u0432\u0430\u043D\u0438\u0435 \u044D\u0442\u043E\u0433\u043E \u043C\u043E\u043D\u0441\u0442\u0440\u0430 \u0443\u0445\u043E\u0434\u0438\u043B\u043E \u0434\u0430\u043B\u0435\u043A\u043E \u043F\u043E\u0434 \u0437\u0435\u043C\u043B\u044E.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+,1+,1+
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E \u0438\u0437 \u043F\u043E\u0434 \u043F\u043E\u043B\u044B, \u043F\u043E\u0441\u043B\u044B\u0448\u0430\u043B\u0430\u0441\u044C \u0441\u0442\u0440\u0430\u043D\u043D\u0430\u044F \u0441\u043B\u043E\u0432\u0430 -  \u0413\u043E\u043B\u0443\u0431\u044B\u0435, \u043A\u0430\u043A \u044F\u0439\u0446\u0430 \u0434\u0440\u043E\u0437\u0434\u0430. \u041D\u0438\u043A\u043E\u0433\u0434\u0430! \u041F\u0430\u0440\u0430-\u0440\u0430\u0440\u0430-\u0440\u0430\u043C \u043F\u0430\u0440\u0430\u0440\u0430-\u0440\u0430\u0440\u0430\u043C. \u041D\u0438\u043A\u043E\u0433\u0434\u0430! \u041F\u0430\u0440\u0430-\u0440\u0430\u0440\u0430-\u0440\u0430\u043C \u043F\u0430\u0440\u0430\u0440\u0430-\u0440\u0430\u0440\u0430\u043C. \u041D\u0430\u043A\u043E\u043D\u0435\u0446 \u043F\u043E\u044F\u0432\u0438\u043B\u0441\u044F \u0438 \u0430\u0432\u0442\u043E\u0440 \u044D\u0442\u043E\u0433\u043E \u0441\u0443\u043C\u0430\u0441\u0431\u0440\u043E\u0434\u0441\u0442\u0432\u0430, \u043F\u0440\u043E\u0444\u0435\u0441\u0441\u043E\u0440 \u041D\u0438\u043C\u0434\u0443\u043B. \u0417\u043B\u043E\u0432\u0435\u0449\u0438\u0439 \u0441\u043C\u0435\u0445 \u044D\u0445\u043E\u043C \u0440\u0430\u0437\u0434\u0430\u0432\u0430\u043B\u0441\u044F \u043F\u043E \u043A\u043E\u0440\u0438\u0434\u043E\u0440\u0430\u043C, \u0432\u0442\u043E\u0440\u044F \u0441\u043A\u0440\u0435\u0436\u0435\u0442\u0443 \u0432\u0440\u0430\u0449\u0430\u044E\u0449\u0438\u0445\u0441\u044F \u043F\u043B\u0430\u0442\u0444\u043E\u0440\u043C.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0442\u0440\u043E\u0439\u043A\u0430 \u043C\u0435\u0436\u0434\u0443 \u0422\u0426 \u041A\u0430\u0440\u0443\u0441\u0435\u043B\u044C \u0438 \u043F\u043E\u0434\u0437\u0435\u043C\u043A\u0430\u043C\u0438.
TASK_CODE_6=F7L7N3
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0421\u0435\u0437\u0430\u043C \u043E\u0442\u043A\u0440\u043E\u0439\u0441\u044F \u2013 \u0427\u0438\u043F \u0441\u043F\u0435\u0440 \u043F\u0443\u043B\u044C\u0442 \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F \u043E\u0442 \u043A\u043B\u0435\u0442\u043E\u043A, \u0442\u0435\u043F\u0435\u0440\u044C \u0432\u0441\u0435 \u043A\u043E\u0448\u043A\u0438 \u043D\u0430 \u0441\u0432\u043E\u0431\u043E\u0434\u0435 \u0438 \u043D\u0430\u0447\u0430\u043B\u0441\u044F \u043F\u0435\u0440\u0435\u043F\u043E\u043B\u043E\u0445. \u0420\u043E\u0431\u043E\u043F\u0441\u044B \u043F\u044B\u0442\u0430\u043B\u0438\u0441\u044C \u043F\u043E\u0439\u043C\u0430\u0442\u044C \u043A\u043E\u0448\u0435\u043A, \u041D\u0438\u043C\u0434\u0443\u043B \u043F\u044B\u0442\u0430\u043B\u0441\u044F \u043F\u043E\u0439\u043C\u0430\u0442\u044C \u0427\u0438\u043F\u0430, \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0435 \u0441\u043F\u0430\u0441\u0430\u0442\u0435\u043B\u0438 \u043D\u0430\u0439\u0442\u0438 \u0425\u0440\u0430\u0431\u0440\u0435\u0446\u0430! \u0421\u0438\u0442\u0443\u0430\u0446\u0438\u044F \u043F\u043E\u0441\u0442\u043E\u044F\u043D\u043D\u043E \u043C\u0435\u043D\u044F\u043B\u0430\u0441\u044C \u0438 \u043F\u043E\u0431\u0435\u0434\u0430, \u0432\u0440\u043E\u0434\u0435 \u0431\u044B \u043F\u0435\u0440\u0435\u0445\u043E\u0434\u0438\u043B\u0430 \u0442\u043E \u043A \u043E\u0434\u043D\u0438\u043C, \u0442\u043E \u043A \u0434\u0440\u0443\u0433\u0438\u043C.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1,1+
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0411\u0443\u0434\u0442\u043E \u0432\u043E\u043B\u043D\u0430\u043C\u0438, \u0432\u0441\u0435 \u0441\u043F\u043B\u0435\u043B\u043E\u0441\u044C \u0432 \u043E\u0434\u0438\u043D \u043A\u043B\u0443\u0431\u043E\u043A, \u0447\u0435\u0440\u043D\u043E\u0433\u043E \u0446\u0432\u0435\u0442\u0430. \u042D\u0442\u043E \u043A\u043E\u043B\u044B\u0445\u0430\u044E\u0449\u0435\u0435\u0441\u044F \u043C\u043E\u0440\u0435, \u0448\u0430\u0440\u0430\u0445\u0430\u043B\u043E\u0441\u044C \u0438\u0437 \u0441\u0442\u043E\u0440\u043E\u043D\u044B \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443. \u041F\u043E\u043A\u0430 \u0432 \u0434\u0435\u043B\u043E \u043D\u0435 \u0432\u043C\u0435\u0448\u0430\u043B\u0441\u044F \u0425\u0440\u0430\u0431\u0440\u0435\u0446, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043D\u0430\u0431\u0440\u043E\u0441\u0438\u043B\u0441\u044F \u043D\u0430 \u041D\u0438\u043C\u0434\u0443\u043B\u0430, \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0432 \u0438\u0442\u043E\u0433\u0435 \u0441\u043E\u0436\u0440\u0430\u043B \u0420\u043E\u0431\u043E\u043F\u0435\u0441.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0427\u0435\u0440\u043D\u043E\u043C\u043E\u0440\u0441\u043A\u0430\u044F 2, \u043D\u043E \u043D\u0435 2. \u0410 \u043E\u043A\u043E\u043B\u043E))) \u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0432\u0430\u043C \u0432 \u043F\u043E\u043C\u043E\u0449\u044C)))
TASK_CODE_7=F5L3N8
BONUS_FIVE_MINUTES=gun
BONUS_TEN_MINUTES=land
BONUS_FIFTEEN_MINUTES=peace