#Sun Sep 17 21:30:01 MSK 2017
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(c \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0410\u043B\u043C\u0430\u0437\u044B \u0438 \u0431\u0440\u0438\u043B\u043B\u0438\u0430\u043D\u0442\u044B\u2026 \u0421\u043A\u043E\u043B\u044C\u043A\u043E \u0438\u0445 \u0442\u0430\u043C\u2026\u0422\u043E\u043B\u044C\u043A\u043E \u043F\u043E\u0434\u0443\u043C\u0430\u0442\u044C\u2026\u0410\u043B\u043C\u0430\u0437\u044B \u0441\u043F\u0440\u044F\u0442\u0430\u0442\u044C \u0432 \u043E\u0431\u0438\u0432\u043A\u0443 \u0441\u0442\u0443\u043B\u044C\u0435\u0432\u2026\u041D\u0430\u0434\u043E \u0441\u0440\u043E\u0447\u043D\u043E \u0435\u0445\u0430\u0442\u044C\u2026\u0410\u043B\u043C\u0430\u0437\u044B \u043C\u043E\u0433\u0443\u0442 \u0431\u044B\u0442\u044C \u0435\u0449\u0435 \u0442\u0430\u043C\u2026\u041A\u0438\u0441\u0430 \u0431\u044B\u0441\u0442\u0440\u043E \u043F\u0440\u043E\u043A\u0440\u0443\u0442\u0438\u043B \u044D\u0442\u043E \u0432\u0441\u0435 \u0432 \u0433\u043E\u043B\u043E\u0432\u0435\u2026\u0415\u0436\u0435\u043B\u0438 \u043F\u043E\u0441\u043F\u0435\u0448\u0438\u0442\u044C\u2026\u0421\u043A\u0430\u0436\u0435\u043C \u0437\u0430\u0432\u0442\u0440\u0430 \u0432\u044B\u0435\u0445\u0430\u0442\u044C \u0438\u0437 \u0441\u0442\u043E\u043B\u0438\u0446\u044B\u2026\u0410\u043B\u043C\u0430\u0437\u044B \u043C\u043E\u0436\u043D\u043E \u0431\u0443\u0434\u0435\u0442 \u0437\u0430\u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0432 \u0431\u043B\u0438\u0436\u0430\u0439\u0448\u0435\u0435 \u0432\u0440\u0435\u043C\u044F\u2026\u0415\u0436\u0435\u043B\u0438 \u043F\u043E\u0441\u043F\u0435\u0448\u0438\u0442\u044C\u2026\u0412\u0435\u0449\u0438 \u0431\u044B\u043B\u0438 \u0441\u043E\u0431\u0440\u0430\u043D\u044B \u043A\u0430\u043A \u043F\u043E \u0432\u0437\u043C\u0430\u0445\u0443 \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u043E\u0439 \u043F\u0430\u043B\u043E\u0447\u043A\u0438\u2026\u0410\u043B\u043C\u0430\u0437\u044B \u0438 \u0431\u0440\u0438\u043B\u043B\u0438\u0430\u043D\u0442\u044B \u0436\u0434\u0443\u0442\u20262 \u0434\u043D\u044F \u043F\u0443\u0442\u0438 \u0441\u043A\u0432\u043E\u0437\u044C \u0441\u043A\u0432\u0435\u0440\u0438\u043A\u0438 \u0438 \u041A\u0438\u0441\u0430 \u0443\u0436\u0435 \u0432 \u0421\u0442\u0430\u0440\u0433\u043E\u0440\u043E\u0434\u0435. \u041D\u043E \u043F\u043E\u043A\u0430 \u043E\u0441\u0442\u0430\u0432\u0438\u043C \u0435\u0433\u043E \u0438 \u043F\u043E\u0437\u043D\u0430\u043A\u043E\u043C\u0438\u043C\u0441\u044F \u0441 \u041E\u0441\u0442\u0430\u043F\u043E\u043C \u0411\u0435\u043D\u0434\u0435\u0440\u043E\u043C, \u00AB\u0432\u0435\u043B\u0438\u043A\u0438\u043C \u043C\u0430\u0445\u0438\u043D\u0430\u0442\u043E\u0440\u043E\u043C\u00BB. \u041B\u0435\u0442\u043E\u043C 1927 \u0433\u043E\u0434\u0430 \u0441 \u0441\u0435\u0432\u0435\u0440\u043E-\u0437\u0430\u043F\u0430\u0434\u0430 \u0441\u043E \u0441\u0442\u043E\u0440\u043E\u043D\u044B \u0434\u0435\u0440\u0435\u0432\u043D\u0438 \u0428\u043C\u0430\u0440\u043E\u0432\u043A\u0438 \u0432 \u0421\u0442\u0430\u0440\u0433\u043E\u0440\u043E\u0434 \u0432\u043E\u0448\u0435\u043B \u043C\u043E\u043B\u043E\u0434\u043E\u0439 \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u2026 \u0434\u044F\u0434\u0435\u043D\u044C\u043A\u0430, \u0434\u0430\u0439 10 \u043A\u043E\u043F\u0435\u0435\u043A, \u0434\u0430\u0439 10 \u043A\u043E\u043F\u0435\u0435\u043A,\u0430? \u0414\u0430\u0439 10 \u043A\u043E\u043F\u0435\u0435\u043A \u044F \u0442\u0435 \u0433\u043E\u0432\u043E\u0440\u044E!? \u2013 \u041C\u043E\u0436\u0435\u0442 \u0442\u0435\u0431\u0435 \u0434\u0430\u0442\u044C \u043A\u043B\u044E\u0447\u2026 \u043E\u0442 \u043A\u0432\u0430\u0440\u0442\u0438\u0440\u044B, \u0433\u0434\u0435 \u0434\u0435\u043D\u044C\u0433\u0438 \u043B\u0435\u0436\u0430\u0442.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
GAME_LEGEND="\u0414\u0432\u0435\u043D\u0430\u0434\u0446\u0430\u0442\u044C \u0441\u0442\u0443\u043B\u044C\u0435\u0432"\n\n\u0412\u043E \u0432\u0440\u0435\u043C\u044F \u0440\u0435\u0432\u043E\u043B\u044E\u0446\u0438\u0438 \u0438 \u043F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0432\u0448\u0435\u0433\u043E \u0437\u0430 \u043D\u0435\u0439 \u043A\u0440\u0430\u0442\u043A\u043E\u0433\u043E \u043F\u0435\u0440\u0438\u043E\u0434\u0430 \u0432\u043E\u0435\u043D\u043D\u043E\u0433\u043E \u043A\u043E\u043C\u043C\u0443\u043D\u0438\u0437\u043C\u0430 \u043C\u043D\u043E\u0433\u0438\u0435 \u043F\u0440\u044F\u0442\u0430\u043B\u0438 \u0441\u0432\u043E\u0438 \u0446\u0435\u043D\u043D\u043E\u0441\u0442\u0438 \u043A\u0430\u043A \u043C\u043E\u0436\u043D\u043E \u043D\u0430\u0434\u0451\u0436\u043D\u0435\u0435. \u0418 \u0432\u043E\u0442 \u0418\u043F\u043F\u043E\u043B\u0438\u0442 \u041C\u0430\u0442\u0432\u0435\u0435\u0432\u0438\u0447 (\u041A\u0438\u0441\u0430) \u0412\u043E\u0440\u043E\u0431\u044C\u044F\u043D\u0438\u043D\u043E\u0432, \u0431\u044B\u0432\u0448\u0438\u0439 \u0421\u0442\u0430\u0440\u0433\u043E\u0440\u043E\u0434\u0441\u043A\u0438\u0439 \u043F\u0440\u0435\u0434\u0432\u043E\u0434\u0438\u0442\u0435\u043B\u044C \u0434\u0432\u043E\u0440\u044F\u043D\u0441\u0442\u0432\u0430 \u0438 \u0441\u0432\u0435\u0442\u0441\u043A\u0438\u0439 \u043B\u0435\u0432, \u0430 \u043D\u044B\u043D\u0435\u2014 \u0441\u043A\u0440\u043E\u043C\u043D\u044B\u0439 \u0434\u0435\u043B\u043E\u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u0438\u0442\u0435\u043B\u044C \u0417\u0410\u0413\u0421\u0430, \u0443\u0437\u043D\u0430\u0451\u0442 \u043E\u0442 \u0443\u043C\u0438\u0440\u0430\u044E\u0449\u0435\u0439 \u0442\u0451\u0449\u0438, \u0447\u0442\u043E \u043D\u0435\u043A\u043E\u0433\u0434\u0430 \u043E\u043D\u0430 \u0441\u043F\u0440\u044F\u0442\u0430\u043B\u0430 \u0441\u0432\u043E\u0438 \u0431\u0440\u0438\u043B\u043B\u0438\u0430\u043D\u0442\u044B \u0438 \u0436\u0435\u043C\u0447\u0443\u0433\u0430 \u0441\u0442\u043E\u0438\u043C\u043E\u0441\u0442\u044C\u044E 150 \u0442\u044B\u0441\u044F\u0447 \u0437\u043E\u043B\u043E\u0442\u044B\u0445 \u0440\u0443\u0431\u043B\u0435\u0439 \u043F\u043E\u0434 \u043E\u0431\u0438\u0432\u043A\u0443 \u043E\u0434\u043D\u043E\u0433\u043E \u0438\u0437 \u0434\u0432\u0435\u043D\u0430\u0434\u0446\u0430\u0442\u0438 \u0441\u0442\u0443\u043B\u044C\u0435\u0432 \u0433\u043E\u0441\u0442\u0438\u043D\u043E\u0433\u043E \u0433\u0430\u0440\u043D\u0438\u0442\u0443\u0440\u0430 \u0440\u0430\u0431\u043E\u0442\u044B \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E\u0433\u043E \u043C\u0430\u0441\u0442\u0435\u0440\u0430 \u0413\u0430\u043C\u0431\u0441\u0430. \u041E\u0441\u0442\u0430\u0432\u0438\u0432 \u0432\u0441\u0451, \u0412\u043E\u0440\u043E\u0431\u044C\u044F\u043D\u0438\u043D\u043E\u0432 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0430 \u043F\u043E\u0438\u0441\u043A\u0438 \u0441\u0442\u0443\u043B\u044C\u0435\u0432 \u0432 \u0421\u0442\u0430\u0440\u0433\u043E\u0440\u043E\u0434.\n\n\u0414\u043E\u043F\u044B:\n10 \u043A\u043E\u043F\u0435\u0435\u043A \u0438\u043B\u0438 \u043A\u043B\u044E\u0447 \u043E\u0442 \u043A\u0432\u0430\u0440\u0442\u0438\u0440\u044B, \u0433\u0434\u0435 \u0434\u0435\u043D\u044C\u0433\u0438 \u043B\u0435\u0436\u0430\u0442\n4 \u043A\u043E\u043D\u044F \u0434\u043B\u044F \u043A\u043B\u0443\u0431\u0430 \u043B\u044E\u0431\u0438\u0442\u0435\u043B\u0435\u0439 \u0448\u0430\u0445\u043C\u0430\u0442 \u0438\u0437 \u0412\u0430\u0441\u044E\u043A\u043E\u0432\n\u0423\u043B\u044C\u0442\u0440\u0430\u0444\u0438\u043E\u043B\u0435\u0442\u043E\u0432\u044B\u0439 \u0444\u043E\u043D\u0430\u0440\u0438\u043A
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0440\u0438\u0431\u043B\u0438\u0437\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u041A\u043E\u0441\u0442\u0430 10. \u041D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u0420\u0430\u0441\u0442\u0430\u0431\u0430\u043D\u0430.
TASK_CODE_6=F9L1N7
START_CODE=tc
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041A\u0441\u0442\u0430\u0442\u0438 \u0433\u043E\u0432\u043E\u0440\u044F, \u041E\u0441\u0442\u0430\u043F \u043D\u0435 \u043A\u0443\u043F\u0438\u043B \u043E\u0440\u0434\u0435\u0440\u0430. \u0421\u043E\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E \u043F\u043E \u0434\u0440\u0443\u0433\u043E\u043C\u0443 \u0441\u043B\u043E\u0436\u0438\u043B\u0438\u0441\u044C \u0434\u0435\u043B\u0430 \u0443 \u043E\u0422\u0446\u0410 \u0424\u0435\u0434\u043E\u0440\u0430. \u0415\u043C\u0443 \u043F\u0440\u0438\u0448\u043B\u043E\u0441\u044C \u0432\u044B\u043B\u043E\u0436\u0438\u0442\u044C \u0441\u0443\u043C\u043C\u0443 \u043E\u043A\u043E\u043B\u043E 10\u043E \u0440\u0443\u0431\u043B\u0435\u0439.
TASK_CODE_4=F5L1N2
TASK_CODE_3=F4L3N7
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u041C\u0435\u0442\u0430\u043B\u043B\u0443\u0440\u0433\u0430 \u043D\u0430 \u0418\u0440\u0438\u0441\u0442\u043E\u043D\u0441\u043A\u043E\u0439,  \u043A\u0430\u0444\u0435 \u0440\u0430\u0434\u0443\u0433\u0430! \u041D\u0418\u042D\u041C(\u043C\u0430\u0442\u0435\u0440\u0438\u0438 \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u044B\u0445 \u043C\u0430\u0442\u0435\u0440\u0438\u0430\u043B\u043E\u0432) \u043D\u0430\u0434 \u043F\u0435\u0440\u0435\u0443\u043B\u043A\u0430\u043C\u0438 \u0438 \u0442\u0440\u0430\u043D\u0441\u043F\u043E\u0440\u0442\u043E\u043C (\u0438\u043C\u0435\u0435\u0442\u0441\u044F \u0432\u0432\u0438\u0434\u0443 \u0442\u0440\u0430\u043D\u0441\u043F\u043E\u0440\u0442\u043D\u044B\u0439 \u043F\u0435\u0440\u0435\u0443\u043B\u043E\u043A)
TASK_CODE_2=F6L2N4
TASK_CODE_1=FLN111
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0421\u0442\u0443\u043B\u044C\u044F, \u043F\u0440\u043E\u0434\u0430\u0432\u0430\u0432\u0448\u0438\u0435\u0441\u044F \u043D\u0430 \u0430\u0443\u043A\u0446\u0438\u043E\u043D\u0435 \u043E\u043F\u0442\u043E\u043C, \u043F\u0440\u043E\u0434\u0430\u044E\u0442\u0441\u044F \u0432 \u0440\u043E\u0437\u043D\u0438\u0446\u0443 \u0438 \u00AB\u0443\u043F\u043B\u044B\u0432\u0430\u044E\u0442\u00BB \u0438\u0437 \u0440\u0443\u043A. \u041A\u043E\u043D\u0446\u0435\u0441\u0441\u0438\u043E\u043D\u0435\u0440\u044B \u043D\u0430\u0445\u043E\u0434\u044F\u0442 \u0430\u0434\u0440\u0435\u0441\u0430 \u0445\u043E\u0437\u044F\u0435\u0432 \u0441\u0442\u0443\u043B\u044C\u0435\u0432: \u042D\u043B\u043B\u043E\u0447\u043A\u0438, \u0440\u0430\u0431\u043E\u0442\u043D\u0438\u0446\u044B \u043A\u0430\u0444\u0435 \u0438 \u042D\u0440\u043D\u0435\u0441\u0442\u0430 \u0429\u0443\u043A\u0438\u043D\u044B\u0445, \u043C\u043E\u043B\u043E\u0434\u043E\u0433\u043E \u043C\u0435\u0442\u0430\u043B\u043B\u0443\u0440\u0433\u0430 \u0441 \u0437\u0430\u0432\u043E\u0434\u0430. \u0410 \u0442\u0430\u043A\u0436\u0435 \u043F\u043E\u044D\u0442\u0430 \u041D\u0438\u043A\u0438\u0444\u043E\u0440\u0430 \u041B\u044F\u043F\u0438\u0441\u0430-\u0422\u0440\u0443\u0431\u0435\u0446\u043A\u043E\u0433\u043E. \u041D\u0430\u0434 \u043F\u0435\u0440\u0435\u0443\u043B\u043A\u0430\u043C\u0438 \u0438 \u0442\u0440\u0430\u043D\u0441\u043F\u043E\u0440\u0442\u043E\u043C, \u043D\u0430 \u0434\u043E\u0436\u0434\u043B\u0438\u0432\u043E\u043C \u043D\u0435\u0431\u0435 \u0432\u043D\u043E\u0432\u044C \u043C\u043E\u0436\u0435\u0442 \u0437\u0430\u0441\u0438\u044F\u0442\u044C \u0440\u0430\u0434\u0443\u0433\u0430.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u0433\u043E\u043B \u0410\u0441\u0442\u0430\u043D\u0430 \u041A\u0435\u0441\u0430\u0435\u0432\u0430 \u0438 \u0425\u0430\u0434\u0430\u0440\u0446\u0435\u0432\u0430
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u0443\u0442\u0435\u043C \u043F\u0440\u043E\u0441\u0442\u043E\u0439 \u043F\u0435\u0440\u0435\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u0438 \u0432 \u0447\u0438\u0441\u0442\u043E\u043C \u0432\u0438\u0434\u0435 \u0434\u0432\u0443\u0445 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0445, \u041E\u0441\u0442\u0430\u043F \u0440\u0435\u0448\u0430\u0435\u0442 \u0436\u0435\u043D\u0438\u0442\u044C\u0441\u044F \u043D\u0430 \u0445\u043E\u0437\u044F\u0439\u043A\u0435 \u0432\u0442\u043E\u0440\u043E\u0433\u043E \u0441\u0442\u0443\u043B\u0430, \u043C\u0430\u0434\u0430\u043C \u0413\u0440\u0438\u0446\u0430\u0446\u0443\u0435\u0432\u043E\u0439, \u0438 \u043D\u0430 \u0441\u0432\u0430\u0434\u044C\u0431\u0435 \u0443\u043D\u043E\u0441\u0438\u0442 \u044D\u0442\u043E\u0442 \u0441\u0442\u0443\u043B, \u043D\u043E \u0432 \u043D\u0451\u043C \u043D\u0438\u0447\u0435\u0433\u043E \u043D\u0435 \u043E\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F. \u041E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0435 \u0441\u0442\u0443\u043B\u044C\u044F \u043E\u043A\u0430\u0437\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u0432 \u041C\u043E\u0441\u043A\u0432\u0435, \u043A\u0443\u0434\u0430 \u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u0433\u0435\u0440\u043E\u0438. \u0412 \u0441\u0442\u043E\u043B\u0438\u0446\u0435 \u043E\u043D\u0438 \u0443\u0437\u043D\u0430\u044E\u0442, \u0447\u0442\u043E \u0441\u0442\u0443\u043B\u044C\u044F \u0431\u0443\u0434\u0443\u0442 \u043F\u0440\u043E\u0434\u0430\u0432\u0430\u0442\u044C \u043D\u0430 \u0430\u0443\u043A\u0446\u0438\u043E\u043D\u0435, \u0438 \u0440\u0435\u0448\u0430\u044E\u0442 \u043F\u043E\u0434\u0435\u043B\u0438\u0442\u044C \u043C\u0435\u0436\u0434\u0443 \u0441\u043E\u0431\u043E\u0439 400 \u0440\u0443\u0431\u043B\u0435\u0439 \u043F\u043E\u043F\u043E\u043B\u0430\u043C.
START_TIME=01-05
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0442\u043E\u043B\u0438\u0446\u0430, \u0441\u043A\u0432\u0435\u0440 \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432, \u0410\u0433\u0435\u043D\u0442 \u0436\u0434\u0435\u0442 \u0432\u043E\u043F\u0440\u043E\u0441\u0430 \u0438 10 \u043A\u043E\u043F\u0435\u0435\u043A.
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0421\u0442\u043E\u043B\u0438\u0446\u0430 \u043E\u0441\u0442\u0430\u043B\u0430\u0441\u044C \u0437\u0430 \u0441\u043F\u0438\u043D\u043E\u0439 \u0418\u043F\u043F\u043E\u043B\u0438\u0442\u0430 \u041C\u0430\u0442\u0432\u0435\u0435\u0432\u0438\u0447\u0430. 35 \u043C\u0438\u043D\u0443\u0442 \u043F\u043E \u0434\u043E\u0440\u043E\u0433\u0435 \u043C\u043E\u0441\u043A\u043E\u0432\u0441\u043A\u043E\u0439 \u0438 \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432, \u041A\u0438\u0441\u0430 \u043C\u043E\u0433 \u0443\u0436\u0435 \u043D\u0430\u0431\u043B\u044E\u0434\u0430\u0442\u044C \u0443\u0445\u043E\u0436\u0435\u043D\u043D\u044B\u0435 \u0441\u043A\u0432\u0435\u0440\u0438\u043A\u0438 \u0438 \u0434\u0430\u0447\u0438 \u0441\u0442\u043E\u043B\u0438\u0447\u043D\u044B\u0445 \u0436\u0438\u0442\u0435\u043B\u0435\u0439. \u0422\u0435\u043C \u0432\u0440\u0435\u043C\u0435\u043D\u0435\u043C \u041E\u0441\u0442\u0430\u043F \u0437\u043D\u0430\u043A\u043E\u043C\u0438\u0442\u044C\u0441\u044F \u0441 \u0422\u0438\u0445\u043E\u043D\u043E\u043C, \u0431\u044B\u0432\u0448\u0438\u043C \u0434\u0432\u043E\u0440\u043D\u0438\u043A\u043E\u043C. \u0412 \u0434\u043E\u043C\u0435, \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u041E\u0441\u0442\u0430\u043F \u0438 \u041A\u0438\u0441\u0430 \u043F\u0440\u0438\u0445\u043E\u0434\u044F\u0442 \u043A \u043A\u043E\u043D\u0446\u0435\u0441\u0441\u0438\u0438. \u0418 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u0438\u0441\u043A\u0430\u0442\u044C \u0441\u0442\u0443\u043B\u044C\u044F.
TASK_CODE_5=FLN555
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B. \u041D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E\u0433\u043E \u0421\u043E\u043B\u0434\u0430\u0442\u0430, \u0433\u0434\u0435 \u0442\u043E \u043F\u043E\u0441\u0435\u0440\u0435\u0434\u0438\u043D\u0435)
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041E\u0441\u0442\u0430\u043F \u0441\u043A\u043E\u043B\u044C\u0437\u043D\u0443\u043B \u0432\u0437\u0433\u043B\u044F\u0434\u043E\u043C \u043F\u043E \u0448\u0435\u0440\u0435\u043D\u0433\u0430\u043C \u00AB\u0447\u0435\u0440\u043D\u044B\u0445\u00BB, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043E\u043A\u0440\u0443\u0436\u0430\u043B\u0438 \u0435\u0433\u043E \u0441\u043E \u0432\u0441\u0435\u0445 \u0441\u0442\u043E\u0440\u043E\u043D, \u043F\u043E \u0437\u0430\u043A\u0440\u044B\u0442\u043E\u0439 \u0434\u0432\u0435\u0440\u0438 \u0438 \u043D\u0435\u0443\u0441\u0442\u0440\u0430\u0448\u0438\u043C\u043E \u043F\u0440\u0438\u043D\u044F\u043B\u0441\u044F \u0437\u0430 \u0440\u0430\u0431\u043E\u0442\u0443. \u041E\u043D \u043F\u043E\u0434\u043E\u0448\u0435\u043B \u043A \u043E\u0434\u043D\u043E\u0433\u043B\u0430\u0437\u043E\u043C\u0443, \u0441\u0438\u0434\u0435\u0432\u0448\u0435\u043C\u0443 \u0437\u0430 \u043F\u0435\u0440\u0432\u043E\u0439 \u0434\u043E\u0441\u043A\u043E\u0439, \u0438 \u043F\u0435\u0440\u0435\u0434\u0432\u0438\u043D\u0443\u043B \u043A\u043E\u0440\u043E\u043B\u0435\u0432\u0441\u043A\u0443\u044E \u043F\u0435\u0448\u043A\u0443 \u0441 \u043A\u043B\u0435\u0442\u043A\u0438 \u0435 43,047433 \u043D\u0430 \u043A\u043B\u0435\u0442\u043A\u0443 \u0435 44,700357.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0412\u043E\u0434\u043D\u0430\u044F. \u0417\u0430 \u0440\u0435\u0441\u0442\u043E\u0440\u0430\u043D\u043E\u043C \u0412\u043E\u043B\u043D\u0430, \u0434\u0430\u0439\u0442\u0435 \u0430\u0433\u0435\u043D\u0442\u0443 4 \u043A\u043E\u043D\u0435\u0439.
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u0440\u043E\u0433\u0443\u043B\u0438\u0432\u0430\u044F\u0441\u044C \u043F\u043E \u043F\u0440\u0438\u0441\u0442\u0430\u043D\u0438, \u0438 \u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043C\u0435\u0440\u043D\u043E \u043A\u043E\u043B\u044B\u0448\u0443\u0449\u0438\u0435\u0441\u044F \u0432\u043E\u0434\u044B. \u0412\u043E\u043B\u043D\u0430, \u043F\u043E\u0434\u0433\u043E\u043D\u044F\u0435\u043C\u0430\u044F \u0432\u0435\u0442\u0435\u0440\u043A\u043E\u043C, \u043D\u0430\u0431\u0435\u0433\u0430\u043B\u0430 \u043D\u0430 \u0431\u0435\u0440\u0435\u0433. \u0428\u0430\u0445\u043C\u0430\u0442\u044B! \u2013 \u0433\u043E\u0432\u043E\u0440\u0438\u043B \u041E\u0441\u0442\u0430\u043F. \u2013 \u0417\u043D\u0430\u0435\u0442\u0435 \u043B\u0438 \u0432\u044B, \u0447\u0442\u043E \u0442\u0430\u043A\u043E\u0435 \u0448\u0430\u0445\u043C\u0430\u0442\u044B? \u041E\u043D\u0438 \u0434\u0432\u0438\u0433\u0430\u044E\u0442 \u0432\u043F\u0435\u0440\u0435\u0434 \u043D\u0435 \u0442\u043E\u043B\u044C\u043A\u043E \u043A\u0443\u043B\u044C\u0442\u0443\u0440\u0443, \u043D\u043E \u0438 \u044D\u043A\u043E\u043D\u043E\u043C\u0438\u043A\u0443! \u0417\u043D\u0430\u0435\u0442\u0435 \u043B\u0438 \u0432\u044B, \u0447\u0442\u043E \u0448\u0430\u0445\u043C\u0430\u0442\u043D\u044B\u0439 \u043A\u043B\u0443\u0431 \u0447\u0435\u0442\u044B\u0440\u0435\u0445 \u043A\u043E\u043D\u0435\u0439 \u043F\u0440\u0438 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u043E\u0439 \u043F\u043E\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u0435 \u0434\u0435\u043B\u0430 \u0441\u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0438\u0442\u044C \u0433\u043E\u0440\u043E\u0434 \u0412\u0430\u0441\u044E\u043A\u0438?\u00BB
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n\u0421 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u0431\u044B\u0432\u0448\u0435\u0439 \u043B\u044E\u0431\u043E\u0432\u043D\u0438\u0446\u044B \u0412\u043E\u0440\u043E\u0431\u044C\u044F\u043D\u0438\u043D\u043E\u0432\u0430, \u0415\u043B\u0435\u043D\u044B \u0421\u0442\u0430\u043D\u0438\u0441\u043B\u0430\u0432\u043E\u0432\u043D\u044B \u0411\u043E\u0443\u0440, \u0436\u0435\u043D\u0449\u0438\u043D\u044B \u0441\u043E \u0441\u0434\u0432\u0438\u0433\u043E\u043C, \u043A\u043E\u043D\u0446\u0435\u0441\u0441\u0438\u043E\u043D\u0435\u0440\u044B \u043D\u0430\u0445\u043E\u0434\u044F\u0442 \u043F\u043E\u0434\u043F\u043E\u043B\u044C\u043D\u044B\u0445 \u0431\u043E\u0433\u0430\u0447\u0435\u0439 \u0421\u0442\u0430\u0440\u0433\u043E\u0440\u043E\u0434\u0430 \u0438 \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u0445\u0438\u0442\u0440\u043E\u0439 \u0442\u0440\u0430\u043D\u0441\u043F\u043E\u0437\u0438\u0446\u0438\u0438 \u0434\u043E\u0431\u0438\u0432\u0430\u044E\u0442\u0441\u044F \u0434\u0435\u043D\u0435\u0433 \u0438 \u0441\u043E\u0437\u0434\u0430\u044E\u0442 \u0442\u0430\u0439\u043D\u044B\u0439 \u0441\u043E\u044E\u0437 \u00AB\u0415\u041B\u0422\u0414\u041E\u0420\u0423\u041D\u0421\u041B\u0413\u042F\u0421\u041E\u041E\u041F\u0410\u0414\u0420\u041F\u0421\u0418\u0416\u042F\u041D\u0415\u042B\u041D\u0423\u0415\u041E\u0413\u0425\u041B\u0414\u0410\u0420\u0410\u0415\u0426\u0410\u0412\u0410\u0418\u0422\u0421\u041D\u0410\u041A\u0410\u0421\u0415\u0415\u0410\u0410\u0412\u00BB.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
START_DATE=13-04-2018
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165 (\u0441 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0412 \u0440\u0435\u0434\u0430\u043A\u0446\u0438\u0438 \u0433\u0430\u0437\u0435\u0442\u044B \u043E\u043D\u0438 \u0434\u043E\u0431\u044B\u0432\u0430\u044E\u0442 \u0441\u0442\u0443\u043B\u044C\u044F, \u043D\u043E \u0442\u0430\u043C \u043D\u0438\u0447\u0435\u0433\u043E \u043D\u0435\u0442. \u041E\u0441\u0442\u0430\u0432\u0438\u0432 \u043E\u0434\u0438\u043D \u0441\u0442\u0443\u043B, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0437\u0430\u0442\u0435\u0440\u044F\u043B\u0441\u044F \u043D\u0430 \u0432\u043E\u043A\u0437\u0430\u043B\u0435, \u0433\u0435\u0440\u043E\u0438 \u043D\u0430\u043D\u0438\u043C\u0430\u044E\u0442\u0441\u044F \u0445\u0443\u0434\u043E\u0436\u043D\u0438\u043A\u0430\u043C\u0438 \u043D\u0430 \u043F\u0430\u0440\u043E\u0445\u043E\u0434 \u00AB\u0421\u043A\u0440\u044F\u0431\u0438\u043D\u00BB. \u0412\u043E\u043B\u043D\u0430 \u043C\u0435\u0440\u043D\u043E \u043F\u043E\u043A\u0430\u0447\u0438\u0432\u0430\u0435\u0442 \u0441\u0443\u0434\u043D\u043E. \u041D\u0430 \u0432\u0435\u0442\u0435\u0440\u043A\u0435 \u043A\u043E\u043B\u044B\u0448\u0443\u0442\u0441\u044F \u0444\u043B\u0430\u0433\u0438. \u041D\u043E \u0438 \u0442\u0443\u0442 \u0411\u0435\u043D\u0434\u0435\u0440\u0430 \u0438 \u0412\u043E\u0440\u043E\u0431\u044C\u044F\u043D\u0438\u043D\u043E\u0432\u0430 \u043F\u043E\u0441\u0442\u0438\u0433\u0430\u0435\u0442 \u043D\u0435\u0443\u0434\u0430\u0447\u0430. \u0417\u0430 \u043F\u043B\u043E\u0445\u043E \u043D\u0430\u0440\u0438\u0441\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u043F\u043B\u0430\u043A\u0430\u0442, \u0438\u0445 \u0432\u044B\u0441\u0430\u0436\u0438\u0432\u0430\u044E\u0442 \u043D\u0430 \u043F\u0440\u0438\u0441\u0442\u0430\u043D\u0438 \u0432 \u0412\u0430\u0441\u044E\u043A\u0430\u0445. \u00AB\u041F\u043E\u0434\u0430\u0439\u0442\u0435 \u043C\u043D\u0435, \u043A\u043E\u043D\u0435\u0439 \u0438\u0437\u0432\u043E\u0437\u0447\u0438\u043A\u00BB - \u0433\u043B\u0430\u0448\u0430\u043B  \u041E\u0441\u0442\u0430\u043F. \u041D\u043E \u0438\u0437\u0432\u043E\u0437\u0447\u0438\u043A\u043E\u0432 \u0432 \u044D\u0442\u043E\u043C \u0433\u043E\u0440\u043E\u0434\u043A\u0435 \u043E\u0442\u0440\u043E\u0434\u044F\u0441\u044C \u043D\u0435 \u0431\u044B\u0432\u0430\u043B\u043E.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0411\u043B\u0430\u0433\u043E\u0434\u0430\u0440\u044F \u0433\u043B\u0443\u043F\u043E\u0441\u0442\u0438 \u0412\u043E\u0440\u043E\u0431\u044C\u044F\u043D\u0438\u043D\u043E\u0432\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0443\u043C\u0443\u0434\u0440\u0438\u043B\u0441\u044F \u043F\u043E\u0442\u0440\u0430\u0442\u0438\u0442\u044C, \u0438\u043C\u0435\u0432\u0448\u0438\u0435\u0441\u044F \u0443 \u043D\u0435\u0433\u043E \u0434\u0435\u043D\u044C\u0433\u0438, \u0432 \u0440\u0435\u0441\u0442\u043E\u0440\u0430\u043D\u0435 \u043D\u0430 \u0415\u043B\u0438\u0437\u0430\u0432\u0435\u0442\u0443 \u041F\u0435\u0442\u0440\u043E\u0432\u043D\u0443 \u041A\u0430\u043B\u0430\u0447\u0451\u0432\u0443, \u0440\u0430\u0434\u0443\u0436\u043D\u044B\u0435 \u043F\u0435\u0440\u0441\u043F\u0435\u043A\u0442\u0438\u0432\u044B \u043D\u0430 \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u0438\u044F \u043A\u043B\u0430\u0434\u0430 \u0443\u043F\u043B\u044B\u0432\u0430\u044E\u0442. \u041E\u0441\u0442\u0430\u043F \u0432\u0437\u0431\u0435\u0448\u0435\u043D, \u043D\u043E \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0447\u0443\u0432\u0441\u0442\u0432\u0430 \u044E\u043C\u043E\u0440\u0430 \u0435\u043C\u0443 \u043D\u0435 \u0437\u0430\u043D\u0438\u043C\u0430\u0442\u044C, \u043E\u043D \u043F\u043E\u0435\u0442 \u041A\u0438\u0441\u0435: \u0410 \u0443 \u043C\u0435\u043D\u044F \u0432 \u0434\u0432\u0443\u0445 \u0441\u0442\u043E\u043B\u0438\u0446\u0430\u0445 \u043A\u043B\u044E\u0447\u0438 \u043E\u0442 \u0434\u0432\u0435\u0440\u0435\u0439 \u0442\u0435\u043F\u0435\u0440\u044C, \u0418 \u044F \u043F\u044B\u0442\u0430\u044E\u0441\u044C \u0431\u044B\u0442\u044C \u0441 \u043A\u0435\u043C-\u0442\u043E \u0435\u0449\u0435, \u041D\u043E \u0434\u0432\u0430 \u0447\u0430\u0441\u0430 \u0438\u0437 \u0442\u043E\u0447\u043A\u0438 \u041C \u0434\u043E \u0433\u043E\u0440\u043E\u0434\u0430 \u0415. \u041F\u043E\u0441\u0438\u0434\u0435\u0432 \u0432 \u043A\u0430\u0444\u0435, \u0438 \u0445\u043E\u0440\u043E\u0448\u0435\u043D\u044C\u043A\u043E \u043F\u043E\u0434\u0443\u043C\u0430\u0432 \u043D\u0430\u0434 \u043C\u0430\u0442\u0435\u0440\u0438\u044F\u043C\u0438 \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u044B\u0445 \u043C\u0430\u0442\u0435\u0440\u0438\u0430\u043B\u043E\u0432, \u041E\u0441\u0442\u0430\u043F \u0440\u0435\u0448\u0430\u0435\u0442\u0441\u044F \u043D\u0430 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0439 \u0445\u043E\u0434.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,2
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n\u0412\u0430\u0441\u044E\u043A\u0438\u043D\u0441\u043A\u0438\u0435 \u0448\u0430\u0445\u043C\u0430\u0442\u0438\u0441\u0442\u044B \u0432\u043D\u0438\u043C\u0430\u043B\u0438 \u041E\u0441\u0442\u0430\u043F\u0443 \u0441 \u0441\u044B\u043D\u043E\u0432\u044C\u0435\u0439 \u043B\u044E\u0431\u043E\u0432\u044C\u044E. \u041E\u0441\u0442\u0430\u043F\u0430 \u043D\u0435\u0441\u043B\u043E. \u041E\u043D \u043F\u043E\u0447\u0443\u0432\u0441\u0442\u0432\u043E\u0432\u0430\u043B \u043F\u0440\u0438\u043B\u0438\u0432 \u043D\u043E\u0432\u044B\u0445 \u0441\u0438\u043B \u0438 \u0448\u0430\u0445\u043C\u0430\u0442\u043D\u044B\u0445 \u0438\u0434\u0435\u0439. \u041F\u0440\u0438\u0435\u0437\u0434 \u0425\u043E\u0437\u0435-\u041C\u0438\u0440\u0430\u043D\u0434\u044B \u041A\u0430\u043F\u0430\u0431\u043B\u0430\u043D\u043A\u0438, \u042D\u043C\u043C\u0430\u043D\u0443\u0438\u043B\u0430 \u041B\u0430\u0441\u043A\u0435\u0440\u0430, \u0410\u043B\u0435\u0445\u0438\u043D\u0430, \u041D\u0438\u043C\u0446\u043E\u0432\u0438\u0447\u0430, \u0420\u0435\u0442\u0438, \u0420\u0443\u0431\u0438\u043D\u0448\u0442\u0435\u0439\u043D\u0430, \u041C\u0430\u0440\u043E\u0446\u0438, \u0422\u0430\u0440\u0440\u0430\u0448\u0430, \u0412\u0438\u0434\u043C\u0430\u0440\u0430 \u0438 \u0434\u043E\u043A\u0442\u043E\u0440\u0430 \u0413\u0440\u0438\u0433\u043E\u0440\u044C\u0435\u0432\u0430, \u0438 \u0434\u0440\u0443\u0433\u0438\u0445, \u0441\u043F\u0438\u0441\u043E\u043A \u043E\u0433\u043B\u0430\u0448\u0430\u0442\u044C \u043D\u0435 \u0431\u0443\u0434\u0443 \u043F\u043E \u0432\u0441\u0435\u0439 \u0434\u043B\u0438\u043D\u0435,  \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u0445 \u0431\u043E\u0439\u0446\u043E\u0432 \u0448\u0430\u0445\u043C\u0430\u0442\u043D\u044B\u0445 \u0431\u0430\u0442\u0430\u043B\u0438\u0439 \u2013 \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D. \u041A\u0440\u043E\u043C\u0435 \u0442\u043E\u0433\u043E, \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D\u043E \u0438 \u043C\u043E\u0435 \u0443\u0447\u0430\u0441\u0442\u0438\u0435!\u00BB\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u041D\u0435 \u043E\u0431\u043B\u0435\u0433\u0447\u0430\u0435\u0442 \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0438 \u0442\u043E, \u0447\u0442\u043E \u0442\u0430\u0439\u043D\u0443 \u0442\u0451\u0449\u0438 \u0412\u043E\u0440\u043E\u0431\u044C\u044F\u043D\u0438\u043D\u043E\u0432\u0430 \u043F\u043E\u0434\u0441\u043B\u0443\u0448\u0430\u043B \u0435\u0449\u0451 \u0438 \u043E\u0442\u0435\u0446 \u0424\u0451\u0434\u043E\u0440 \u0412\u043E\u0441\u0442\u0440\u0438\u043A\u043E\u0432, \u0438\u0441\u043F\u043E\u0432\u0435\u0434\u043E\u0432\u0430\u0432\u0448\u0438\u0439 \u0435\u0451 \u0438 \u0432\u0441\u044E \u0436\u0438\u0437\u043D\u044C \u043C\u0435\u0447\u0442\u0430\u0432\u0448\u0438\u0439 \u043E \u0441\u043E\u0431\u0441\u0442\u0432\u0435\u043D\u043D\u043E\u043C \u0441\u0432\u0435\u0447\u043D\u043E\u043C \u0437\u0430\u0432\u043E\u0434\u0438\u043A\u0435 \u0432 \u0421\u0430\u043C\u0430\u0440\u0435. \u0422\u0430\u043A \u0443\u0436 \u0441\u043B\u043E\u0436\u0438\u043B\u0438\u0441\u044C \u043D\u0435\u043F\u043E\u0434\u0432\u0438\u0436\u043D\u044B\u0435 \u0437\u0432\u0435\u0437\u0434\u044B \u0431\u044D\u0442\u0430 \u0414\u0440\u0430\u043A\u043E\u043D\u0430 \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432, \u0447\u0442\u043E \u043A\u0443\u043F\u0438\u0432 \u043F\u0435\u0440\u0432\u044B\u0439 \u0441\u0442\u0443\u043B \u0438\u0437 \u0434\u0432\u0435\u043D\u0430\u0434\u0446\u0430\u0442\u0438 \u0443 \u0437\u0430\u0432\u0445\u043E\u0437\u0430 2-\u0433\u043E \u0434\u043E\u043C\u0430 \u0421\u0442\u0430\u0440\u0441\u043E\u0431\u0435\u0441\u0430, \u0410\u043B\u0435\u043A\u0441\u0430\u043D\u0434\u0440\u0430 \u042F\u043A\u043E\u0432\u043B\u0435\u0432\u0438\u0447\u0430, \u0435\u0433\u043E \u0437\u0430\u043C\u0435\u0447\u0430\u0435\u0442 \u041A\u0438\u0441\u0430 \u0412\u043E\u0440\u043E\u0431\u044C\u044F\u043D\u0438\u043D\u043E\u0432, \u0438 \u043C\u0435\u0436\u0434\u0443 \u043D\u0438\u043C\u0438 \u0437\u0430\u0432\u044F\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0434\u0440\u0430\u043A\u0430. \u0412 \u043A\u043E\u043D\u0446\u0435 \u0432\u044B\u044F\u0441\u043D\u044F\u0435\u0442\u0441\u044F, \u0447\u0442\u043E \u0432 \u0441\u0442\u0443\u043B\u0435 \u0441\u043E\u043A\u0440\u043E\u0432\u0438\u0449 \u043D\u0435\u0442. \u041E\u0441\u0442\u0430\u043F \u0411\u0435\u043D\u0434\u0435\u0440 \u043F\u043E\u043B\u0443\u0447\u0430\u0435\u0442 \u043E\u0440\u0434\u0435\u0440\u0430 \u043D\u0430 \u00AB\u0412\u043E\u0440\u043E\u0431\u044C\u044F\u043D\u0438\u043D\u043E\u0432\u0441\u043A\u0438\u0435\u00BB \u0441\u0442\u0443\u043B\u044C\u044F \u043E\u0442 \u0430\u0440\u0445\u0438\u0432\u0430\u0440\u0438\u0443\u0441\u0430 \u0412\u0430\u0440\u0444\u043E\u043B\u043E\u043C\u0435\u044F \u041A\u043E\u0440\u043E\u0431\u0435\u0439\u043D\u0438\u043A\u043E\u0432\u0430, \u0430 \u043E\u0442\u0435\u0446 \u0424\u0451\u0434\u043E\u0440 \u2014 \u043E\u0440\u0434\u0435\u0440 \u043D\u0430 \u0441\u0442\u0443\u043B\u044C\u044F \u0433\u0435\u043D\u0435\u0440\u0430\u043B\u044C\u0448\u0438 \u041F\u043E\u043F\u043E\u0432\u043E\u0439.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\u0412\u043E \u0412\u043B\u0430\u0434\u0438\u043A\u0430\u0432\u043A\u0430\u0437\u0435 \u043F\u0440\u0438\u0448\u043B\u043E\u0441\u044C \u043F\u0440\u043E\u0441\u0438\u0434\u0435\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0434\u043D\u0435\u0439. \u041D\u043E \u0432\u0441\u0435 \u043F\u043E\u043F\u044B\u0442\u043A\u0438 \u0434\u043E\u0441\u0442\u0430\u0442\u044C \u0434\u0435\u043D\u044C\u0433\u0438 \u043D\u0430 \u043F\u0440\u043E\u0435\u0437\u0434 \u043F\u043E \u0412\u043E\u0435\u043D\u043D\u043E-\u0413\u0440\u0443\u0437\u0438\u043D\u0441\u043A\u043E\u0439 \u0434\u043E\u0440\u043E\u0433\u0435 \u0438\u043B\u0438 \u0441\u043E\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E \u043D\u0435 \u043F\u0440\u0438\u043D\u043E\u0441\u0438\u043B\u0438 \u043F\u043B\u043E\u0434\u043E\u0432, \u0438\u043B\u0438 \u0434\u0430\u0432\u0430\u043B\u0438 \u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0430, \u0434\u043E\u0441\u0442\u0430\u0442\u043E\u0447\u043D\u044B\u0435 \u043B\u0438\u0448\u044C \u0434\u043B\u044F \u0434\u043D\u0435\u0432\u043D\u043E\u0433\u043E \u043F\u0440\u043E\u043F\u0438\u0442\u0430\u043D\u0438\u044F. \u041F\u043E\u043F\u044B\u0442\u043A\u0430 \u0432\u0437\u0438\u043C\u0430\u0442\u044C \u0441 \u0433\u0440\u0430\u0436\u0434\u0430\u043D \u0433\u0440\u0438\u0432\u0435\u043D\u043D\u0438\u043A\u0438 \u043E\u043A\u0430\u0437\u0430\u043B\u0430\u0441\u044C \u043D\u0435 \u0444\u043E\u043D\u0442\u0430\u043D. \u041A\u0430\u0432\u043A\u0430\u0437\u0441\u043A\u0438\u0439 \u0445\u0440\u0435\u0431\u0435\u0442 \u0431\u044B\u043B \u043D\u0430\u0441\u0442\u043E\u043B\u044C\u043A\u043E \u0432\u044B\u0441\u043E\u043A \u0438 \u0432\u0438\u0434\u0435\u043D \u0432 \u043B\u0443\u0447\u0430\u0445 \u0441\u043E\u043B\u043D\u0446\u0430, \u0447\u0442\u043E \u0431\u0440\u0430\u0442\u044C \u0437\u0430 \u0435\u0433\u043E \u043F\u043E\u043A\u0430\u0437 \u0434\u0435\u043D\u044C\u0433\u0438 \u043D\u0435 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u043B\u043E\u0441\u044C \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u044B\u043C. \u0415\u0433\u043E \u0431\u044B\u043B\u043E \u0432\u0438\u0434\u043D\u043E \u043F\u043E\u0447\u0442\u0438 \u043E\u0442\u043E\u0432\u0441\u044E\u0434\u0443. \u0414\u0440\u0443\u0433\u0438\u0445 \u0436\u0435 \u043A\u0440\u0430\u0441\u043E\u0442 \u0432\u043E \u0412\u043B\u0430\u0434\u0438\u043A\u0430\u0432\u043A\u0430\u0437\u0435 \u043D\u0435 \u0431\u044B\u043B\u043E.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0421\u0440\u0435\u0434\u0438 \u0446\u0432\u0435\u0442\u043D\u0438\u043A\u0430, \u0432 \u00AB\u0422\u0440\u0435\u043A\u0435\u00BB \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0438\u043B\u0441\u044F \u0431\u043E\u043C\u043E\u043D\u0434 \u0433\u043E\u0440\u043E\u0434\u0430. \u0412 \u043B\u0443\u0447\u0430\u0445 \u0443\u043B\u044C\u0442\u0440\u0430\u0444\u0438\u043E\u043B\u0435\u0442\u0430 \u0431\u043B\u0438\u0441\u0442\u0430\u043B\u0438  \u0431\u0440\u044B\u0437\u0433\u0438 \u0444\u043E\u043D\u0442\u0430\u043D\u0430. \u0418\u0433\u0440\u0430\u043B \u043E\u0440\u043A\u0435\u0441\u0442\u0440. \u041D\u043E \u0432\u0441\u0435 \u043F\u043E\u043F\u044B\u0442\u043A\u0438 \u041E\u0441\u0442\u0430\u043F\u0430 \u0434\u043E\u0441\u0442\u0430\u0442\u044C \u0434\u0435\u043D\u044C\u0433\u0438 \u043D\u0430 \u043F\u0440\u043E\u0435\u0437\u0434 \u043F\u043E \u0412\u043E\u0435\u043D\u043D\u043E-\u0413\u0440\u0443\u0437\u0438\u043D\u0441\u043A\u043E\u0439 \u0434\u043E\u0440\u043E\u0433\u0435 \u0438\u043B\u0438 \u0441\u043E\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E \u043D\u0435 \u043F\u0440\u0438\u043D\u043E\u0441\u0438\u043B\u0438 \u043F\u043B\u043E\u0434\u043E\u0432, \u0438\u043B\u0438 \u0434\u0430\u0432\u0430\u043B\u0438 \u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0430, \u0434\u043E\u0441\u0442\u0430\u0442\u043E\u0447\u043D\u044B\u0435 \u043B\u0438\u0448\u044C \u0434\u043B\u044F \u0434\u043D\u0435\u0432\u043D\u043E\u0433\u043E \u043F\u0440\u043E\u043F\u0438\u0442\u0430\u043D\u0438\u044F. \u0427\u0442\u043E \u0436\u0435 \u043A\u0430\u0441\u0430\u0435\u0442\u0441\u044F \u0422\u0435\u0440\u0435\u043A\u0430, \u0442\u043E \u043F\u0440\u043E\u0442\u0435\u043A\u0430\u043B \u043E\u043D \u043C\u0438\u043C\u043E \u00AB\u0422\u0440\u0435\u043A\u0430\u00BB, \u0437\u0430 \u0432\u0445\u043E\u0434 \u0432 \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0434\u0435\u043D\u044C\u0433\u0438 \u0432\u0437\u0438\u043C\u0430\u043B \u0433\u043E\u0440\u043E\u0434 \u0431\u0435\u0437 \u043F\u043E\u043C\u043E\u0449\u0438 \u041E\u0441\u0442\u0430\u043F\u0430. \u0421\u0431\u043E\u0440 \u043F\u043E\u0434\u0430\u044F\u043D\u0438\u0439, \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0439 \u0418\u043F\u043F\u043E\u043B\u0438\u0442\u043E\u043C \u041C\u0430\u0442\u0432\u0435\u0435\u0432\u0438\u0447\u0435\u043C, \u043F\u0440\u0438\u043D\u0435\u0441 \u0437\u0430 \u0434\u0432\u0430 \u0434\u043D\u044F \u0442\u0440\u0438\u043D\u0430\u0434\u0446\u0430\u0442\u044C \u043A\u043E\u043F\u0435\u0435\u043A. \u0411\u0435\u0437\u0433\u043E\u043B\u043E\u0432\u043E\u0435 \u0438 \u0431\u0435\u0437\u0440\u0443\u043A\u043E\u0435 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u0435.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0430\u0440\u043A \u043A\u0443\u043B\u044C\u0442\u0443\u0440\u044B \u0438 \u043E\u0442\u0434\u044B\u0445\u0430 \u0438\u043C. \u0425\u0435\u0442\u0430\u0433\u0443\u0440\u043E\u0432\u0430. \u0412 \u0442\u043E\u043C \u043C\u0435\u0441\u0442\u0435, \u0433\u0434\u0435 \u0441\u0435\u0439\u0447\u0430\u0441 \u0440\u0430\u0437\u0431\u0438\u0442 \u0446\u0432\u0435\u0442\u043D\u0438\u043A \u0438 \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u044B \u043C\u0435\u0441\u0442\u0430 \u0434\u043B\u044F \u0441\u043B\u0443\u0448\u0430\u0442\u0435\u043B\u0435\u0439 \u043E\u0440\u043A\u0435\u0441\u0442\u0440\u0430, \u0431\u044B\u043B \u0443\u0441\u0442\u0440\u043E\u0435\u043D \u0432\u0435\u043B\u043E\u0434\u0440\u043E\u043C, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0432\u0441\u0435 \u0441\u0442\u0430\u043B\u0438 \u043D\u0430\u0437\u044B\u0432\u0430\u0442\u044C \u0422\u0440\u0435\u043A\u043E\u043C.
TASK_CODE_7=FL45N7
BONUS_FIVE_MINUTES=RT5
BONUS_TEN_MINUTES=QM2
BONUS_FIFTEEN_MINUTES=SP7