#Sun Sep 17 21:30:01 MSK 2017
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0441 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u041F\u0435\u0440\u0435\u0434 \u0434\u043E\u043C\u043E\u043C \u0432\u043E\u0437\u0432\u044B\u0448\u0430\u043B\u0441\u044F \u0444\u043E\u043D\u0442\u0430\u043D. \u041E\u043D \u0431\u044B\u043B \u043D\u0430\u0441\u0442\u043E\u043B\u044C\u043A\u043E \u043D\u0435\u043A\u0430\u0437\u0438\u0441\u0442, \u0447\u0442\u043E \u0438\u0434\u0435\u0430\u043B\u044C\u043D\u043E \u0432\u043F\u0438\u0441\u044B\u0432\u0430\u043B\u0441\u044F \u0432 \u043F\u0435\u0439\u0437\u0430\u0436. \u0421\u043B\u0443\u0433\u0430 \u043F\u0440\u0438\u043D\u044F\u043B \u043C\u043E\u0435\u0433\u043E \u043A\u043E\u043D\u044F, \u0438 \u044F \u0432\u0441\u0442\u0443\u043F\u0438\u043B \u043F\u043E\u0434 \u0433\u043E\u0442\u0438\u0447\u0435\u0441\u043A\u0438\u0435 \u0441\u0432\u043E\u0434\u044B \u043F\u0440\u0438\u0445\u043E\u0436\u0435\u0439. (\u0421\u0434\u0430\u0439\u0442\u0435 \u043B\u043E\u0448\u0430\u0434\u044C \u0430\u0433\u0435\u043D\u0442\u0443 \u0432 \u043E\u0431\u043C\u0435\u043D \u043D\u0430 \u043A\u043E\u0434).\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1
GAME_LEGEND=\u041F\u0430\u0434\u0435\u043D\u0438\u0435 \u0434\u043E\u043C\u0430 \u0410\u0448\u0435\u0440\u043E\u0432.\n\n\u042F, \u0442\u0443\u0441\u043A\u043B\u044B\u043C \u043E\u0441\u0435\u043D\u043D\u0438\u043C \u0434\u043D\u0435\u043C \u043F\u043E \u043F\u0440\u0438\u0433\u043B\u0430\u0448\u0435\u043D\u0438\u044E \u0420\u043E\u0434\u0435\u0440\u0438\u043A\u0430 \u0410\u0448\u0435\u0440\u0430 \u043F\u043E\u0434\u044A\u0435\u0437\u0436\u0430\u043B \u043A \u0440\u043E\u0434\u043E\u0432\u043E\u043C\u0443 \u0437\u0430\u043C\u043A\u0443 \u0445\u043E\u0437\u044F\u0438\u043D\u0430. \u042F \u0435\u0445\u0430\u043B \u0432\u0435\u0440\u0445\u043E\u043C, \u043F\u043E \u043C\u0440\u0430\u0447\u043D\u043E\u0439 \u043F\u0443\u0441\u0442\u044B\u043D\u043D\u043E\u0439 \u043C\u0435\u0441\u0442\u043D\u043E\u0441\u0442\u0438. \u041F\u043E\u0434\u044A\u0435\u0445\u0430\u0432 \u043A \u0437\u0430\u043C\u043A\u0443, \u043C\u043E\u0435\u043C\u0443 \u0432\u0437\u043E\u0440\u0443 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u043B, \u0437\u0430\u043F\u0443\u0441\u0442\u0435\u043B\u044B\u0439 \u043E\u0434\u0438\u043D\u043E\u043A\u0438\u0439 \u0434\u043E\u043C \u0441 \u0443\u0433\u0440\u044E\u043C\u044B\u043C\u0438 \u0441\u0442\u0435\u043D\u0430\u043C\u0438 \u0438 \u0432\u044B\u0431\u0438\u0442\u044B\u043C\u0438 \u043E\u043A\u043D\u0430\u043C\u0438. \u041F\u043E \u043E\u0434\u043D\u043E\u0439 \u0438\u0437 \u0441\u0442\u0435\u043D \u0448\u043B\u0430 \u0435\u043B\u0435 \u0432\u0438\u0434\u043D\u0430\u044F \u0442\u0440\u0435\u0449\u0438\u043D\u0430 \u043E\u0442 \u043A\u0440\u044B\u0448\u0438 \u043F\u043E \u0432\u0441\u0435\u0439 \u0441\u0442\u0435\u043D\u0435 \u0437\u0434\u0430\u043D\u0438\u044F. \u0414\u043E\u043C \u0438 \u043E\u043A\u0440\u0443\u0436\u0430\u044E\u0449\u0438\u0439 \u043F\u0435\u0439\u0437\u0430\u0436 \u043F\u043E \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u043C \u043F\u0440\u0438\u0447\u0438\u043D\u0430\u043C \u0432\u044B\u0437\u044B\u0432\u0430\u043B\u0438 \u0447\u0443\u0432\u0441\u0442\u0432\u043E \u0443\u0436\u0430\u0441\u0430.\n\u0414\u043E\u043F\u044B:\n\u0424\u043E\u043D\u0430\u0440\u0438\u043A\u0438\n\u041B\u043E\u0448\u0430\u0434\u044C \u0438\u043B\u0438 \u0433\u043E\u043B\u043E\u0432\u0430 \u043B\u043E\u0448\u0430\u0434\u0438 (\u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0443\u044E \u043D\u0435 \u043D\u0430\u0434\u043E)
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041C\u0435\u0436\u0434\u0443 \u0433\u043E\u0441\u0442\u0438\u043D\u0438\u0446\u0435\u0439 \u0414\u0438\u0430\u043C\u043E\u043D\u0434 \u0438 \u0410\u0417\u0421 \u041C\u0438\u0440\u0430\u043D\u0434\u0430, \u043D\u0430 \u0443\u043B. \u0421\u0442\u0430\u0432\u0440\u043E\u043F\u043E\u043B\u044C\u0441\u043A\u0430\u044F.
TASK_CODE_6=A3N65G
START_CODE=sn
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u0440\u0438\u0441\u043C\u043E\u0442\u0440\u0435\u0432\u0448\u0438\u0441\u044C \u043A \u043A\u0430\u0440\u0442\u0438\u043D\u0430\u043C, \u044F \u0443\u0432\u0438\u0434\u0435\u043B \u0438\u043C\u044F \u0445\u0443\u0434\u043E\u0436\u043D\u0438\u043A\u0430 \u041C\u0438\u0440\u0430\u043D\u0434\u0430 \u0411\u0435\u0442\u0443\u0438\u043D \u0414\u0438\u0430\u043C\u043E\u043D\u0434.
TASK_CODE_4=A3N11G
TASK_CODE_3=8A8N8G
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B.\u0412\u043B\u0430\u0434\u0438\u0432\u043E\u0441\u0442\u043E\u043A\u0441\u043A\u0430\u044F, \u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u0412\u0438\u043A\u0430\u043B\u0438\u043D\u044B.
TASK_CODE_2=AN457G
TASK_CODE_1=A17N5G
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041E\u043D \u043F\u043E\u0432\u0435\u0434\u0430\u043B \u0434\u0440\u0443\u0433\u0443, \u0447\u0442\u043E \u0435\u0433\u043E \u0441\u0435\u0441\u0442\u0440\u0430 \u0412\u0438\u043A\u0430\u043B\u0438\u043D\u0430, \u043F\u0440\u043E\u0441\u0442\u0438\u0442\u0435 \u041C\u044D\u0434\u0438\u043B\u0435\u0439\u043D, \u0432\u043E\u0442-\u0432\u043E\u0442 \u0443\u043C\u0440\u0435\u0442. \u0412\u0440\u044F\u0434 \u043B\u0438 \u043E\u043D\u0430 \u043F\u0440\u043E\u0436\u0438\u0432\u0435\u0442 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0434\u043D\u0435\u0439. \u041E\u043D\u0430 \u043E\u0442\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u043B\u043E\u0436\u0438\u0442\u044C\u0441\u044F \u0432 \u043A\u0440\u043E\u0432\u0430\u0442\u044C \u0438 \u0445\u043E\u0434\u0438\u0442 \u043F\u043E \u0434\u043E\u043C\u0443. \u0422\u0443\u0442 \u0432 \u043A\u043E\u043C\u043D\u0430\u0442\u0443, \u043A\u0430\u043A \u043F\u0440\u0438\u0437\u0440\u0430\u043A, \u0432\u043E\u0448\u043B\u0430 \u043E\u0447\u0435\u043D\u044C \u0442\u043E\u043D\u043A\u0430\u044F, \u043F\u043E\u043B\u0443\u043F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u0430\u044F \u043B\u0435\u0434\u0438 \u041C\u044D\u0434\u0438\u043B\u0435\u0439\u043D \u0438, \u0434\u0430\u0436\u0435 \u043D\u0435 \u0437\u0430\u043C\u0435\u0442\u0438\u0432 \u0433\u043E\u0441\u0442\u044F, \u043C\u043E\u043B\u0447\u0430 \u043F\u0440\u043E\u0448\u043B\u0430 \u043F\u043E \u0441\u0432\u043E\u0438\u043C \u0434\u0435\u043B\u0430\u043C. \u0411\u0440\u0430\u0442 \u043F\u0440\u0438\u043A\u0440\u044B\u0432 \u043B\u0438\u0446\u043E \u0445\u0443\u0434\u044B\u043C\u0438 \u0440\u0443\u043A\u0430\u043C\u0438, \u0437\u0430\u043F\u043B\u0430\u043A\u0430\u043B. \u0412 \u0433\u043E\u043B\u043E\u0432\u0435 \u0434\u043E \u0441\u0438\u0445 \u043F\u043E\u0440 \u0437\u0432\u0443\u0447\u0430\u043B\u0438 \u0441\u043B\u043E\u0432\u0430 \u0420\u043E\u0434\u0435\u0440\u0438\u043A\u0430, \u043A\u0430\u043A \u043F\u0435\u0441\u043D\u044F.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0417\u0430\u0431\u0440\u043E\u0448\u0435\u043D\u043D\u044B\u0439 \u0434\u043E\u043C \u043D\u0430 \u0413\u0432\u0430\u0440\u0434\u0435\u0439\u0441\u043A\u043E\u0439.
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u043E\u043C\u043E\u0433\u043B\u0430 \u043F\u0440\u0438\u0432\u044B\u0447\u043A\u0430, \u043F\u0440\u0438\u043E\u0431\u0440\u0435\u0442\u0435\u043D\u043D\u0430\u044F \u0432 \u0433\u0432\u0430\u0440\u0434\u0438\u0438 \u2013 \u0437\u0430\u0441\u044B\u043F\u0430\u0442\u044C \u043F\u0440\u0438 \u043F\u043E\u044F\u0432\u0438\u0432\u0448\u0435\u0439\u0441\u044F \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u0438. \u0425\u043E\u0442\u044F \u043B\u0438\u0447\u043D\u043E \u044F \u0442\u0430\u043A\u0443\u044E \u043F\u0440\u0438\u0432\u044B\u0447\u043A\u0443 \u043F\u0440\u0438\u043E\u0431\u0440\u0435\u043B \u0432 \u0433\u043E\u0434\u044B \u0443\u0447\u0435\u0431\u044B \u0432 \u0438\u043D\u0441\u0442\u0438\u0442\u0443\u0442\u0435. \u0412\u0434\u0440\u0443\u0433 \u043F\u043E \u0434\u043E\u043C\u0443 \u0410\u0448\u0435\u0440\u043E\u0432 \u0440\u0430\u0437\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u0442\u0440\u0435\u0441\u043A \u0438 \u0433\u0440\u043E\u0445\u043E\u0442 \u043B\u043E\u043C\u0430\u044E\u0449\u0438\u0445\u0441\u044F \u0441\u0442\u0435\u043D. \u042F \u0441\u0432\u044F\u0437\u044B\u0432\u0430\u043B \u043F\u043E\u0434\u043E\u0437\u0440\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0437\u0432\u0443\u043A\u0438 \u0441 \u0443\u0440\u0430\u0433\u0430\u043D\u043E\u043C \u0437\u0430 \u043E\u043A\u043D\u043E\u043C, \u0438 \u0442\u043E\u043B\u044C\u043A\u043E \u0420\u043E\u0434\u0435\u0440\u0438\u043A \u0410\u0448\u0435\u0440 \u043F\u043E\u043D\u0438\u043C\u0430\u0435\u0442: \u044D\u0442\u043E \u0435\u0433\u043E \u0443\u043C\u0435\u0440\u0448\u0430\u044F \u0441\u0435\u0441\u0442\u0440\u0430 \u0432\u0437\u043B\u043E\u043C\u0430\u043B\u0430 \u0441\u0432\u043E\u0439 \u0433\u0440\u043E\u0431.
START_TIME=16-30
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u043E\u043D\u0438, \u043D\u0430\u0439\u0442\u0438 \u0430\u0433\u0435\u043D\u0442\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u044B \u043F\u0440\u0438\u043D\u044F\u043B \u043A\u043E\u043D\u044F.
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u042D\u0442\u0430\u043A\u0438\u0439 \u043D\u0435\u0443\u043A\u043B\u044E\u0436\u0438\u0439 \u043C\u043E\u043D\u0443\u043C\u0435\u043D\u0442 \u0434\u0440\u0443\u0436\u0431\u044B, \u0445\u0430\u043E\u0441\u0430 \u0438 \u0440\u0430\u0437\u0440\u0443\u0445\u0438. \u0425\u043E\u0437\u044F\u0438\u043D \u044D\u0442\u043E\u0433\u043E \u0434\u043E\u043C\u0430 \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u043B \u0443\u0436\u0435 50 \u043E\u043A\u0442\u044F\u0431\u0440\u044C. \u0421\u043A\u0432\u043E\u0437\u043D\u044F\u043A \u043F\u0440\u043E\u043D\u0438\u043A\u0430\u043B \u0441\u043A\u0432\u043E\u0437\u044C \u0449\u0435\u043B\u0438 \u0432 \u0441\u0442\u0435\u043D\u0430\u0445, \u043F\u0440\u0438\u043D\u043E\u0441\u044F \u0441 \u0441\u043E\u0431\u043E\u0439, \u0440\u0436\u0430\u043D\u0438\u0435 \u043A\u043E\u043D\u0435\u0439 \u0438 \u0448\u0443\u043C \u0444\u043E\u043D\u0442\u0430\u043D\u0430.
TASK_CODE_5=A1N6G8
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B.\u0424\u0435\u0441\u0438\u043D\u0430, \u043A\u043E\u0442\u0442\u0435\u0434\u0436\u0438
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u0435\u0440\u0432\u044B\u043C \u0437\u0430\u0433\u043E\u0432\u043E\u0440\u0438\u043B \u0410\u0448\u0435\u0440, \u043E\u043D \u0431\u044B\u043B \u0433\u0435\u043D\u0435\u0440\u0430\u043B-\u043C\u0430\u0439\u043E\u0440\u043E\u043C, \u043F\u0440\u0435\u0434\u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0438\u043C \u043A\u043E\u043C\u0430\u043D\u0434\u0438\u0440\u043E\u043C  236-\u043E\u0439 \u0441\u0442\u0440\u0435\u043B\u043A\u043E\u0432\u043E\u0439 \u0434\u0438\u0432\u0438\u0437\u0438\u0438. \u00AB\u0411\u044B\u0432\u0430\u043B\u0438 \u043B\u0438 \u0432\u044B \u0432 \u044D\u0442\u043E\u043C \u0433\u043E\u0440\u043E\u0434\u0435, \u043C\u043E\u0439 \u043B\u044E\u0431\u0435\u0437\u043D\u044B\u0439 \u0434\u0440\u0443\u0433?\u00BB
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421/\u0442 \u043C\u0435\u0442\u0430\u043B\u043B\u0443\u0440\u0433, \u0441\u0442\u043E\u0440\u043E\u0436\u043A\u0430 \u043D\u0430 \u0432\u044C\u0435\u0437\u0434\u0435.
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0414\u043E\u043C \u043D\u0435 \u043A\u0430\u0436\u0435\u0442\u0441\u044F \u043F\u0440\u043E\u0447\u043D\u044B\u043C, \u043A\u0430\u043A \u043C\u0435\u0442\u0430\u043B\u043B, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043C\u0435\u0442\u0430\u043B\u043B\u0443\u0440\u0433\u0438 \u043F\u043B\u043E\u0445\u043E \u043F\u043E\u0434\u0432\u0435\u0440\u0433\u043B\u0438 \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0435, \u043A\u0430\u043A \u0441\u0430\u0434, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0442\u043E\u0432\u0430\u0440\u0438\u0449\u0438 \u0441\u0430\u0434\u043E\u0432\u043E\u0434\u044B \u043D\u0435 \u043E\u0431\u043B\u0430\u0433\u043E\u0440\u043E\u0434\u0438\u043B\u0438. \u0418 \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u043E\u043A\u043D\u0430\u0445 \u0434\u043E\u043C\u0430 \u043A\u0430\u0437\u0430\u043B\u043E\u0441\u044C, \u043C\u0435\u0440\u0446\u0430\u043B \u0432\u0435\u0447\u043D\u044B\u0439 \u043E\u0433\u043E\u043D\u044C. \u0416\u0435\u043C\u0447\u0443\u0436\u0438\u043D\u043E\u0439 \u044D\u0442\u043E\u0433\u043E \u0431\u044B\u043B\u0438 \u043E\u0449\u0443\u0449\u0435\u043D\u0438\u044F, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0432\u044B\u0437\u044B\u0432\u0430\u043B\u0438 \u043A\u0430\u043A\u043E\u0439-\u0442\u043E \u0434\u043E\u0438\u0441\u0442\u043E\u0440\u0438\u0447\u0435\u0441\u043A\u0438\u0439 \u0441\u0442\u0440\u0430\u0445.
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n11 \u044F\u043D\u0432\u0430\u0440\u044F. \u0420\u043E\u0434\u0435\u0440\u0438\u043A \u0441\u0443\u0445\u043E \u0438 \u043D\u0435\u043C\u043D\u043E\u0433\u043E\u0441\u043B\u043E\u0432\u043D\u043E \u0441\u043E\u043E\u0431\u0449\u0430\u0435\u0442 \u0440\u0430\u0441\u0441\u043A\u0430\u0437\u0447\u0438\u043A\u0443 \u043E \u0441\u043C\u0435\u0440\u0442\u0438 \u0441\u0435\u0441\u0442\u0440\u044B, \u044D\u0442\u043E\u0439 \u043D\u043E\u0447\u044C\u044E \u0432 8 \u043C\u0438\u043D\u0443\u0442  2 \u0438 \u043E \u0442\u043E\u043C, \u0447\u0442\u043E \u00AB\u0441\u0440\u043E\u043A\u0438 \u0441\u0442\u0440\u0430\u0448\u043D\u044B\u0435 \u0431\u043B\u0438\u0437\u044F\u0442\u0441\u044F\u00BB. \u0418\u043C\u0435\u043D\u043D\u043E \u0441 \u044D\u0442\u043E\u0433\u043E \u043D\u0430\u0447\u0430\u043B \u0410\u0448\u0435\u0440, \u0443\u0432\u0435\u0440\u0435\u043D\u043D\u044B\u0439, \u0447\u0442\u043E \u0441\u0430\u043C\u043E\u0435 \u0441\u0442\u0440\u0430\u0448\u043D\u043E\u0435 \u0441\u043B\u0443\u0447\u0438\u0442\u0441\u044F \u043F\u043E\u0437\u0436\u0435...\u0427\u0435\u0440\u0435\u0437 15 \u0434\u043D\u0435\u0439 \u0438  4 \u0447\u0430\u0441\u0430, \u0441\u043F\u0443\u0441\u0442\u044F \u00AB2-3 \u043D\u0435\u0432\u044B\u0440\u0430\u0437\u0438\u043C\u043E \u0441\u043A\u043E\u0440\u0431\u043D\u044B\u0445 \u0434\u043D\u0435\u0439\u00BB \u043F\u043E\u0441\u043B\u0435 \u0441\u043A\u043E\u0440\u043E\u043F\u043E\u0441\u0442\u0438\u0436\u043D\u043E\u0439 \u043A\u043E\u043D\u0447\u0438\u043D\u044B \u043B\u0435\u0434\u0438 \u041C\u044D\u0434\u0438\u043B\u0435\u0439\u043D, \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442\u0441\u044F \u0441\u0442\u0440\u0430\u0448\u043D\u0430\u044F \u0433\u0440\u043E\u0437\u0430, 10 \u0438 2 \u043F\u043E \u0448\u043A\u0430\u043B\u0435 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438. \u0427\u0430\u0441\u044B \u043F\u043E\u043A\u0430\u0437\u044B\u0432\u0430\u043B\u0438 6 \u043C\u0438\u043D\u0443\u0442 \u0432\u0442\u043E\u0440\u043E\u0433\u043E. \u0421\u043A\u0432\u043E\u0437\u044C \u0432\u043E\u0439 \u0432\u0435\u0442\u0440\u0430, \u0434\u043E \u043C\u0435\u043D\u044F \u0434\u043E\u043D\u043E\u0441\u043B\u0438\u0441\u044C  21 \u0438\u043B\u0438 5 \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0445  \u0433\u043B\u0443\u0445\u0438\u0445 \u0437\u0432\u0443\u043A\u043E\u0432 \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E\u0433\u043E \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u044F. \u041D\u0430 4 \u0443\u0434\u0430\u0440\u0435 \u0438\u043B\u0438 \u043F\u0435\u0440\u0432\u043E\u043C, \u043D\u0435 \u0437\u043D\u0430\u044E \u0442\u043E\u0447\u043D\u043E, \u0410\u0448\u0435\u0440\u0430 \u0447\u0443\u0442\u044C \u043D\u0435 \u0445\u0432\u0430\u0442\u0438\u043B \u043F\u0440\u0438\u0441\u0442\u0443\u043F. \u0427\u0442\u043E\u0431\u044B \u0443\u0441\u043F\u043E\u043A\u043E\u0438\u0442\u044C \u0438 \u043E\u0442\u0432\u043B\u0435\u0447\u044C \u0420\u043E\u0434\u0435\u0440\u0438\u043A\u0430 \u043E\u0442 \u0442\u044F\u0433\u043E\u0441\u0442\u043D\u044B\u0445 \u043C\u044B\u0441\u043B\u0435\u0439, \u044F \u0447\u0438\u0442\u0430\u043B \u0435\u043C\u0443 1 \u043A\u043D\u0438\u0433\u0443 \u0441 \u0447\u0435\u0442\u0432\u0435\u0440\u0442\u043E\u0439 \u0433\u043B\u0430\u0432\u044B. \u041F\u0435\u0440\u0432\u044B\u0435 13 \u0441\u0442\u0440\u043E\u043A \u043F\u044F\u0442\u043E\u0433\u043E \u0430\u0431\u0437\u0430\u0446\u0430 \u0410\u0448\u0435\u0440\u0430 \u0442\u0440\u044F\u0441\u043B\u043E. \u041D\u043E \u043F\u043E\u0441\u0442\u0435\u043F\u0435\u043D\u043D\u043E \u043E\u043D \u0443\u0441\u043F\u043E\u043A\u043E\u0438\u043B\u0441\u044F \u0438 \u0447\u0435\u0440\u0435\u0437 3 \u0438\u043B\u0438 5 \u043C\u0438\u043D\u0443\u0442 \u0443\u0441\u043D\u0443\u043B\u2026\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
START_DATE=30-09-2017
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u0414\u043E\u043C \u0432 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0438 \u0435\u0433\u043E \u0445\u043E\u0437\u044F\u0438\u043D\u0430 \u2014 \u044D\u0442\u043E \u0437\u0432\u0435\u0440\u044C, \u043C\u0435\u0447\u0442\u0430\u044E\u0449\u0438\u0439, \u0441\u043E\u0436\u0440\u0430\u0442\u044C \u0432\u0441\u0435\u0445, \u043A\u0442\u043E \u0442\u043E\u043B\u044C\u043A\u043E \u043F\u0440\u0438\u0431\u043B\u0438\u0437\u0438\u0442\u0441\u044F \u043A \u0435\u0433\u043E \u043B\u043E\u0433\u043E\u0432\u0443. \u0421\u043F\u0440\u0430\u0432\u0435\u0434\u043B\u0438\u0432\u043E\u0441\u0442\u044C \u044D\u0442\u043E\u0439 \u043C\u044B\u0441\u043B\u0438 \u0431\u0443\u0434\u0442\u043E \u0431\u044B \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0430\u0435\u0442\u0441\u044F \u0441\u0433\u0443\u0449\u0435\u043D\u0438\u0435\u043C \u0441\u0432\u043E\u0435\u0439 \u043E\u0441\u043E\u0431\u0435\u043D\u043D\u043E\u0439 \u0430\u0442\u043C\u043E\u0441\u0444\u0435\u0440\u044B, \u044D\u0442\u0430\u043A\u0438\u043C \u043D\u0435\u0433\u0430\u0441\u043D\u0443\u0449\u0438\u043C \u043F\u043B\u0430\u043C\u0435\u043D\u0435\u043C, \u043A\u043E\u0442\u043E\u0440\u044B\u0439  \u043F\u0430\u0433\u0443\u0431\u043D\u043E \u0441\u043A\u0430\u0437\u044B\u0432\u0430\u043B\u0441\u044F \u0441\u043D\u0430\u0447\u0430\u043B\u0430 \u043D\u0430 \u043F\u0440\u0435\u0434\u043A\u0430\u0445 \u0420\u043E\u0434\u0435\u0440\u0438\u043A\u0430 \u0410\u0448\u0435\u0440\u0430, \u0430 \u0442\u0435\u043F\u0435\u0440\u044C \u0438 \u043D\u0430 \u043D\u0451\u043C \u0441\u0430\u043C\u043E\u043C. \u0414\u043E\u0416\u0414\u044C \u0437\u0430 \u043E\u043A\u043D\u043E\u043C \u0432\u0441\u0435 \u043D\u0435 \u043A\u043E\u043D\u0447\u0430\u043B\u0441\u044F.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n\u041E\u043D \u0431\u044B\u0441\u0442\u0440\u043E \u043F\u0435\u0440\u0435\u0445\u043E\u0434\u0438\u043B \u043E\u0442 \u0432\u043E\u0437\u0431\u0443\u0436\u0434\u0435\u043D\u0438\u044F \u043A \u0443\u043D\u044B\u043D\u0438\u044E. \u0415\u0433\u043E \u0433\u043E\u043B\u043E\u0441 \u0434\u0440\u043E\u0436\u0430\u043B, \u0420\u043E\u0434\u0435\u0440\u0438\u043A \u0436\u0434\u0430\u043B, \u0447\u0442\u043E \u043E\u043D \u0432\u0441\u043A\u043E\u0440\u0435 \u043F\u043E\u0433\u0438\u0431\u043D\u0435\u0442 \u043E\u0442 \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E\u0439 \u0431\u043E\u043B\u0435\u0437\u043D\u0438: \u0423\u0445\u043E\u0434\u0438\u043C, \u043C\u044B \u0432\u0441\u0435 \u0443\u0445\u043E\u0434\u0438\u043C, \u0432 \u043E\u0436\u0438\u0434\u0430\u043D\u0438\u0438 \u0432\u0440\u0435\u043C\u0435\u043D \u043F\u043E\u0447\u0438\u0449\u0435\u2026\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n\u0412 \u043A\u043E\u043C\u043D\u0430\u0442\u0435 \u0431\u044B\u043B\u043E \u0445\u043E\u043B\u043E\u0434\u043D\u043E. \u041D\u0430 \u0441\u0442\u043E\u043B\u0435 \u043F\u0435\u0440\u0435\u0434 \u0410\u0448\u0435\u0440\u043E\u043C \u043B\u0435\u0436\u0430\u043B\u0430 \u043A\u043D\u0438\u0433\u0430 \u043E \u041C\u0430\u0440\u043E\u043A\u043A\u043E. \u041E\u0442\u043A\u0440\u044B\u0442\u0430\u044F \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435 \u043F\u043E\u0441\u0432\u044F\u0449\u0451\u043D\u043D\u043E\u0439 \u043A\u0440\u0430\u0441\u043E\u0442\u0430\u043C \u0410\u043B\u044C-\u041A\u0430\u0440\u0430\u0443\u0438\u043D\u0430 \u0438 \u0433\u043E\u0440\u043E\u0434\u0443, \u0433\u0434\u0435 \u043E\u043D \u043D\u0430\u0445\u043E\u0434\u0438\u043B\u0441\u044F.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u041A\u043E\u043C\u043D\u0430\u0442\u0430 \u0431\u044B\u043B\u0430 \u043E\u0447\u0435\u043D\u044C \u0432\u044B\u0441\u043E\u043A\u0430\u044F \u0438 \u043F\u0440\u043E\u0441\u0442\u043E\u0440\u043D\u0430\u044F. \u0412\u0441\u0435 \u0437\u0434\u0435\u0441\u044C \u0431\u044B\u043B\u043E \u0441\u0442\u0430\u0440\u0438\u043D\u043D\u043E\u0435 \u2014 \u043F\u044B\u0448\u043D\u043E\u0435, \u043D\u0435\u0443\u0434\u043E\u0431\u043D\u043E\u0435 \u0438 \u043E\u0431\u0432\u0435\u0442\u0448\u0430\u043B\u043E\u0435. \u0410\u0448\u0435\u0440 \u0441\u0438\u0434\u0435\u043B \u0432 \u043A\u0440\u0435\u0441\u043B\u0435 \u043C\u0435\u0436\u0434\u0443 \u0434\u0432\u0443\u043C\u044F \u043A\u0430\u0440\u0442\u0438\u043D\u0430\u043C\u0438, \u043D\u0430 \u043E\u0434\u043D\u043E\u0439 \u0431\u044B\u043B \u043D\u0430\u0440\u0438\u0441\u043E\u0432\u0430\u043D \u0430\u043B\u043C\u0430\u0437, \u0433\u043E\u0441\u0442\u0438\u0432\u0448\u0438\u0439 \u0440\u044F\u0434\u043E\u043C \u0441 \u043A\u0430\u0440\u0442\u0438\u043D\u043E\u0439 \u0441\u0442\u0430\u0440\u043E\u0433\u043E \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E\u0433\u043E \u043C\u043D\u0435 \u0441\u0442\u0430\u0440\u0438\u043A\u0430. \u0412\u044B\u043F\u0440\u0430\u0432\u043A\u043E\u0439, \u043E\u043D \u043D\u0430\u043F\u043E\u043C\u0438\u043D\u0430\u043B \u043C\u043D\u0435, \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430, \u043E\u0442\u0434\u0430\u0432\u0448\u0435\u0433\u043E \u0430\u0440\u043C\u0438\u0438 \u043A\u0443\u0447\u0443 \u0432\u0440\u0435\u043C\u0435\u043D\u0438.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\u041C\u043E\u0449\u043D\u044B\u0439 \u043F\u043E\u0440\u044B\u0432 \u0432\u0435\u0442\u0440\u0430 \u0440\u0430\u0441\u043F\u0430\u0445\u0438\u0432\u0430\u0435\u0442 \u0442\u044F\u0436\u0451\u043B\u044B\u0435, \u0441\u0442\u0430\u0440\u0438\u043D\u043D\u044B\u0435 \u0434\u0432\u0435\u0440\u0438 \u0432 \u043A\u043E\u043C\u043D\u0430\u0442\u0443 \u2014 \u0437\u0430 \u043D\u0438\u043C\u0438 \u0432 \u043E\u043A\u0440\u043E\u0432\u0430\u0432\u043B\u0435\u043D\u043D\u043E\u043C \u0441\u0430\u0432\u0430\u043D\u0435 \u0441\u0442\u043E\u0438\u0442 \u043B\u0435\u0434\u0438 \u041C\u044D\u0434\u0438\u043B\u0435\u0439\u043D. \u041D\u0430 \u0448\u0435\u0435 \u0443 \u043D\u0435\u0435 \u0431\u043B\u0438\u0441\u0442\u0430\u043B\u0438 \u043A\u043E\u043B\u044C\u0435 \u0438 \u0431\u0443\u0441\u044B, \u043D\u043E \u0441 \u0434\u0440\u0443\u0433\u043E\u0439 \u0441\u0442\u043E\u0440\u043E\u043D\u044B \u0432 \u0437\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0441\u0442\u0435\u043A\u043B\u0430\u0445 \u043E\u043A\u043E\u043D \u043E\u0442\u0440\u0430\u0436\u0430\u043B\u0438\u0441\u044C \u043F\u0443\u0433\u0430\u044E\u0449\u0438\u0435 \u043F\u0430\u0443\u0442\u0438\u043D\u044B \u043C\u043E\u043B\u043D\u0438\u0438. \u042F \u0432 \u0443\u0436\u0430\u0441\u0435 \u043F\u043E\u0431\u0435\u0436\u0430\u043B \u043F\u0440\u043E\u0447\u044C \u0438\u0437 \u0437\u0430\u043C\u043A\u0430. \u0410 \u0435\u043B\u0435 \u0440\u0430\u0437\u043B\u0438\u0447\u0438\u043C\u0430\u044F \u0442\u0440\u0435\u0449\u0438\u043D\u0430 \u0432 \u0441\u0442\u0435\u043D\u0435 \u0434\u043E\u043C\u0430 \u0432\u0434\u0440\u0443\u0433 \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442 \u0440\u0430\u0441\u0448\u0438\u0440\u044F\u0442\u044C\u0441\u044F, \u0438 \u0441\u043A\u0432\u043E\u0437\u044C \u043D\u0435\u0451 \u043B\u0438\u043B\u0441\u044F \u0441\u0432\u0435\u0442 \u043B\u0443\u043D\u044B.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0435 \u0441\u0432\u043E\u0440\u0430\u0447\u0438\u0432\u0430\u044F \u043D\u0430 \u043D\u0430\u0431\u0435\u0440\u0435\u0436\u043D\u044B\u0439 \u043F\u0440\u043E\u0435\u0437\u0434, \u044F \u043D\u0435\u0441\u0441\u044F \u043F\u0440\u044F\u043C\u043E \u0447\u0435\u0440\u0435\u0437 \u0421\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u043C\u043E\u0441\u0442... \u041A\u041E\u0428\u0415\u043B\u0435\u043A \u0432\u044B\u043F\u0430\u043B \u0438\u0437 \u043A\u0430\u0440\u043C\u0430\u043D\u0430. \u0412\u041E\u0419 \u0437\u0432\u0443\u0447\u0430\u043B \u0441\u043E\u0432\u0441\u0435\u043C \u0440\u044F\u0434\u043E\u043C... \u0417\u0430\u0442\u0435\u043C \u0440\u0430\u0437\u0434\u0430\u043B\u0441\u044F \u0434\u0438\u043A\u0438\u0439 \u043E\u0433\u043B\u0443\u0448\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0439 \u0433\u0440\u043E\u0445\u043E\u0442, \u0441\u043B\u043E\u0432\u043D\u043E \u0440\u0451\u0432 \u0442\u044B\u0441\u044F\u0447\u0438 \u0432\u043E\u0434\u043E\u043F\u0430\u0434\u043E\u0432... \u0438 \u0433\u043B\u0443\u0431\u043E\u043A\u0438\u0435 \u0432\u043E\u0434\u044B \u0437\u043B\u043E\u0432\u0435\u0449\u0435\u0433\u043E \u043E\u0437\u0435\u0440\u0430 \u0431\u0435\u0437\u043C\u043E\u043B\u0432\u043D\u043E \u0438 \u0443\u0433\u0440\u044E\u043C\u043E \u0441\u043E\u043C\u043A\u043D\u0443\u043B\u0438\u0441\u044C \u043D\u0430\u0434 \u043E\u0431\u043B\u043E\u043C\u043A\u0430\u043C\u0438 \u0434\u043E\u043C\u0430 \u0410\u0448\u0435\u0440\u043E\u0432.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0442\u043E\u044F\u043D\u043A\u0430 \u043D\u0430 \u041E\u043B\u0435\u0433\u0430 \u041A\u043E\u0448\u0435\u0432\u043E\u0433\u043E, \u043E\u043A\u043E\u043B\u043E \u043C\u043E\u0441\u0442\u0430 \u0441\u043E\u0435\u0434\u0438\u043D\u044F\u044E\u0449\u0435\u0433\u043E \u0443\u043B\u0438\u0446\u044B \u041A\u043E\u043B\u044C\u0431\u0443\u0441\u0430 \u0438 \u041A\u043E\u0448\u0435\u0432\u043E\u0433\u043E.
TASK_CODE_7=A4N2G9