#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="\u041F\u0430\u0440\u0430\u0437\u0438\u0442\u044B"\n\n\u041E\u0431\u044B\u0447\u043D\u043E\u0435 \u043A\u043E\u0440\u0435\u0439\u0441\u043A\u043E\u0435 \u0441\u0435\u043C\u0435\u0439\u0441\u0442\u0432\u043E \u041A\u0438\u043C\u043E\u0432 \u0436\u0438\u0437\u043D\u044C \u043D\u0435 \u0431\u0430\u043B\u0443\u0435\u0442. \u041F\u0440\u0438\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0436\u0438\u0442\u044C \u0432 \u0441\u044B\u0440\u043E\u043C \u0433\u0440\u044F\u0437\u043D\u043E\u043C \u043F\u043E\u043B\u0443\u043F\u043E\u0434\u0432\u0430\u043B\u0435, \u0432\u043E\u0440\u043E\u0432\u0430\u0442\u044C \u0438\u043D\u0442\u0435\u0440\u043D\u0435\u0442 \u0443 \u0441\u043E\u0441\u0435\u0434\u0435\u0439 \u0438 \u043F\u0435\u0440\u0435\u0431\u0438\u0432\u0430\u0442\u044C\u0441\u044F \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u044B\u043C\u0438 \u043F\u043E\u0434\u0440\u0430\u0431\u043E\u0442\u043A\u0430\u043C\u0438. \u041E\u0434\u043D\u0430\u0436\u0434\u044B \u0434\u0440\u0443\u0433 \u0441\u044B\u043D\u0430 \u0441\u0435\u043C\u0435\u0439\u0441\u0442\u0432\u0430, \u0443\u0435\u0437\u0436\u0430\u044F \u043D\u0430 \u0441\u0442\u0430\u0436\u0438\u0440\u043E\u0432\u043A\u0443 \u0437\u0430 \u0433\u0440\u0430\u043D\u0438\u0446\u0443, \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u0442 \u0442\u043E\u043C\u0443 \u0437\u0430\u043C\u0435\u043D\u0438\u0442\u044C \u0435\u0433\u043E \u0438 \u043F\u043E\u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0440\u0435\u043F\u0435\u0442\u0438\u0442\u043E\u0440\u043E\u043C \u0443 \u0441\u0442\u0430\u0440\u0448\u0435\u043A\u043B\u0430\u0441\u0441\u043D\u0438\u0446\u044B \u0432 \u0431\u043E\u0433\u0430\u0442\u043E\u0439 \u0441\u0435\u043C\u044C\u0435 \u041F\u0430\u043A. \u041F\u043E\u0434\u0434\u0435\u043B\u0430\u0432 \u0434\u0438\u043F\u043B\u043E\u043C \u043E \u0432\u044B\u0441\u0448\u0435\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u0438, \u043F\u0430\u0440\u0435\u043D\u044C \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432 \u0448\u0438\u043A\u0430\u0440\u043D\u044B\u0439 \u0434\u0438\u0437\u0430\u0439\u043D\u0435\u0440\u0441\u043A\u0438\u0439 \u043E\u0441\u043E\u0431\u043D\u044F\u043A \u0438 \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u0438\u0442 \u043D\u0430 \u0445\u043E\u0437\u044F\u0439\u043A\u0443 \u0434\u043E\u043C\u0430 \u0445\u043E\u0440\u043E\u0448\u0435\u0435 \u0432\u043F\u0435\u0447\u0430\u0442\u043B\u0435\u043D\u0438\u0435. \u0422\u0443\u0442 \u0436\u0435 \u0435\u043C\u0443 \u0432 \u0433\u043E\u043B\u043E\u0432\u0443 \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442 \u043D\u0435\u043E\u0431\u044B\u0447\u043D\u044B\u0439 \u043F\u043B\u0430\u043D \u043F\u043E \u0442\u0440\u0443\u0434\u043E\u0443\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u0443 \u0441\u0435\u0441\u0442\u0440\u044B.
START_CODE=pr
START_DATE=07-11-2020
START_TIME=22-00
FIRST_HINT_TIMER=20
SECOND_HINT_TIMER=20
END_TASK_TIMER=20
BONUS_TASK_TIMER=40
BONUS_TASK_TIME=30
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u041A\u0438 \u0423 \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u0442 \u0441\u043E\u0431\u0435\u0441\u0435\u0434\u043E\u0432\u0430\u043D\u0438\u0435 \u0432 \u043E\u0441\u043E\u0431\u043D\u044F\u043A\u0435 \u0441\u0435\u043C\u044C\u0438 \u041F\u0430\u043A. \u041F\u043E \u043F\u0440\u0438\u0431\u044B\u0442\u0438\u0438 \u0443 \u043D\u0435\u0433\u043E \u0441\u043E\u0441\u0442\u043E\u044F\u043B\u0441\u044F \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440 \u0441 \u044D\u043A\u043E\u043D\u043E\u043C\u0438\u043A\u043E\u0439:\n- \u041A\u0440\u0430\u0441\u0438\u0432\u044B\u0439 \u0443 \u0432\u0430\u0441 \u0441\u0430\u0434.\n- \u0418 \u0432 \u0434\u043E\u043C\u0435 \u043D\u0435\u043F\u043B\u043E\u0445\u043E! \u0421\u043B\u044B\u0448\u0430\u043B\u0438 \u043F\u0440\u043E \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u043E\u0440\u0430 \u041D\u0430\u043C \u0413\u0443\u043D\u0430? \u041B\u0435\u0433\u0435\u043D\u0434\u0430\u0440\u043D\u044B\u0439 \u0431\u044B\u043B \u0447\u0435\u043B\u043E\u0432\u0435\u043A.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1,1+
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n- \u041E \u0442\u0430\u043B\u0430\u043D\u0442\u0430\u0445 \u044D\u0442\u043E\u0433\u043E \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u043E\u0440\u0430 \u0445\u043E\u0434\u0438\u043B\u0438 \u043B\u0435\u0433\u0435\u043D\u0434\u044B. \u041F\u043E\u043C\u043D\u044E \u043F\u0440\u0435\u043A\u0440\u0430\u0441\u043D\u044B\u0435 \u043B\u0435\u0442\u043D\u0438\u0435 \u0432\u0435\u0447\u0435\u0440\u0430 \u0432 \u0430\u043C\u0444\u0438\u0442\u0435\u0430\u0442\u0440\u0435 \u0440\u0443\u043A\u0438 \u044D\u0442\u043E\u0433\u043E \u0433\u0435\u043D\u0438\u044F.
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0440. \u041A\u043E\u0441\u0442\u0430, \u0420\u0435\u0441\u0442\u043E\u0440\u0430\u043D "\u041B\u0435\u0433\u0435\u043D\u0434\u0430"
TASK_CODE_1=2GO1S9
HINT_CODE_1=T7SDFE212G7SD
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u2026\u0432\u044B \u041A\u043E\u043D\u0435\u0447\u043D\u043E \u0437\u043D\u0430\u0435\u0442\u0435, \u0432\u0430\u0448 \u0434\u0440\u0443\u0433 \u0442\u0430\u043A\u043E\u0439 \u0438\u043D\u0442\u0435\u043B\u043B\u0438\u0433\u0435\u043D\u0442\u043D\u044B\u0439 \u043C\u043E\u043B\u043E\u0434\u043E\u0439 \u0447\u0435\u043B\u043E\u0432\u0435\u043A, \u0432 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0435 \u0432\u0440\u0435\u043C\u044F \u043E\u043D \u0431\u044B\u043B \u0432\u0435\u0441\u044C\u043C\u0430 \u0443\u0432\u043B\u0435\u0447\u0435\u043D \u0438\u0441\u0442\u043E\u0440\u0438\u0435\u0439, \u0438 \u0442\u0443\u0442 \u0435\u0449\u0451 \u0432\u043C\u0435\u0448\u0430\u043B\u0430\u0441\u044C \u044D\u0442\u0430 \u0437\u0430\u0433\u0440\u0430\u043D\u0438\u0447\u043D\u0430\u044F \u041F\u043E\u0435\u0437\u0434\u043A\u0430\u2026\u043E\u0431\u043C\u043E\u043B\u0432\u0438\u043B\u0441\u044F \u043D\u0430 \u043F\u0440\u043E\u0449\u0430\u043D\u0438\u0435 - \u0440\u0435\u0447\u044C \u041F\u043E\u0441\u043F\u043E\u043B\u0438\u0442\u0430\u044F...\u0432 \u0441\u0442\u043E\u043B\u0438\u0446\u0443 \u043E\u0434\u043D\u043E\u0439 \u0438\u0437 \u0441\u0442\u0440\u0430\u043D, \u043A\u0430\u0436\u0435\u0442\u0441\u044F.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0412\u0441\u043F\u043E\u043C\u043D\u0438\u043B\u0430, \u044D\u0442\u043E, \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C, \u0441\u0442\u043E\u043B\u0438\u0446\u0430 \u041B\u0438\u0442\u0432\u044B. \u041F\u0440\u0430\u0432\u0434\u0430 \u0441 \u0433\u043E\u0441\u0442\u0438\u043D\u0438\u0446\u0435\u0439 \u043D\u0435 \u043F\u043E\u0432\u0435\u0437\u043B\u043E, \u0432 \u043F\u0440\u043E\u043C\u044B\u0448\u043B\u0435\u043D\u043D\u043E\u043C \u0440\u0430\u0439\u043E\u043D\u0435.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n6-\u044F \u041F\u0440\u043E\u043C\u044B\u0448\u043B\u0435\u043D\u043D\u0430\u044F/\u0427\u0435\u0440\u043C\u0435\u043D\u0441\u043A\u043E\u0435 \u0428\u043E\u0441\u0441\u0435, \u041A\u041F\u041F \u0412\u0438\u043B\u044C\u043D\u044E\u0441
TASK_CODE_2=I942S3
HINT_CODE_2=J351Zdg452achhfw
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u041B\u0438\u0432\u0435\u043D\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0443\u0441\u0438\u043B\u0438\u0432\u0430\u043B\u0441\u044F. \u0421\u0431\u0435\u0436\u0430\u0432 \u0438\u0437 \u0434\u043E\u043C\u0430 \u0431\u043E\u0433\u0430\u0447\u0435\u0439, \u0441\u0435\u043C\u044C\u044F \u043F\u0430\u0440\u0430\u0437\u0438\u0442\u043E\u0432 \u0434\u043E\u043B\u0433\u043E \u0434\u043E\u0431\u0438\u0440\u0430\u043B\u0430\u0441\u044C \u0434\u043E \u0441\u0432\u043E\u0435\u0433\u043E \u0436\u0438\u043B\u0438\u0449\u0430. \u041C\u0438\u043A\u0440\u043E\u0440\u0430\u0439\u043E\u043D \u043D\u0430 \u043E\u0442\u0448\u0438\u0431\u0435 \u0433\u043E\u0440\u043E\u0434\u0430 \u0441\u0438\u043B\u044C\u043D\u043E \u0437\u0430\u0442\u0430\u043F\u043B\u0438\u0432\u0430\u043B\u043E \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0434\u043E\u0436\u0434\u044F. \u041E\u0442\u0433\u043E\u043B\u043E\u0441\u043A\u0438 \u0440\u0430\u0434\u0438\u043E \u0432\u0435\u0449\u0430\u043B\u0438 \u043E 65 \u0441\u0430\u043D\u0442\u0438\u043C\u0435\u0442\u0440\u0430\u0445 \u043E\u0441\u0430\u0434\u043A\u043E\u0432. \u0422\u0440\u0438\u043A\u043E\u043B\u043E\u0440 \u043D\u0430 \u0441\u043E\u0441\u0435\u0434\u043D\u0435\u043C \u0434\u043E\u043C\u0435 \u0441\u043E\u0432\u0441\u0435\u043C \u043F\u043E\u043D\u0438\u043A.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+,1+\n\u041C\u0410\u041A\u0421\u0418\u041C\u0410\u041B\u042C\u041D\u0410\u042F \u0422\u0418\u0428\u0418\u041D\u0410
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0435\u043F\u043E\u0434\u0430\u043B\u0435\u043A\u0443 \u043E\u0442 \u0438\u0445 \u043F\u043E\u0434\u0432\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u0436\u0438\u043B\u044C\u044F \u0440\u0430\u0437\u0432\u0435\u0440\u043D\u0443\u043B\u0441\u044F \u043A\u0440\u0443\u043F\u043D\u0435\u0439\u0448\u0438\u0439 \u0440\u044B\u043D\u043E\u043A \u044D\u0442\u043E\u0433\u043E \u0433\u043E\u0440\u043E\u0434\u0430.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0412\u043B\u0430\u0434\u0438\u043A\u0430\u0432\u043A\u0430\u0437\u0441\u043A\u0430\u044F 65, \u043F\u043E\u0434\u0432\u0430\u043B \u043D\u0435\u0434\u043E\u0441\u0442\u0440\u043E\u044F.
TASK_CODE_3=30I4G9
HINT_CODE_3=JZ85s5dfs3whm732dxu
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u0436\u0430\u0440\u0441\u043A\u0438\u0439 \u041C\u043E\u0441\u0442, \u0441\u044A\u0435\u0437\u0434 \u043D\u0430 \u043F\u0443\u0442\u0438 \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u0446\u0435\u043D\u0442\u0440\u0430 \u0433\u043E\u0440\u043E\u0434\u0430.
TASK_CODE_4=20G2IO
HINT_CODE_4=129JZs5sf2dx8
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n(\u0410\u0433\u0435\u043D\u0442)\n- \u0422\u043E\u0447\u043D\u043E, \u043E\u043D\u0430 \u0436\u0438\u0432\u0435\u0442 \u0432 \u044D\u0442\u043E\u043C \u0434\u043E\u043C\u0435 \u0434\u043E\u043B\u044C\u0448\u0435, \u0447\u0435\u043C \u0432\u0441\u0435 \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0435. \u041E\u043D\u0430 \u0431\u044B\u043B\u0430 \u044D\u043A\u043E\u043D\u043E\u043C\u043A\u043E\u0439 \u0435\u0449\u0435 \u043F\u0440\u0438 \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u043E\u0440\u0435 \u041D\u0430\u043C \u0413\u0443\u043D\u0435. \u041A\u043E\u0433\u0434\u0430 \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u043E\u0440 \u043F\u0435\u0440\u0435\u0435\u0437\u0436\u0430\u043B, \u043E\u043D \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u043B \u0435\u0451 \u0441\u0435\u043C\u044C\u0435 \u041F\u0430\u043A \u0438 \u0441\u043A\u0430\u0437\u0430\u043B: \u201C\u042D\u0442\u043E \u043D\u0430\u0448\u0430 \u043B\u044E\u0431\u0438\u043C\u0430\u044F \u044D\u043A\u043E\u043D\u043E\u043C\u043A\u0430, \u0432\u043E\u0437\u044C\u043C\u0438\u0442\u0435 \u0435\u0451 \u0441\u0435\u0431\u0435, \u043D\u0435 \u043F\u043E\u0436\u0430\u043B\u0435\u0435\u0442\u0435\u201D\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0421\u043E \u0432\u0441\u0435\u043C\u0438 \u043F\u0440\u0435\u0434\u044B\u0434\u0443\u0449\u0438\u043C\u0438 \u0445\u043E\u0437\u044F\u0435\u0432\u0430\u043C\u0438 \u043E\u043D\u0430 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u043B\u0430 \u0442\u0435\u043F\u043B\u044B\u0435 \u043E\u0442\u043D\u043E\u0448\u0435\u043D\u0438\u044F \u0438 \u0434\u0440\u0443\u0436\u0431\u0443.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0422 \u0414\u0440\u0443\u0436\u0431\u0430, \u0423\u043B\u0438\u0446\u0430 \u041B\u044E\u0431\u0438\u043C\u0430\u044F
TASK_CODE_5=91SG52
HINT_CODE_5=25JZ7e6c2kv29gsl8
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u041F\u043E\u0441\u043B\u0435 \u0443\u0434\u0430\u0447\u043D\u043E\u0439 \u0440\u0435\u043A\u043E\u043C\u0435\u043D\u0434\u0430\u0446\u0438\u0438 \u041A\u0438 \u0422\u0435\u043A \u043F\u043E\u043B\u0443\u0447\u0438\u043B \u0437\u0430\u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0435 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \u043E\u0442 \u0441\u0432\u043E\u0435\u0433\u043E \u0441\u044B\u043D\u0430 \u041A\u0438 \u0423 \u0441 \u043C\u0435\u0441\u0442\u043E\u043C, \u043E\u0442\u043A\u0443\u0434\u0430 \u043D\u0443\u0436\u043D\u043E \u0437\u0430\u0431\u0440\u0430\u0442\u044C \u0433\u043E\u0441\u043F\u043E\u0434\u0438\u043D\u0430 \u041F\u0430\u043A\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+,2
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u043E\u0441\u043B\u0435 \u043A\u0440\u0443\u0442\u043E\u0433\u043E \u043F\u043E\u0432\u043E\u0440\u043E\u0442\u0430, \u0413\u043E\u0441\u043F\u043E\u0434\u0438\u043D \u041F\u0430\u043A \u0443\u0432\u0438\u0434\u0435\u043B \u0432 \u0441\u0432\u043E\u0435\u0439 \u0447\u0430\u0448\u043A\u0435 \u043A\u043E\u0444\u0435 \u0432\u0435\u0441\u044C\u043C\u0430 \u201C\u0412\u044B\u0434\u0430\u044E\u0449\u0438\u0439\u0441\u044F\u201D \u043E\u0442\u0435\u043B\u044C.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0411\u0440\u043E\u0448\u0435\u043D\u043D\u043E\u0435 \u0431\u0435\u043B\u043E\u0435 \u0437\u0434\u0430\u043D\u0438\u0435 \u0437\u0430 \u043E\u0442\u0435\u043B\u0435\u043C \u041D\u0430\u0440\u0442\u043E\u043D, 3 \u043F\u043E \u0441\u0447\u0435\u0442\u0443 \u043E\u0442 \u0434\u043E\u0440\u043E\u0433\u0438.
TASK_CODE_6=I826S1
HINT_CODE_6=48J2Zdg5ya9qm8fxs4d
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n(\u0410\u0433\u0435\u043D\u0442)\n\u041F\u043E\u0441\u043B\u0435 \u0442\u0440\u0430\u0433\u0435\u0434\u0438\u0438 \u0432 \u0434\u043E\u043C\u0435 \u041F\u0430\u043A, \u0437\u0434\u0430\u043D\u0438\u0435 \u0434\u043E\u043B\u0433\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u043F\u0443\u0441\u0442\u043E\u0432\u0430\u043B\u043E, \u0434\u043E\u0436\u0438\u0434\u0430\u044F\u0441\u044C \u043D\u043E\u0432\u044B\u0445 \u0432\u043B\u0430\u0434\u0435\u043B\u044C\u0446\u0435\u0432. \u0420\u0438\u044D\u043B\u0442\u043E\u0440\u044B \u0441\u0442\u0430\u0440\u0430\u043B\u0438\u0441\u044C \u0438\u0437\u043E \u0432\u0441\u0435\u0445 \u0441\u0438\u043B. \u041A\u0440\u0430\u0441\u0438\u0432\u0430\u044F \u0430\u0440\u0445\u0438\u0442\u0435\u043A\u0442\u0443\u0440\u0430, \u0441\u0432\u0435\u0436\u0438\u0439 \u0413\u043E\u0440\u043D\u044B\u0439 \u0432\u043E\u0437\u0434\u0443\u0445, \u043C\u0435\u0441\u0442\u0430 \u0434\u043B\u044F \u043F\u0440\u043E\u0433\u0443\u043B\u043E\u043A \u0438 \u0442\u0440\u0435\u043D\u0438\u0440\u043E\u0432\u043E\u043A \u2013 \u0443 \u044D\u0442\u043E\u0433\u043E \u043C\u0435\u0441\u0442\u0430 \u0431\u044B\u043B\u0430 \u043C\u0430\u0441\u0441\u0430 \u043F\u0440\u0435\u0438\u043C\u0443\u0449\u0435\u0441\u0442\u0432.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442 (3)
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0410 \u043A\u043E\u043D\u043D\u044B\u0435 \u043F\u0440\u043E\u0433\u0443\u043B\u043A\u0438 \u0432 \u041B\u0435\u0441\u0443 \u043E\u0441\u0442\u0430\u0432\u043B\u044F\u043B\u0438 \u043D\u0435\u0438\u0437\u0433\u043B\u0430\u0434\u0438\u043C\u043E\u0435 \u0432\u043F\u0435\u0447\u0430\u0442\u043B\u0435\u043D\u0438\u0435.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041C\u043E\u0441\u0442 \u043D\u0430 \u0421\u0430\u043F\u0438\u0446\u043A\u043E\u0439 \u0433\u043E\u0440\u0435. 43.014, 44.710
TASK_CODE_7=1G735I
HINT_CODE_7=J731Zde3uv21bd78dy6hd5
BONUS_TASK=\u0411\u043E\u043D\u0443\u0441\u043D\u043E\u0435 \u0437\u0430\u0434\u0430\u043D\u0438\u0435\n
BONUS_CODE=CV4dfetw142
BONUS_FIVE_MINUTES=KKGR8234F5AV3BN4SDA
BONUS_TEN_MINUTES=KfK5FH55Vhr5DDF
BONUS_FIFTEEN_MINUTES=Ou6dgt6wcx6itq6sre