#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="\u0417\u0430\u043B\u043E\u0436\u043D\u0438\u0446\u0430."\n\n\u00AB\u041E\u043D\u0438 \u0437\u0430\u0431\u0440\u0430\u043B\u0438 \u0435\u0433\u043E \u0434\u043E\u0447\u044C. \u041E\u043D \u0437\u0430\u0431\u0435\u0440\u0451\u0442 \u0438\u0445 \u0436\u0438\u0437\u043D\u0438\u00BB. \u0413\u043E\u0442\u043E\u0432\u044B \u043F\u043E\u043C\u043E\u0447\u044C? \u0422\u043E\u0433\u0434\u0430 \u0441\u043E\u0431\u0438\u0440\u0430\u0435\u0442\u0435\u0441\u044C, \u043C\u044B \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u043C!
START_CODE=hs
START_DATE=08-06-2019
START_TIME=22-00
FIRST_HINT_TIMER=25
SECOND_HINT_TIMER=15
END_TASK_TIMER=20
BONUS_TASK_TIMER=40
BONUS_TASK_TIME=30
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0410\u0433\u0435\u043D\u0442)\n\u041E\u0442\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u0430\u0433\u0435\u043D\u0442 \u0426\u0420\u0423 \u0411\u0440\u0430\u0439\u0430\u043D \u041C\u0438\u043B\u043B\u0441 \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u0438\u043C\u0438 \u043A\u043E\u043C\u043F\u0430\u043D\u044C\u043E\u043D\u0430\u043C\u0438 \u0437\u0430\u043D\u044F\u0442 \u0432 \u0441\u0444\u0435\u0440\u0435 \u0447\u0430\u0441\u0442\u043D\u043E\u0439 \u043E\u0445\u0440\u0430\u043D\u043D\u043E\u0439 \u0434\u0435\u044F\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438 \u0438 \u0432\u044B\u043F\u043E\u043B\u043D\u044F\u0435\u0442 \u043F\u043E \u043A\u0440\u0430\u0442\u043A\u043E\u0441\u0440\u043E\u0447\u043D\u044B\u043C \u043A\u043E\u043D\u0442\u0440\u0430\u043A\u0442\u0430\u043C \u043C\u0435\u0440\u043E\u043F\u0440\u0438\u044F\u0442\u0438\u044F \u043F\u043E \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D\u0438\u044E \u0431\u0435\u0437\u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u043A\u0440\u0443\u043F\u043D\u044B\u0445 \u043A\u043E\u043D\u0446\u0435\u0440\u0442\u043E\u0432 \u0441 \u0443\u0447\u0430\u0441\u0442\u0438\u0435\u043C \u0437\u0432\u0451\u0437\u0434 \u043C\u0435\u0436\u0434\u0443\u043D\u0430\u0440\u043E\u0434\u043D\u043E\u0439 \u0432\u0435\u043B\u0438\u0447\u0438\u043D\u044B. \u0412 \u043E\u0434\u043D\u043E\u0439 \u0438\u0437 \u0442\u0430\u043A\u0438\u0445 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0439 \u0411\u0440\u0430\u0439\u0430\u043D \u0441\u043F\u0430\u0441\u0430\u0435\u0442 \u0436\u0438\u0437\u043D\u044C \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E\u0439 \u043F\u043E\u043F-\u043F\u0435\u0432\u0438\u0446\u044B \u0428\u0438\u0440\u044B, \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u043F\u044B\u0442\u0430\u043B\u0441\u044F \u0437\u0430\u0440\u0435\u0437\u0430\u0442\u044C \u0431\u0435\u0437\u0443\u043C\u043D\u044B\u0439 \u043F\u043E\u043A\u043B\u043E\u043D\u043D\u0438\u043A. \u0414\u043E\u0447\u044C \u0411\u0440\u0430\u0439\u0430\u043D\u0430 \u041A\u0438\u043C \u043C\u0435\u0447\u0442\u0430\u0435\u0442 \u0441\u0442\u0430\u0442\u044C \u043F\u0435\u0432\u0438\u0446\u0435\u0439, \u043E \u0447\u0451\u043C \u0441\u043A\u0430\u0437\u0430\u043B\u0430 \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0442\u0446\u0443, \u043E\u043D \u0434\u0435\u043B\u0438\u0442\u0441\u044F \u0441 \u0428\u0438\u0440\u043E\u0439 \u044D\u0442\u043E\u0439 \u0438\u0441\u0442\u043E\u0440\u0438\u0435\u0439. \u041D\u043E \u0434\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u043C\u0443\u0437\u044B\u043A\u0430\u043B\u044C\u043D\u043E\u0435 \u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u0435, \u043D\u0430 \u0437\u0430\u0440\u0435 \u0441\u0432\u043E\u0435\u0433\u043E \u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044F \u0432\u0441\u0435 \u043F\u0435\u0432\u0446\u044B \u043F\u0440\u043E\u0445\u043E\u0434\u044F\u0442 \u0447\u0435\u0440\u0435\u0437 \u044D\u0442\u043E, \u0438 \u0428\u0438\u0440\u0430 \u0434\u0430\u0440\u0438\u0442 \u0411\u0440\u0430\u0439\u0430\u043D\u0443 \u0442\u0435\u043B\u0435\u0444\u043E\u043D \u0441\u0432\u043E\u0435\u0433\u043E \u0443\u0447\u0438\u0442\u0435\u043B\u044F \u0432\u043E\u043A\u0430\u043B\u0430 \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0431\u043B\u0430\u0433\u043E\u0434\u0430\u0440\u043D\u043E\u0441\u0442\u0438 \u0437\u0430 \u0441\u043F\u0430\u0441\u0435\u043D\u0438\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0412 \u044E\u043D\u043E\u0441\u0442\u0438, \u043D\u0430 \u0437\u0430\u0440\u0435 \u043C\u043D\u043E\u0433\u0438\u0435 \u043C\u0435\u0447\u0442\u0430\u044E\u0442 \u0441\u0442\u0430\u0442\u044C \u0430\u0440\u0442\u0438\u0441\u0442\u0430\u043C\u0438, \u0434\u0430 \u0438 \u0432\u043E\u0432\u0441\u0435 \u0431\u044B\u0442\u044C \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u043C\u0438, \u043D\u043E \u0438\u0441\u043A\u0443\u0441\u0441\u0442\u0432\u043E \u0441\u0430\u043C\u043E \u043F\u043E \u0441\u0435\u0431\u0435 \u043D\u0435 \u043F\u0440\u0438\u043D\u043E\u0441\u0438\u0442 \u0441\u043B\u0430\u0432\u0443, \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u043C\u043D\u043E\u0433\u043E \u0443\u0447\u0438\u0442\u044C\u0441\u044F, \u0447\u0442\u043E\u0431\u044B \u0434\u043E\u0441\u0442\u0438\u0447\u044C \u0432\u044B\u0441\u043E\u0442. \u0411\u0440\u0430\u0439\u0430\u043D \u0445\u043E\u0442\u0435\u043B \u043B\u044E\u0431\u044B\u043C \u0441\u043F\u043E\u0441\u043E\u0431\u043E\u043C \u0443\u0433\u043E\u0434\u0438\u0442\u044C \u0434\u043E\u0447\u0435\u0440\u0438. \u0418 \u0441\u0447\u0438\u0442\u0430\u043B \u044D\u0442\u043E \u043E\u0442\u043B\u0438\u0447\u043D\u044B\u043C \u043F\u043E\u0434\u0430\u0440\u043A\u043E\u043C.
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0435\u0440\u0435\u0443\u043B\u043E\u043A \u0417\u0430\u0440\u044F \u0440\u044F\u0434\u043E\u043C \u0441 \u043C\u0443\u0437\u044B\u043A\u0430\u043B\u044C\u043D\u044B\u043C \u0443\u0447\u0438\u043B\u0438\u0449\u0435\u043C.
TASK_CODE_1=\u04102\u041A469
HINT_CODE_1=T7SDFE212G7SD
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u0411\u0440\u0430\u0439\u0430\u043D \u0440\u0435\u0448\u0430\u0435\u0442 \u0443\u0436\u0435 \u043D\u0430 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0439 \u0434\u0435\u043D\u044C \u043E\u0442\u0434\u0430\u0442\u044C \u043F\u043E\u0434\u0430\u0440\u043E\u043A \u041A\u0438\u043C, \u043D\u043E \u0442\u0430 \u043D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E \u043F\u0440\u043E\u0441\u0438\u0442 \u043E\u0442\u0446\u0430 \u043F\u043E\u0434\u043F\u0438\u0441\u0430\u0442\u044C \u0434\u043B\u044F \u043D\u0435\u0451 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u043D\u0430 \u0442\u0443\u0440\u0438\u0441\u0442\u0438\u0447\u0435\u0441\u043A\u0443\u044E \u043F\u043E\u0435\u0437\u0434\u043A\u0443 \u0432 \u0430\u0432\u0433\u0443\u0441\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0438\u043A\u0443\u043B\u044B \u0441 \u043F\u043E\u0434\u0440\u0443\u0433\u043E\u0439 \u0432 \u041F\u0430\u0440\u0438\u0436. \u041E\u043D \u043A\u043E\u043D\u0435\u0447\u043D\u043E \u043F\u0440\u043E\u0442\u0438\u0432 \u044D\u0442\u043E\u0433\u043E. \u041D\u043E \u0432 \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044E \u0432\u043C\u0435\u0448\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0431\u044B\u0432\u0448\u0430\u044F \u0441\u0443\u043F\u0440\u0443\u0433\u0430 \u0411\u0440\u0430\u0439\u0430\u043D\u0430 \u041B\u0435\u043D\u043E\u0440, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0443\u0433\u043E\u0432\u0430\u0440\u0438\u0432\u0430\u0435\u0442 \u0435\u0433\u043E \u043E\u0442\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u0434\u043E\u0447\u044C, \u043C\u043E\u0442\u0438\u0432\u0438\u0440\u0443\u044F \u0442\u0435\u043C, \u0447\u0442\u043E \u043E\u043D\u0430 \u0443\u0436\u0435 \u0434\u043E\u0441\u0442\u0430\u0442\u043E\u0447\u043D\u043E \u0432\u0437\u0440\u043E\u0441\u043B\u0430\u044F, \u0438 \u0434\u043B\u044F \u041A\u0438\u043C \u044D\u0442\u043E \u043E\u0447\u0435\u043D\u044C \u0432\u0430\u0436\u043D\u043E\u0435 \u0441\u043E\u0431\u044B\u0442\u0438\u0435. \u0411\u0440\u0430\u0439\u0430\u043D \u043D\u0435\u043E\u0445\u043E\u0442\u043D\u043E \u0441\u043E\u0433\u043B\u0430\u0448\u0430\u0435\u0442\u0441\u044F, \u043F\u043E\u0441\u0442\u0430\u0432\u0438\u0432 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0443\u0441\u043B\u043E\u0432\u0438\u0439, \u043D\u043E \u0432 \u0438\u0442\u043E\u0433\u0435 \u0443\u0437\u043D\u0430\u0451\u0442, \u0447\u0442\u043E \u043D\u0430 \u0441\u0430\u043C\u043E\u043C \u0434\u0435\u043B\u0435 \u041A\u0438\u043C \u0438 \u0410\u043C\u0430\u043D\u0434\u0430 \u0441\u043E\u0431\u0438\u0440\u0430\u044E\u0442\u0441\u044F \u043F\u0443\u0442\u0435\u0448\u0435\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C \u043F\u043E \u0432\u0441\u0435\u0439 \u0415\u0432\u0440\u043E\u043F\u0435. \u041B\u0435\u043D\u043E\u0440 \u0437\u043D\u0430\u043B\u0430 \u043E\u0431 \u044D\u0442\u043E\u043C, \u043D\u043E \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0430\u043B\u0430 \u043B\u043E\u0436\u044C \u041A\u0438\u043C, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0441\u0447\u0438\u0442\u0430\u0435\u0442 \u0411\u0440\u0430\u0439\u0430\u043D\u0430 \u043F\u0430\u0440\u0430\u043D\u043E\u0438\u043A\u043E\u043C \u0438 \u044D\u0433\u043E\u0438\u0441\u0442\u043E\u043C \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u043B\u0435\u0447\u0435\u043D\u0438\u0435 \u0432 \u0434\u0438\u0441\u043F\u0430\u043D\u0441\u0435\u0440\u0435. \u041E\u0434\u043D\u0430\u043A\u043E \u0435\u0433\u043E \u043E\u043F\u0430\u0441\u0435\u043D\u0438\u044F \u0431\u044B\u043B\u0438 \u043D\u0435 \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u044B, \u043F\u043E\u0435\u0437\u0434\u043A\u0430 \u0440\u0435\u0437\u043A\u043E \u043F\u0440\u0435\u0432\u0440\u0430\u0449\u0430\u0435\u0442\u0441\u044F \u0432 \u043A\u043E\u0448\u043C\u0430\u0440: \u041A\u0438\u043C \u0438 \u0410\u043C\u0430\u043D\u0434\u0443 \u043F\u043E\u0445\u0438\u0449\u0430\u044E\u0442 5 \u0447\u0435\u043B\u043E\u0432\u0435\u043A \u043F\u0440\u044F\u043C\u043E \u0438\u0437 \u043E\u0431\u0449\u0435\u0436\u0438\u0442\u0438\u044F \u0433\u0434\u0435 \u043E\u043D\u0438 \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u043B\u0438\u0441\u044C.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u043E\u0445\u0438\u0442\u0438\u0432 \u0434\u0435\u0432\u043E\u0447\u0435\u043A \u0438\u0445 \u043F\u0440\u0438\u0432\u043E\u0437\u044F\u0442, \u043D\u0430 \u043A\u0430\u043A\u0443\u044E-\u0442\u043E \u0431\u0430\u0437\u0443 \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u043D\u0443\u044E \u043D\u0435\u043F\u043E\u0434\u0430\u043B\u0451\u043A\u0443 \u043E\u0442 \u0438\u043D\u0441\u0442\u0438\u0442\u0443\u0442\u0430 \u041A\u044E\u0440\u0438 \u0432 \u041F\u0430\u0440\u0438\u0436\u0435. \u0413\u0434\u0435 \u0434\u0435\u0432\u043E\u0447\u043A\u0430\u043C \u0432\u043A\u0430\u043B\u044B\u0432\u0430\u044E\u0442 \u043D\u0430\u0440\u043A\u043E\u0442\u0438\u043A\u0438, \u043E\u0434\u043D\u0430\u043A\u043E \u041A\u0438\u043C \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0438\u0437\u0431\u0435\u0436\u0430\u0442\u044C \u044D\u0442\u043E\u0439 \u0443\u0447\u0430\u0441\u0442\u0438.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041E\u0431\u0449\u0435\u0436\u0438\u0442\u0438\u0435 \u043D\u0430 \u0422\u0438\u0442\u043E\u0432\u0430 5 \u043C\u0435\u0436\u0434\u0443 \u043E\u043D\u043A\u043E\u0434\u0438\u0441\u043F\u0430\u043D\u0441\u0435\u0440\u043E\u043C \u0438 \u0443\u043B\u0438\u0446\u0435\u0439 \u0430\u0432\u0433\u0443\u0441\u0442\u043E\u0432\u0441\u043A\u0438\u0445 \u0441\u043E\u0431\u044B\u0442\u0438\u0439.
TASK_CODE_2=3\u04109\u041A14
HINT_CODE_2=J351Zdg452achhfw
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0423\u0441\u0442\u0440\u043E\u0438\u0432 \u0431\u043E\u0439\u043D\u044E \u0432 \u041F\u0430\u0440\u0438\u0436\u0435, \u0411\u0440\u0430\u0439\u0430\u043D \u0441\u043C\u043E\u0433 \u0432\u0441\u0435 \u0442\u0430\u043A\u0438 \u043E\u0441\u0432\u043E\u0431\u043E\u0434\u0438\u0442\u044C \u0441\u0432\u043E\u044E \u0434\u043E\u0447\u044C. \u041D\u043E \u0441\u043F\u0443\u0441\u0442\u044F \u043A\u0430\u043A\u043E\u0435-\u0442\u043E \u0432\u0440\u0435\u043C\u044F \u043E\u043D \u0432\u043D\u043E\u0432\u044C \u043F\u043E\u043F\u0430\u0434\u0430\u0435\u0442 \u0432 \u0442\u044F\u0436\u0451\u043B\u0443\u044E \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044E. \u041F\u0440\u0438\u0433\u043B\u0430\u0441\u0438\u0432 \u0441\u0435\u043C\u044C\u044E \u043D\u0430 \u043E\u0442\u0434\u044B\u0445 \u0432 \u0422\u0443\u0440\u0446\u0438\u044E, \u0435\u0433\u043E \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u0441\u0443\u043F\u0440\u0443\u0433\u043E\u0439 \u041B\u0435\u043D\u043E\u0440 \u043F\u043E\u0445\u0438\u0449\u0430\u0435\u0442 \u043E\u0442\u0435\u0446 \u043E\u0434\u043D\u043E\u0433\u043E \u0438\u0437 \u0443\u0431\u0438\u0442\u044B\u0445 \u0430\u043B\u0431\u0430\u043D\u0441\u043A\u0438\u0445 \u043C\u0430\u0444\u0438\u043E\u0437\u0438. \u041F\u043E\u043A\u0430 \u0438\u0445 \u043F\u0435\u0440\u0435\u0432\u043E\u0437\u0438\u043B\u0438 \u0432 \u043C\u0430\u0448\u0438\u043D\u0435 \u0411\u0440\u0430\u0439\u0430\u043D \u043E\u0442\u0441\u0447\u0438\u0442\u044B\u0432\u0430\u043B \u0432\u0440\u0435\u043C\u044F, \u0447\u0442\u043E\u0431\u044B \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0438\u0442\u044C \u0441\u0432\u043E\u0451 \u043C\u0435\u0441\u0442\u043E\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435, \u0434\u043E\u0441\u0447\u0438\u0442\u0430\u0432 \u0434\u043E 11 \u0430\u0432\u0442\u043E\u043C\u043E\u0431\u0438\u043B\u044C \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u043B\u0441\u044F \u043D\u0430 \u043F\u0435\u0440\u0435\u043A\u0440\u0451\u0441\u0442\u043A\u0435. \u0417\u0430\u043F\u0430\u0445 \u0433\u0430\u0437\u0430, \u0438 \u043D\u0430\u043A\u0438\u043D\u0443\u0442\u044B\u0435 \u043D\u0430 \u0433\u043E\u043B\u043E\u0432\u0443 \u043C\u0435\u0448\u043A\u0438 \u043D\u0435 \u0434\u0430\u0432\u0430\u043B\u0438 \u043D\u043E\u0440\u043C\u0430\u043B\u044C\u043D\u043E \u0434\u044B\u0448\u0430\u0442\u044C. \u041E\u043D \u043F\u043E\u043D\u0438\u043C\u0430\u043B, \u0447\u0442\u043E \u0432\u0440\u0435\u043C\u0435\u043D\u0438 \u043C\u0430\u043B\u043E \u0438 \u0435\u043C\u0443 \u0441\u0440\u043E\u0447\u043D\u043E \u043D\u0443\u0436\u043D\u043E \u0431\u044B\u043B\u043E \u0441\u0432\u044F\u0437\u0430\u0442\u044C\u0441\u044F \u0441 \u0434\u043E\u0447\u0435\u0440\u044C\u044E \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u043D\u0435 \u0441\u043C\u043E\u0433\u043B\u0438 \u0441\u0445\u0432\u0430\u0442\u0438\u0442\u044C. \u041A\u0438\u043C \u0443\u0441\u043B\u044B\u0448\u0430\u0432 \u0437\u0432\u043E\u043D\u043E\u043A \u043E\u0442 \u043E\u0442\u0446\u0430, \u043D\u0435\u043C\u043D\u043E\u0433\u043E \u0443\u0441\u043F\u043E\u043A\u043E\u0438\u043B\u0430\u0441\u044C, \u043E\u043D\u0430 \u0437\u043D\u0430\u043B\u0430, \u0447\u0442\u043E \u0442\u0435\u043F\u0435\u0440\u044C \u0435\u0439 \u043F\u0440\u0435\u0434\u0441\u0442\u043E\u044F\u043B\u043E \u043E\u0441\u0432\u043E\u0431\u043E\u0434\u0438\u0442\u044C \u0440\u043E\u0434\u0438\u0442\u0435\u043B\u0435\u0439, \u043D\u043E \u044D\u0442\u043E \u043E\u0447\u0435\u043D\u044C \u0434\u0435\u043B\u0438\u043A\u0430\u0442\u043D\u0430\u044F \u0437\u0430\u0434\u0430\u0447\u0430 \u0434\u043B\u044F \u0445\u0440\u0443\u043F\u043A\u043E\u0439 \u0434\u0435\u0432\u0443\u0448\u043A\u0438. \u0411\u0440\u0430\u0439\u0430\u043D \u043F\u043E\u043F\u0440\u043E\u0441\u0438\u043B \u041A\u0438\u043C \u0432\u0437\u0433\u043B\u044F\u043D\u0443\u0442\u044C \u0432 \u043E\u043A\u043D\u043E \u0438 \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0440\u0430\u0437\u0432\u0438\u0432\u0430\u044E\u0442\u0441\u044F \u043B\u0438 \u0444\u043B\u0430\u0433\u0438 \u043D\u0430 \u043A\u0440\u044B\u0448\u0430\u0445 \u0432 \u0432\u043E\u0441\u0442\u043E\u0447\u043D\u043E\u043C \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0438. \u0422\u0430\u043A \u0435\u043C\u0443 \u0431\u044B\u043B\u043E \u043F\u0440\u043E\u0449\u0435 \u043E\u0440\u0438\u0435\u043D\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+,1+
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0411\u0440\u0430\u0439\u0430\u043D \u0431\u044B\u043B \u043F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043B\u0435\u043D \u043D\u0430 \u0442\u0430\u043A\u043E\u0439 \u0441\u043B\u0443\u0447\u0430\u0439, \u043E\u043D \u043F\u043E\u043F\u0440\u043E\u0441\u0438\u043B \u041A\u0438\u043C, \u0432\u0437\u044F\u0442\u044C \u0438\u0437 \u0448\u043A\u0430\u0444\u0430 \u0447\u0435\u043C\u043E\u0434\u0430\u043D \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0435\u043C\u0443 \u0432\u044B\u0434\u0430\u043B\u0438 \u0432 \u0426\u0420\u0423 \u043A\u043E\u0433\u0434\u0430 \u043E\u043D \u0440\u0430\u0431\u043E\u0442\u0430\u043B \u043F\u043E\u0434 \u043F\u0440\u0438\u043A\u0440\u044B\u0442\u0438\u0435\u043C \u043D\u0430 \u0444\u0430\u043A\u0443\u043B\u044C\u0442\u0435\u0442\u0435 \u0431\u0438\u043E\u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0439. \u041A\u043E\u0433\u0434\u0430 \u0447\u0435\u043C\u043E\u0434\u0430\u043D \u0431\u044B\u043B \u0443 \u041A\u0438\u043C \u043E\u043D \u043F\u043E\u043F\u0440\u043E\u0441\u0438\u043B \u0435\u0451 \u0441\u043F\u0443\u0441\u0442\u0438\u0442\u044C\u0441\u044F \u0447\u0443\u0442\u044C \u043D\u0438\u0436\u0435 \u0438 \u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0437\u0434\u0430\u043D\u0438\u044F \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432. \u0412\u0441\u043F\u043E\u043C\u043D\u0438\u0432, \u0447\u0442\u043E \u0435\u0433\u043E \u0441\u0447\u0451\u0442 \u043F\u0440\u0435\u0440\u0432\u0430\u043B\u0441\u044F \u043D\u0430 \u0446\u0438\u0444\u0440\u0435 \u043E\u0434\u0438\u043D\u043D\u0430\u0434\u0446\u0430\u0442\u044C, \u0411\u0440\u0430\u0439\u043D \u043F\u043E\u043D\u044F\u043B \u0433\u0434\u0435 \u043F\u0440\u0438\u043C\u0435\u0440\u043D\u043E \u043E\u043D \u043D\u0430\u0445\u043E\u0434\u0438\u043B\u0441\u044F.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u0430\u0440\u0446\u0438\u043D\u0441\u043A\u043E\u0435 \u0448\u043E\u0441\u0441\u0435 11
TASK_CODE_3=\u0410742\u041A6
HINT_CODE_3=JZ85s5dfs3whm732dxu
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n\u0411\u0440\u0430\u0439\u0430\u043D \u043E\u0441\u043E\u0437\u043D\u0430\u0432\u0430\u043B, \u0447\u0442\u043E \u044D\u0442\u043E \u043D\u0435 \u0431\u044B\u043B \u043F\u043E\u0441\u0442\u0443\u043F\u043E\u043A \u043D\u0435\u043D\u043E\u0440\u043C\u0430\u043B\u044C\u043D\u043E\u0433\u043E, \u041C\u0443\u0440\u0430\u0434 \u0431\u044B\u043B \u043E\u0434\u0435\u0440\u0436\u0438\u043C \u043C\u0435\u0441\u0442\u044C\u044E, \u0432\u0441\u0451 \u0431\u044B\u043B\u043E \u0441\u043F\u043B\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u043E \u0434\u043E \u043C\u0435\u043B\u044C\u0447\u0430\u0439\u0448\u0438\u0445 \u0434\u0435\u0442\u0430\u043B\u0435\u0439. \u0411\u0440\u0430\u0439\u0430\u043D \u043F\u043E\u043F\u0440\u043E\u0441\u0438\u043B \u041A\u0438\u043C \u0432\u0437\u043E\u0440\u0432\u0430\u0442\u044C \u0433\u0440\u0430\u043D\u0430\u0442\u0443, \u0447\u0442\u043E\u0431\u044B \u043F\u043E \u0437\u0432\u0443\u043A\u0443 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0438\u0442\u044C \u043F\u0440\u0438\u043C\u0435\u0440\u043D\u043E\u0435 \u0440\u0430\u0441\u0441\u0442\u043E\u044F\u043D\u0438\u0435 \u0434\u043E \u043C\u0435\u0441\u0442\u0430 \u0441\u0432\u043E\u0435\u0433\u043E \u043D\u0430\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u044F, \u044D\u0442\u043E \u0431\u044B\u043B\u043E \u043D\u0435 \u0441\u043B\u043E\u0436\u043D\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u0442\u0430\u043A \u043A\u0430\u043A \u0432\u0435\u0442\u0435\u0440 \u0434\u0443\u043B \u043F\u0440\u044F\u043C\u043E \u0441 \u0437\u0430\u043F\u0430\u0434\u0430. \u0421\u0434\u0435\u043B\u0430\u0432 \u0432\u0441\u0451 \u043A\u0430\u043A \u043D\u0430\u0434\u043E, \u041A\u0438\u043C \u0443\u0432\u0438\u0434\u0435\u043B\u0430 \u043F\u0440\u043E\u0435\u0437\u0434 \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u0433\u0434\u0435 \u043D\u0430\u0445\u043E\u0434\u0438\u043B\u0438\u0441\u044C \u0440\u043E\u0434\u0438\u0442\u0435\u043B\u0438. \u041D\u043E \u0435\u0439 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0431\u044B\u043B\u043E \u043F\u043E\u043D\u044F\u0442\u044C \u0442\u043E\u0447\u043D\u043E\u0435 \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435. \u0412 \u044D\u0442\u043E \u0432\u0440\u0435\u043C\u044F \u041C\u0443\u0440\u0430\u0434 \u043F\u0440\u0438\u0432\u0451\u043B \u041B\u0435\u043D\u043E\u0440 \u043A \u0411\u0440\u0430\u0439\u0430\u043D\u0443, \u043E\u043D \u0445\u043E\u0442\u0435\u043B \u0447\u0442\u043E\u0431\u044B \u043E\u043D\u0430 \u0443\u043C\u0438\u0440\u0430\u043B\u0430 \u0443 \u043D\u0435\u0433\u043E \u043D\u0430 \u0433\u043B\u0430\u0437\u0430\u0445. \u0420\u0430\u0434\u0443\u0433\u0430 \u0432 \u0435\u0451 \u0433\u043B\u0430\u0437\u0430\u0445 \u043F\u043E\u0442\u0438\u0445\u043E\u043D\u044C\u043A\u0443 \u0443\u0433\u0430\u0441\u0430\u043B\u0430...\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0438\u043A\u043E\u0433\u0434\u0430 \u041B\u0435\u043D\u043E\u0440 \u0435\u0449\u0451 \u043D\u0435 \u0431\u044B\u043B\u0430 \u0442\u0430\u043A \u0431\u043B\u0438\u0437\u043A\u0430 \u043A \u0441\u043C\u0435\u0440\u0442\u0438. \u042D\u0442\u043E\u0442 \u043F\u0441\u0438\u0445 \u043D\u0438 \u043F\u0435\u0440\u0435\u0434 \u0447\u0435\u043C \u043D\u0435 \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C\u0441\u044F, \u0440\u0430\u0434\u043E\u0432\u0430\u043B\u043E \u0442\u043E\u043B\u044C\u043A\u043E \u0442\u043E, \u0447\u0442\u043E \u041A\u0438\u043C \u043E\u0441\u0442\u0430\u0432\u0430\u043B\u0430\u0441\u044C \u0441\u0432\u043E\u0431\u043E\u0434\u043D\u043E\u0439. \u0411\u0440\u0430\u0439\u0430\u043D \u0441\u043C\u043E\u0433 \u043A\u043E\u0435-\u043A\u0430\u043A \u0432\u044B\u0431\u0440\u0430\u0442\u044C\u0441\u044F \u0438 \u0441\u043D\u044F\u0442\u044C \u043F\u043E\u0434\u0432\u0435\u0448\u0435\u043D\u043D\u0443\u044E \u041B\u0435\u043D\u043E\u0440, \u043E\u043D \u043E\u0431\u043D\u044F\u043B \u0435\u0451, \u044D\u0442\u043E \u0431\u044B\u043B\u0430 \u0438\u043C\u0435\u043D\u043D\u043E \u0442\u0430 \u043B\u0430\u0441\u043A\u0430 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0435\u0439 \u043D\u0435 \u0445\u0432\u0430\u0442\u0430\u043B\u043E. \u041F\u0440\u044F\u043C\u043E \u043A\u0430\u043A \u0432 \u0434\u0435\u0442\u0441\u0442\u0432\u0435, \u0434\u043E\u043C\u0430 \u0432 \u043E\u043A\u0440\u0443\u0436\u0435\u043D\u0438\u0438 \u0440\u043E\u0434\u043D\u044B\u0445 \u043B\u044E\u0434\u0435\u0439.
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0417\u0430\u043F\u0430\u0434\u043D\u044B\u0439 \u043F\u0440\u043E\u0435\u0437\u0434, \u043F\u0435\u0440\u0435\u0434 \u0434\u0435\u0442\u0441\u043A\u0438\u043C \u0434\u043E\u043C\u043E\u043C "\u041B\u0430\u0441\u043A\u0430"
TASK_CODE_4=8\u0410917\u041A
HINT_CODE_4=129JZs5sf2dx8
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u0411\u0440\u0430\u0439\u0430\u043D\u0443, \u043D\u0443\u0436\u043D\u044B \u0431\u044B\u043B\u0438 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0438\u0438 \u0448\u0442\u0440\u0438\u0445\u0438 \u0434\u043B\u044F \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u0441\u0432\u043E\u0435\u0433\u043E \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0438 \u043E\u043D \u043F\u043E\u043F\u0440\u043E\u0441\u0438\u043B \u041A\u0438\u043C \u0432\u0437\u044F\u0442\u044C \u043A\u0430\u0440\u0442\u0443, \u043E\u043D \u043F\u043E\u043D\u0438\u043C\u0430\u043B \u0447\u0442\u043E \u043E\u043D\u0438 \u043D\u0430\u0445\u043E\u0434\u044F\u0442\u0441\u044F \u0432 \u0446\u0435\u043D\u0442\u0440\u0435, \u043D\u043E \u0433\u0434\u0435 \u0438\u043C\u0435\u043D\u043D\u043E \u043D\u0435 \u0437\u043D\u0430\u043B. \u0412\u0441\u0435\u0433\u0434\u0430 \u0432\u0430\u0436\u0435\u043D \u043F\u0435\u0440\u0432\u044B\u0439 \u0448\u0430\u0433, \u043E\u0442 \u0442\u043E\u0433\u043E \u043A\u0430\u043A\u0438\u043C \u043E\u043D \u0431\u0443\u0434\u0435\u0442 \u0437\u0430\u0432\u0438\u0441\u0438\u0442 \u0432\u0441\u0451. \u0414\u043B\u044F \u041A\u0438\u043C \u044D\u0442\u043E \u0431\u044B\u043B \u0434\u0435\u0431\u044E\u0442 \u0438 \u043E\u043D\u0430 \u0443\u0434\u0430\u0447\u043D\u043E \u0441\u043F\u0440\u0430\u0432\u0438\u043B\u0430\u0441\u044C \u0441\u043E \u0441\u0432\u043E\u0435\u0439 \u0437\u0430\u0434\u0430\u0447\u0435\u0439. \u0421\u0435\u0439\u0447\u0430\u0441 \u0431\u044B\u043B\u043E \u043D\u0435 \u0434\u043E \u0448\u0443\u0442\u043E\u043A \u0438 \u043E\u0448\u0438\u0431\u0438\u0441\u044C \u043E\u043D\u0430 \u0432 \u0440\u0438\u0441\u0443\u043D\u043A\u0435, \u0432\u0441\u0451 \u043C\u043E\u0433\u043B\u043E \u0431\u044B \u0437\u0430\u043A\u043E\u043D\u0447\u0438\u0442\u044C\u0441\u044F \u043F\u0435\u0447\u0430\u043B\u044C\u043D\u043E. \u041E\u0442 \u0442\u043E\u0447\u043A\u0438 \u0441\u0442\u0430\u0440\u0442\u0430 \u0440\u0430\u0434\u0438\u0443\u0441 \u043D\u0430 \u0434\u0435\u0432\u044F\u0442\u044C \u0441\u0430\u043D\u0442\u0438\u043C\u0435\u0442\u0440\u043E\u0432 \u0438 \u043E\u0442 \u043A\u043E\u043D\u0435\u0447\u043D\u043E\u0439 \u0442\u043E\u0447\u043A\u0438 \u0441\u0430\u043C\u043E\u0432\u043E\u0433\u043E \u0432\u0430\u0436\u043D\u043E\u0433\u043E \u043F\u0435\u0440\u0432\u043E\u0433\u043E \u0445\u043E\u0434\u0430 \u043D\u0430 \u0447\u0435\u0442\u044B\u0440\u0435. \u041C\u0435\u0441\u0442\u043E \u043F\u0435\u0440\u0435\u0441\u0435\u0447\u0435\u043D\u0438\u044F \u043A\u0440\u0443\u0433\u043E\u0432 \u0431\u0443\u043A\u0432\u0430\u043B\u044C\u043D\u043E \u0443\u043A\u0430\u0437\u044B\u0432\u0430\u043B\u043E \u043D\u0430 \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u0440\u043E\u0434\u0438\u0442\u0435\u043B\u0435\u0439.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0426\u0435\u043D\u0442\u0440\u0430\u043B\u044C\u043D\u044B\u0439 \u0434\u0435\u0431\u044E\u0442, \u044D\u0442\u043E \u043A\u043B\u0430\u0441\u0441\u0438\u043A\u0430 \u0436\u0430\u043D\u0440\u0430. \u041F\u0435\u0440\u0432\u044B\u0439 \u0445\u043E\u0434, \u0432\u0441\u0435\u0433\u0434\u0430 \u0440\u0435\u0448\u0430\u0435\u0442 \u043F\u0440\u0430\u043A\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0432\u0441\u044E \u043F\u0430\u0440\u0442\u0438\u044E. \u041A\u0438\u043C \u043D\u0435 \u043C\u043E\u0433\u043B\u0430 \u043E\u0448\u0438\u0431\u0438\u0442\u044C\u0441\u044F. \u041F\u043E \u0441\u0443\u0442\u0438 \u0432\u0441\u0451 \u0431\u044B\u043B\u043E \u043F\u0440\u043E\u0441\u0442\u043E 9 \u0441\u0430\u043D\u0442\u0438\u043C\u0435\u0442\u0440\u043E\u0432 \u043E\u0442 \u0441\u0442\u0430\u0440\u0442\u0430 \u0438 4 \u043E\u0442 \u0444\u0438\u043D\u0438\u0448\u0430. \u0418 \u0432\u043E\u0442 \u043A\u0440\u0443\u0433\u0438 \u043F\u0435\u0440\u0435\u0441\u0435\u043A\u0430\u044F\u0441\u044C \u0443\u043A\u0430\u0437\u044B\u0432\u0430\u044E\u0442 \u043F\u0443\u0442\u044C.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u041C\u0430\u0440\u043A\u043E\u0432\u0430 22
TASK_CODE_5=\u0410368\u041A9
HINT_CODE_5=25JZ7e6c2kv29gsl8
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0421\u043C\u0435\u0440\u0442\u044C \u0442\u0430\u043A\u0438 \u043D\u0430\u0441\u0442\u0438\u0433\u043B\u0430 \u041B\u0435\u043D\u043E\u0440, \u043D\u043E \u043D\u0435 \u0432 \u0422\u0443\u0440\u0446\u0438\u0438 \u043A\u0430\u043A \u043E\u0436\u0438\u0434\u0430\u043B\u043E\u0441\u044C. \u041E\u0442\u0442\u0443\u0434\u0430 \u043E\u043D\u0438 \u0431\u043B\u0430\u0433\u043E\u043F\u043E\u043B\u0443\u0447\u043D\u043E \u0432\u044B\u0431\u0440\u0430\u043B\u0438\u0441\u044C. \u041A\u0430\u043A \u043D\u0435 \u0443\u0434\u0438\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u043E, \u0430 \u0441\u043C\u0435\u0440\u0442\u044C \u043F\u043E\u0434\u0436\u0438\u0434\u0430\u043B\u0430 \u041B\u0435\u043D\u043E\u0440 \u0432 \u0434\u043E\u043C\u0435 \u0443 \u0411\u0440\u0430\u0439\u0430\u043D\u0430. \u0415\u0433\u043E \u043A\u0442\u043E-\u0442\u043E \u0445\u043E\u0442\u0435\u043B \u043F\u043E\u0434\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u0438 \u0434\u0435\u043B\u0430\u043B \u043E\u043D \u043E\u0447\u0435\u043D\u044C \u0433\u0440\u0430\u043C\u043E\u0442\u043D\u043E. \u0421 \u044D\u0442\u043E\u0439 \u043C\u0438\u043D\u0443\u0442\u044B \u0411\u0440\u0430\u0439\u0430\u043D \u0431\u044B\u043B \u0432\u043D\u0435 \u0437\u0430\u043A\u043E\u043D\u0430. \u0414\u043B\u044F \u043D\u0435\u0433\u043E \u044D\u0442\u043E \u0431\u044B\u043B\u0430 \u0432\u043E\u0439\u043D\u0430, \u0432\u043E\u0439\u043D\u0430 \u0441 \u043D\u0435\u0432\u0438\u0434\u0438\u043C\u044B\u043C \u043F\u0440\u043E\u0442\u0438\u0432\u043D\u0438\u043A\u043E\u043C. \u041D\u0430 \u043D\u0435\u0433\u043E \u043D\u0430\u0447\u0430\u043B\u0430\u0441\u044C \u043E\u0445\u043E\u0442\u0430. 29 \u0432\u043E\u0435\u043D\u043D\u044B\u0445 \u043F\u044B\u0442\u0430\u043B\u0438\u0441\u044C \u0437\u0430\u0445\u0432\u0430\u0442\u0438\u0442\u044C \u0435\u0433\u043E \u043F\u043E \u0432\u0441\u0435\u043C\u0443 \u0433\u043E\u0440\u043E\u0434\u0443, \u043D\u043E \u043E\u043D \u043F\u043E\u0441\u0442\u043E\u044F\u043D\u043D\u043E \u0431\u044B\u043B \u043D\u0430 \u0448\u0430\u0433 \u0432\u043F\u0435\u0440\u0435\u0434\u0438. \u0428\u0443\u043C \u0440\u0435\u043B\u044C\u0441, \u043C\u0435\u0448\u0430\u043B \u0438\u043C \u0443\u0441\u043B\u044B\u0448\u0430\u0442\u044C \u0435\u0433\u043E. \u0412 \u043A\u0430\u043A\u043E\u0439-\u0442\u043E \u043C\u043E\u043C\u0435\u043D\u0442 \u043A\u0430\u0437\u0430\u043B\u043E\u0441\u044C, \u0447\u0442\u043E \u0435\u043C\u0443 \u043D\u0435 \u0432\u044B\u0431\u0440\u0430\u0442\u044C\u0441\u044F, \u043A\u043E\u0433\u0434\u0430 \u043E\u043D\u0438 \u0432 \u0432\u043F\u044F\u0442\u0435\u0440\u043E\u043C \u043E\u0431\u043E\u0448\u043B\u0438 \u0441\u0437\u0430\u0434\u0438 \u043F\u043E\u0434\u0431\u0438\u0440\u0430\u044F\u0441\u044C \u0441 \u043F\u043B\u043E\u0449\u0430\u0434\u043A\u0438, \u043D\u043E \u0438 \u0437\u0434\u0435\u0441\u044C \u043E\u043D \u0441\u043C\u043E\u0433 \u0441\u043F\u0440\u0430\u0432\u0438\u0442\u044C\u0441\u044F. \u041F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043A\u0430 \u0432 \u0426\u0420\u0423 \u043E \u043C\u043D\u043E\u0433\u043E\u043C \u0433\u043E\u0432\u043E\u0440\u0438\u043B\u0430. \u0418\u043D\u0441\u043F\u0435\u043A\u0442\u043E\u0440 \u043F\u043E\u043B\u0438\u0446\u0438\u0438 \u0424\u0440\u0430\u043D\u043A \u0414\u043E\u0446\u043B\u0435\u0440 \u043F\u0440\u0435\u043A\u0440\u0430\u0441\u043D\u043E \u043F\u043E\u043D\u0438\u043C\u0430\u043B \u0441 \u043A\u0435\u043C \u0438\u043C\u0435\u0435\u0442 \u0434\u0435\u043B\u043E.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,1+
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0435\u043F\u043E\u0434\u0430\u043B\u0451\u043A\u0443 \u043E\u0442 \u0441\u0442\u0430\u0434\u0438\u043E\u043D\u0430 \u0441\u0442\u043E\u044F\u043B \u0430\u0432\u0442\u043E\u043C\u043E\u0431\u0438\u043B\u044C \u0441\u0438\u0433\u0430\u0440\u043E\u043E\u0431\u0440\u0430\u0437\u043D\u043E\u0439 \u0444\u043E\u0440\u043C\u044B, \u043E\u0434\u0438\u043D \u0438\u0437 \u0431\u043E\u043B\u0435\u043B\u044C\u0449\u0438\u043A\u043E\u0432 \u0448\u0451\u043B \u0432 \u0444\u0443\u0442\u0431\u043E\u043B\u043A\u0435 \u0441 \u043D\u043E\u043C\u0435\u0440\u043E\u043C 29 \u0438 \u0432\u043E\u0435\u043D\u043D\u044B\u0445 \u0448\u0442\u0430\u043D\u0430\u0445, \u043E\u0431\u043E\u0439\u0434\u044F \u0441\u0437\u0430\u0434\u0438 \u043E\u043D \u043E\u043A\u043B\u0438\u043A\u043D\u0443\u043B \u0411\u0440\u0430\u0439\u0430\u043D\u0430 \u0438 \u043F\u043E\u043F\u0440\u043E\u0441\u0438\u043B \u0443 \u043D\u0435\u0433\u043E 5 \u0446\u0435\u043D\u0442\u043E\u0432, \u0437\u0430\u0442\u0435\u043C \u043F\u0440\u0438\u0433\u043B\u0430\u0441\u0438\u043B \u0441 \u043D\u0438\u043C \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u043C\u0430\u0442\u0447. \u041D\u043E \u0435\u043C\u0443 \u0431\u044B\u043B\u043E \u043D\u0435 \u0434\u043E \u0444\u0443\u0442\u0431\u043E\u043B\u0430. \u0415\u043C\u0443 \u0432\u043E \u0447\u0442\u043E \u0431\u044B \u0442\u043E \u043D\u0438 \u0441\u0442\u0430\u043B\u043E \u043D\u0430\u0434\u043E \u0431\u044B\u043B\u043E \u043D\u0430\u0439\u0442\u0438 \u0443\u0431\u0438\u0439\u0446\u0443 \u041B\u0435\u043D\u043E\u0440. \u0412\u0435\u0441\u044C \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u043E\u0439 \u0433\u043E\u0440\u043E\u0434\u043E\u043A \u043C\u0438\u0440\u043D\u043E \u0441\u043F\u0430\u043B.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n29 \u0432\u043E\u0435\u043D\u043D\u044B\u0439 \u0433\u043E\u0440\u043E\u0434\u043E\u043A \u043A\u043E\u0440\u043F\u0443\u0441 5 \u0437\u0430 \u0434\u043E\u043C\u043E\u043C.
TASK_CODE_6=A6413K
HINT_CODE_6=48J2Zdg5ya9qm8fxs4d
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\u0411\u0440\u0430\u0439\u0430\u043D \u0432\u044B\u0445\u043E\u0434\u0438\u0442 \u043D\u0430 \u0421\u0442\u044E\u0430\u0440\u0442\u0430, \u0438 \u0442\u043E\u0442 \u0440\u0430\u0441\u0441\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442, \u0447\u0442\u043E \u041B\u0435\u043D\u043E\u0440\u0430 \u043F\u043E\u0433\u0438\u0431\u043B\u0430 \u0438\u0437-\u0437\u0430 \u0435\u0433\u043E \u043D\u0435\u0441\u043F\u043E\u0441\u043E\u0431\u043D\u043E\u0441\u0442\u0438 \u043E\u043F\u043B\u0430\u0442\u0438\u0442\u044C \u0434\u043E\u043B\u0433 \u0441\u0432\u043E\u0435\u043C\u0443 \u043F\u0430\u0440\u0442\u043D\u0435\u0440\u0443 \u041E\u043B\u0435\u0433\u0443 \u041C\u0430\u043B\u0430\u043D\u043A\u043E\u0432\u0443. \u0421\u0442\u044E\u0430\u0440\u0442 \u043A\u0430\u043A \u0445\u0438\u0442\u0440\u044B\u0439 \u0434\u0438\u0441\u043F\u0435\u0442\u0447\u0435\u0440 \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u044F\u043B \u0438\u0445 \u0434\u0440\u0443\u0433 \u043D\u0430 \u0434\u0440\u0443\u0433\u0430, \u0440\u0435\u0448\u0438\u0432 \u0441\u0442\u043E\u043B\u043A\u043D\u0443\u0442\u044C \u043B\u0431\u0430\u043C\u0438 \u0411\u0440\u0430\u0439\u0430\u043D\u0430 \u0438 \u041C\u0430\u043B\u0430\u043D\u043A\u043E\u0432\u0430. \u041C\u0435\u0441\u0442\u044C \u0434\u0432\u0438\u0433\u0430\u043B\u0430 \u041C\u0438\u043B\u0441\u043E\u043C, \u0438 \u0447\u0442\u043E\u0431\u044B \u0434\u043E\u0431\u0440\u0430\u0442\u044C\u0441\u044F \u0434\u043E \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0435\u0433\u043E \u0443\u0431\u0438\u0439\u0446\u044B \u043D\u0430\u0434\u043E \u0431\u044B\u043B\u043E \u043F\u0440\u043E\u044F\u0432\u0438\u0442\u044C \u0441\u043C\u0435\u043A\u0430\u043B\u043A\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u0441\u043A\u0432\u0435\u0440\u043D\u043E\u0435 \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435, \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044E \u043C\u043E\u0436\u043D\u043E \u0431\u044B\u043B\u043E \u0440\u0435\u0448\u0438\u0442\u044C. \u0414\u0435\u0440\u0435\u0432\u044C\u044F \u043F\u0435\u0440\u0435\u0434\u0430\u0432\u0430\u043B\u0438 \u043D\u0443\u0436\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E, \u043A\u0430\u0436\u0434\u044B\u0439 \u0441\u0438\u043C\u0432\u043E\u043B \u0431\u044B\u043B \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D \u0446\u0438\u0444\u0440\u043E\u0439, \u0442\u0430\u043A\u0438\u0445 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432 \u0431\u044B\u043B\u043E 13. \u0412\u0430\u0436\u043D\u043E \u043D\u0435 \u043F\u0440\u043E\u0441\u0442\u043E \u043D\u0430\u0439\u0442\u0438 \u0438\u0445 \u043D\u043E \u0438 \u0443\u0447\u0438\u0442\u044B\u0432\u0430\u0442\u044C \u0440\u0435\u0433\u0438\u0441\u0442\u0440, \u0442\u0430\u043C \u0433\u0434\u0435 \u0431\u043E\u043B\u044C\u0448\u0430\u044F \u0431\u0443\u043A\u0432\u0430, \u0441\u0442\u043E\u0438\u0442 \u0437\u043D\u0430\u0447\u043E\u043A \u0411. \u042D\u0442\u043E \u043E\u0447\u0435\u043D\u044C \u0432\u0430\u0436\u043D\u043E. \u0421\u043E\u0431\u0440\u0430\u0432 \u0432\u0441\u0435 \u0441\u0438\u043C\u0432\u043E\u043B\u044B, \u0432\u043E\u0435\u0434\u0438\u043D\u043E \u0411\u0440\u0430\u0439\u0430\u043D \u043F\u043E\u043D\u044F\u043B, \u0447\u0442\u043E \u043D\u0430\u0434\u043E \u0434\u0435\u043B\u0430\u0442\u044C \u0438 \u0441\u043C\u043E\u0433 \u0442\u0430\u043A\u0438 \u043D\u0430\u043A\u0430\u0437\u0430\u0442\u044C \u0443\u0431\u0438\u0439\u0446\u0443.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0412 \u043F\u0430\u0440\u043A\u0435 \u0434\u0430\u0432\u043D\u043E \u043D\u0438\u043A\u043E\u0433\u043E \u043D\u0435 \u0431\u044B\u043B\u043E, \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0438\u0445 \u0441\u043F\u0443\u0433\u043D\u0443\u043B \u0432\u0437\u0440\u044B\u0432 \u0434\u0432\u0443\u0445 \u0441\u0430\u043C\u043E\u043B\u0451\u0442\u043E\u0432 \u0441\u0442\u043E\u043B\u043A\u043D\u0443\u0432\u0448\u0438\u0445\u0441\u044F \u0432 \u043D\u0435\u0431\u0435. \u0418\u043B\u0438 \u0433\u043B\u0430\u0437\u0430 \u044D\u0442\u043E\u0433\u043E \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0440\u0435\u0448\u0438\u043B \u043E\u0442\u043E\u043C\u0441\u0442\u0438\u0442\u044C \u0437\u0430 \u0441\u0432\u043E\u044E \u0441\u0435\u043C\u044C\u044E. \u041E\u043D \u0442\u043E\u0447\u043D\u043E \u0437\u043D\u0430\u043B, \u0447\u0442\u043E \u0431\u0443\u0434\u0435\u0442 \u0438\u0434\u0442\u0438 \u043D\u0430\u043F\u0440\u043E\u043B\u043E\u043C \u043A\u0430\u043A \u0417\u043E\u044F.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u043A\u0432\u0435\u0440 \u0438\u043C\u0435\u043D\u0438 \u042E\u0440\u0438\u044F \u0413\u0430\u0433\u0430\u0440\u0438\u043D\u0430. \u0412\u0445\u043E\u0434 \u0441 \u041A\u0430\u043B\u043E\u0435\u0432\u0430.
TASK_CODE_7=\u0410\u041A7538
HINT_CODE_7=J731Zde3uv21bd78dy6hd5
BONUS_TASK=\u0411\u043E\u043D\u0443\u0441\u043D\u043E\u0435 \u0437\u0430\u0434\u0430\u043D\u0438\u0435\n\u00AB\u0423\u0444, \u043D\u0430\u043A\u043E\u043D\u0435\u0446-\u0442\u043E \u0432\u0441\u0435 \u0437\u0430\u043A\u043E\u043D\u0447\u0438\u043B\u043E\u0441\u044C!\u00BB - \u0432\u044B\u0434\u043E\u0445\u043D\u0443\u043B \u0434\u043E\u043A\u0442\u043E\u0440 \u0414\u0436\u043E\u043D\u0441 \u0441\u0442\u0430\u0440\u0448\u0438\u0439. \u041A\u043E\u043D\u0435\u0447\u043D\u043E \u0434\u0440\u043E\u0432 \u043C\u044B \u043D\u0430\u043B\u043E\u043C\u0430\u043B\u0438 \u041C\u0430\u0440\u043A\u0443\u0441, \u043A\u0440\u0443\u0433\u043E\u043C \u043F\u043E\u0432\u0430\u043B\u0435\u043D\u043D\u044B\u0439 \u043B\u0435\u0441 \u0441\u0440\u0435\u0434\u0438 \u0432\u043E\u043B\u043A\u043E\u0432. \u041D\u0443 \u043D\u0438\u0447\u0435\u0433\u043E, \u043F\u0440\u0438\u0435\u0434\u0443 \u0434\u043E\u043C\u043E\u0439 \u0438 \u043A\u0443\u043F\u043B\u044E \u0442\u0435\u0431\u0435 \u0434\u043E\u043C, \u0433\u0434\u0435 \u043C\u044B \u0441 \u0442\u043E\u0431\u043E\u0439 \u0441\u043C\u043E\u0436\u0435\u043C \u0441\u0438\u0434\u0435\u0442\u044C \u0438 \u0441\u043F\u043E\u043A\u043E\u0439\u043D\u043E \u0431\u0435\u0441\u0435\u0434\u043E\u0432\u0430\u0442\u044C \u043D\u0430 \u043E\u0442\u043A\u0440\u044B\u0442\u043E\u0439 \u0432\u0435\u0440\u0430\u043D\u0434\u0435, \u043F\u043E\u0434 \u043F\u0440\u0438\u044F\u0442\u043D\u0443\u044E \u043C\u0443\u0437\u044B\u043A\u0443 \u0448\u0430\u043D\u0441\u043E\u043D\u044C\u0435.
BONUS_CODE=5J931Z32sdw46df46
BONUS_FIVE_MINUTES=dan4ted4sfa4ssr
BONUS_TEN_MINUTES=Ndd4tw52vx84sws
BONUS_FIFTEEN_MINUTES=Ou6dgt6wcx6itq6sre