#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="\u0412\u043E\u0439\u043D\u0430 \u043C\u0438\u0440\u043E\u0432."\n\n\u042D\u0442\u0438 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0430 \u043D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E \u043D\u0430\u043F\u0430\u043B\u0438 \u043D\u0430 \u043D\u0430\u0448\u0443 \u0437\u0435\u043C\u043B\u044E \u0438 \u0441\u0442\u0430\u043B\u0438 \u0431\u0435\u0441\u043F\u043E\u0449\u0430\u0434\u043D\u043E \u0443\u043D\u0438\u0447\u0442\u043E\u0436\u0430\u0442\u044C \u043D\u0430\u0441\u0435\u043B\u0435\u043D\u0438\u0435.\n\u041C\u044B \u043E\u0431\u044F\u0437\u0430\u043D\u044B \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C \u0438\u0445...
START_CODE=ww
START_DATE=25-01-2020
START_TIME=18-30
FIRST_HINT_TIMER=10
SECOND_HINT_TIMER=10
END_TASK_TIMER=10
BONUS_TASK_TIMER=40
BONUS_TASK_TIME=30
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0410\u0433\u0435\u043D\u0442)\n\u041C\u044B \u043A\u0430\u043A \u0437\u0430\u0432\u043E\u0440\u043E\u0436\u0435\u043D\u043D\u044B\u0435 \u0441\u043C\u043E\u0442\u0440\u0435\u043B\u0438 \u043A\u0430\u043A \u044D\u0442\u0438 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0430 \u0441\u043E \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u043C\u0438 \u0443\u0448\u0430\u043C\u0438 \u0432\u044B\u0448\u043B\u0438 \u0438\u0437 \u0432\u043E\u0434\u044B, \u043E\u043D\u0438 \u0431\u044B\u043B\u0438 \u043F\u043E\u0445\u043E\u0436\u0438 \u043D\u0430 \u043C\u0438\u0444\u0438\u0447\u0435\u0441\u043A\u0438\u0435 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F. \u0417\u0430\u0434\u0440\u0430\u043B\u0438 \u0433\u043E\u043B\u043E\u0432\u044B \u0438 \u0441\u0442\u0430\u043B\u0438 \u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u043D\u0430 \u044E\u0436\u043D\u044B\u0439 \u043A\u0440\u0435\u0441\u0442. \u041A\u0442\u043E-\u0442\u043E \u0434\u0430\u0436\u0435 \u043F\u043E\u043F\u044B\u0442\u0430\u043B\u0441\u044F \u0437\u0430\u0441\u043D\u044F\u0442\u044C \u0438\u0445. \u0421\u043D\u0438\u043C\u043E\u043A \u043F\u043E\u043B\u0443\u0447\u0438\u043B\u0441\u044F \u044F\u0440\u043A\u0438\u043C, \u043D\u0430 \u043D\u0451\u043C \u043F\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u043E\u0432\u0430\u043B\u0430 \u0432\u0441\u044F \u043F\u0430\u043B\u0438\u0442\u0440\u0430 \u043A\u0440\u0430\u0441\u043E\u043A, \u043D\u043E \u044D\u0442\u0438 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0430 \u043F\u043E\u0447\u0435\u043C\u0443-\u0442\u043E \u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u043E\u0432\u0430\u043B\u0438!\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0420\u044F\u0434\u043E\u043C \u0441 \u044E\u0436\u043D\u044B\u043C \u043A\u0440\u0435\u0441\u0442\u043E\u043C \u0431\u043B\u0430\u0433\u043E\u043F\u043E\u043B\u0443\u0447\u043D\u043E \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0438\u043B\u0430\u0441\u044C \u0431\u043E\u043B\u044C\u0448\u0430\u044F \u043C\u0435\u0434\u0432\u0435\u0434\u0438\u0446\u0430, \u044D\u0442\u0438 \u0433\u043D\u043E\u043C\u044B \u0441 \u043E\u0441\u0442\u0440\u044B\u043C\u0438 \u0443\u0448\u0430\u043C\u0438, \u043A\u0430\u043A \u043E\u0445\u043E\u0442\u043D\u0438\u043A\u0438 \u043E\u0437\u0438\u0440\u0430\u043B\u0438\u0441\u044C \u043F\u043E \u0441\u0442\u043E\u0440\u043E\u043D\u0430\u043C, \u0436\u0435\u043B\u0430\u044F \u0437\u043D\u0430\u0442\u044C \u0433\u0434\u0435 \u043F\u0440\u0438\u0442\u0430\u0438\u043B\u0430\u0441\u044C \u0438\u0445 \u0436\u0435\u0440\u0442\u0432\u0430. \u041E\u0434\u043D\u043E \u043D\u0435 \u0434\u0430\u0432\u0430\u043B\u043E \u043F\u043E\u043A\u043E\u044F, \u043F\u043E\u0447\u0435\u043C\u0443 \u043E\u043D\u0438 \u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u043E\u0432\u0430\u043B\u0438 \u043D\u0430 \u0444\u043E\u0442\u043E...
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0424\u043E\u0442\u043E\u0441\u0430\u043B\u043E\u043D "\u0420\u0430\u0434\u0443\u0433\u0430" \u041A\u0438\u0440\u043E\u0432\u0430 21
TASK_CODE_1=1C2V34
HINT_CODE_1=T7SDFE212G7SD
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u041E\u043D\u0438 \u0431\u044B\u043B\u0438 \u043F\u043E\u0432\u0441\u044E\u0434\u0443, \u044D\u0442\u043E \u0431\u044B\u043B\u043E \u043D\u0430\u043F\u0430\u0434\u0435\u043D\u0438\u0435 \u043D\u0430 \u043D\u0430\u0448\u0443 \u043F\u043B\u0430\u043D\u0435\u0442\u0443, \u0442\u043E\u043B\u044C\u043A\u043E \u043D\u0435\u043F\u043E\u043D\u044F\u0442\u043D\u043E \u043E\u0442\u043A\u0443\u0434\u0430, \u0438\u0437 \u0432\u043D\u0435 \u0438\u043B\u0438 \u0438\u0437\u043D\u0443\u0442\u0440\u0438. \u0421\u0442\u0430\u043B\u0438 \u043F\u043E\u044F\u0432\u043B\u044F\u0442\u044C\u0441\u044F \u0441\u043B\u0443\u0445\u0438 \u043E \u0436\u0435\u0440\u0442\u0432\u0430\u0445. \u0414\u043B\u044F \u043D\u0438\u0445 \u044D\u0442\u043E \u043D\u0435 \u0441\u043E\u0441\u0442\u0430\u0432\u0438\u043B\u043E \u0442\u0440\u0443\u0434\u0430. \u041E\u0434\u043D\u0430\u043A\u043E \u0438 \u043B\u044E\u0434\u0438 \u0441\u043C\u043E\u0433\u043B\u0438 \u043D\u0430\u043D\u0435\u0441\u0442\u0438 \u0443\u0440\u043E\u043D \u0432\u0440\u0430\u0433\u0430\u043C. \u041E\u0434\u043D\u043E\u0433\u043E \u0438\u0437 \u044D\u0442\u0438\u0445 \u0441\u0443\u0449\u0435\u0441\u0442\u0432 \u043F\u0440\u0438\u0448\u043B\u043E\u0441\u044C \u0434\u0430\u0436\u0435 \u043B\u0435\u0447\u0438\u0442\u044C, \u043E\u043D \u043D\u0430\u043C \u0431\u044B\u043B \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0437\u0430\u043B\u043E\u0436\u043D\u0438\u043A\u0430. \u041F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0431\u044B\u043B\u0430 \u0432 \u0442\u043E\u043C, \u0447\u0442\u043E \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0435 \u0431\u043E\u043B\u044C\u043D\u0438\u0446\u044B \u043D\u0435 \u043F\u043E\u0434\u0445\u043E\u0434\u0438\u043B\u0438, \u043D\u0443\u0436\u043D\u044B \u0431\u044B\u043B\u0438 \u0441\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438. \u0410 \u043B\u0435\u0447\u0435\u043D\u0438\u0435 \u0434\u043E\u043B\u0436\u0435\u043D \u043F\u0440\u043E\u0432\u043E\u0434\u0438\u0442\u044C \u0432\u0440\u0430\u0447 \u043D\u0430 \u043C\u0438\u043A\u0440\u043E\u0441\u043A\u043E\u043F\u0438\u0447\u0435\u0441\u043A\u043E\u043C \u0443\u0440\u043E\u0432\u043D\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u0440\u0438\u0441\u0442\u0443\u043F\u0438\u0432 \u043A \u043B\u0435\u0447\u0435\u043D\u0438\u044E, \u043C\u044B \u043F\u043E\u043D\u044F\u043B\u0438, \u0447\u0442\u043E \u044D\u0442\u043E \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043E \u0431\u044B\u043B\u043E \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u044B\u043C. \u0421\u0440\u0430\u0437\u0443 \u0441\u0442\u0430\u043B\u043E \u044F\u0441\u043D\u043E, \u0447\u0442\u043E \u0431\u0435\u0437 \u043D\u0430\u043D\u043E \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0439 \u0437\u0434\u0435\u0441\u044C \u0431\u044B\u043B\u043E \u043D\u0435 \u043E\u0431\u043E\u0439\u0442\u0438\u0441\u044C!
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u043B\u0438\u043D\u0438\u043A\u0430 \u043D\u0430\u043D\u043E\u0434\u043E\u043A\u0442\u043E\u0440, \u0428\u043C\u0443\u043B\u0435\u0432\u0438\u0447\u0430, \u0434\u043E\u0440\u043E\u0433\u0430 \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u043B\u0435\u0441\u0430.
TASK_CODE_2=C31V48
HINT_CODE_2=J351Zdg452achhfw
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n\u041D\u0430\u0447\u0430\u043B\u0438 \u0445\u043E\u0434\u0438\u0442\u044C \u0441\u043B\u0443\u0445\u0438, \u0447\u0442\u043E \u043F\u0440\u0430\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u0438\u0446\u0443 \u044D\u0442\u0438\u0445 \u0441\u0443\u0449\u0435\u0441\u0442\u0432 \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0430\u0442\u0430\u043A\u0438 \u0437\u0430\u0446\u0435\u043F\u0438\u043B\u043E \u0448\u0430\u043B\u044C\u043D\u043E\u0439 \u043F\u0443\u043B\u0435\u0439. \u041F\u043E\u0441\u043B\u0435 \u0447\u0435\u0433\u043E \u043E\u043D\u0438 \u0435\u0449\u0451 \u0431\u043E\u043B\u044C\u0448\u0435 \u043F\u0440\u0438\u0448\u043B\u0438 \u0432 \u044F\u0440\u043E\u0441\u0442\u044C. \u041A \u043D\u0430\u043C \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u043B\u0438 \u0441\u043F\u0435\u0446 \u0432\u0437\u0432\u043E\u0434 \u0441 \u0441\u0430\u043C\u043E\u0439 \u0441\u0442\u043E\u043B\u0438\u0446\u044B.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0421\u0438\u0442\u0443\u0430\u0446\u0438\u044F \u043D\u0430\u043A\u0430\u043B\u044F\u043B\u0430\u0441\u044C, \u0431\u044B\u043B\u043E \u043F\u043E\u043D\u044F\u0442\u043D\u043E, \u0447\u0442\u043E \u0434\u0440\u0443\u0436\u0431\u044B \u043C\u0435\u0436\u0434\u0443 \u043D\u0430\u043C\u0438 \u0431\u044B\u0442\u044C \u0443\u0436\u0435 \u043F\u0440\u043E\u0441\u0442\u043E \u043D\u0435 \u043C\u043E\u0436\u0435\u0442, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u0432\u043E\u043F\u0440\u043E\u0441 \u043E \u043F\u0435\u0440\u0435\u043C\u0438\u0440\u0438\u0438 \u043D\u0438\u043A\u0442\u043E \u0434\u0430\u0436\u0435 \u043D\u0435 \u0440\u0430\u0441\u0441\u043C\u0430\u0442\u0440\u0438\u0432\u0430\u043B. \u0418\u043C\u043F\u0435\u0440\u0441\u043A\u0438\u0435 \u0432\u043E\u0439\u0441\u043A\u0430 \u043D\u0430\u0441\u0442\u0443\u043F\u0430\u043B\u0438 \u0441 \u0435\u0449\u0451 \u0431\u043E\u043B\u044C\u0448\u0435\u0439 \u0441\u0438\u043B\u043E\u0439.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0430\u0434\u043E\u0432\u043E\u0442\u0447\u0435\u0441\u0442\u0432\u043E \u0434\u0440\u0443\u0436\u0431\u0430, \u0440\u0435\u0441\u0442\u043E\u0440\u0430\u043D \u0438\u043C\u043F\u0435\u0440\u0430\u0442\u0440\u0438\u0446\u0430.
TASK_CODE_3=CV1734
HINT_CODE_3=JZ85s5dfs3whm732dxu
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\nC1 : D3 . 0 : G3 : 0 : A3 : 0 : G1\nE3 : G4 . C5 : C4 : D4 : A7 : B4 : G8\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,1+
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n43.050109, 44.697956
TASK_CODE_4=C716V3
HINT_CODE_4=129JZs5sf2dx8
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u041F\u043E\u0441\u043B\u0435 \u043E\u0436\u0435\u0441\u0442\u043E\u0447\u0435\u043D\u043D\u043E\u0439 \u0431\u043E\u0439\u043D\u0438 \u044D\u0442\u0438 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0430 \u043D\u0435\u043C\u043D\u043E\u0433\u043E \u043F\u0440\u0438\u0442\u0438\u0445\u043B\u0438 \u0443\u0439\u0434\u044F \u043A \u0441\u0435\u0431\u0435 \u0432 \u043B\u043E\u0433\u043E\u0432\u043E \u0441\u043B\u043E\u0432\u043D\u043E \u0432 \u0441\u043F\u044F\u0447\u043A\u0443. \u0427\u0442\u043E\u0431\u044B \u0437\u0430\u0442\u0435\u043C \u0432\u043D\u043E\u0432\u044C \u043D\u0430\u043F\u0430\u0441\u0442\u044C \u0441 \u043D\u043E\u0432\u043E\u0439 \u0441\u0438\u043B\u043E\u0439. \u041E\u043D\u0438 \u0440\u0430\u0441\u0441\u0442\u0430\u0432\u0438\u043B\u0438 \u0432\u043E\u0437\u043B\u0435 \u0441\u0432\u043E\u0438\u0445 \u0443\u0431\u0435\u0436\u0438\u0449 \u043B\u043E\u0432\u0443\u0448\u043A\u0438. \u0427\u0442\u043E\u0431\u044B \u043F\u043E\u0434\u043E\u0431\u0440\u0430\u0442\u044C\u0441\u044F \u043A \u043D\u0438\u043C, \u043D\u0430\u043C \u0441\u043B\u0435\u0434\u043E\u0432\u0430\u043B\u043E \u0445\u043E\u0440\u043E\u0448\u043E \u043F\u043E\u0442\u0440\u0443\u0434\u0438\u0442\u044C\u0441\u044F. \u041D\u0430\u043C \u043E\u0431\u044F\u0437\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u043D\u0443\u0436\u043D\u0430 \u043F\u043E\u0431\u0435\u0434\u0430 \u0438\u043D\u0430\u0447\u0435 \u0447\u0435\u043B\u043E\u0432\u0435\u0447\u0435\u0441\u0442\u0432\u043E \u043F\u0435\u0440\u0435\u0441\u0442\u0430\u043D\u0435\u0442 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0427\u0442\u043E\u0431\u044B \u043F\u043E\u0431\u0435\u0434\u0438\u0442\u044C \u043D\u0430\u043C \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0440\u0432\u0430\u0442\u044C \u0438 \u043C\u0435\u0442\u0430\u0442\u044C, \u0437\u0430 \u043D\u0430\u0441 \u0434\u043E\u043B\u0436\u043D\u044B \u0433\u043E\u0432\u043E\u0440\u0438\u0442\u044C: "\u043E\u043D\u0438 \u0433\u0440\u0438\u0437\u043B\u0438 \u044D\u0442\u0443 \u0437\u0435\u043C\u043B\u044E \u0437\u0443\u0431\u0430\u043C\u0438", \u0430 \u043D\u0435 \u0441\u043F\u0430\u043B\u0438 \u0443 \u0441\u0435\u0431\u044F \u0432 \u043B\u043E\u0433\u043E\u0432\u0435.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0411\u0435\u0440\u043B\u043E\u0433\u0430 \u043D\u0430 \u0425\u0430\u0434\u0430\u0440\u0446\u0435\u0432\u0430
TASK_CODE_5=4C2V58
HINT_CODE_5=25JZ7e6c2kv29gsl8
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u041F\u043E\u0441\u043B\u0435 \u0441\u043F\u044F\u0447\u043A\u0438, \u0432\u043D\u043E\u0432\u044C \u043D\u0430\u0447\u0430\u043B\u0438\u0441\u044C \u043E\u0436\u0435\u0441\u0442\u043E\u0447\u0451\u043D\u043D\u044B\u0435 \u0431\u043E\u0438. \u0413\u043E\u0440\u043E\u0434 \u043F\u043E\u0433\u0440\u044F\u0437 \u0432 \u0445\u0430\u043E\u0441\u0435. \u041A\u0440\u0443\u0433\u043E\u043C \u0431\u044B\u043B\u0430 \u0440\u0430\u0437\u0440\u0443\u0445\u0430. \u041F\u0440\u0430\u043A\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u043A\u0430\u0436\u0434\u044B\u0439 \u0432\u0442\u043E\u0440\u043E\u0439 \u0436\u0438\u0442\u0435\u043B\u044C \u043E\u0441\u0442\u0430\u043B\u0441\u044F \u0431\u0435\u0437 \u043A\u0440\u044B\u0448\u0438 \u043D\u0430\u0434 \u0433\u043E\u043B\u043E\u0432\u043E\u0439. \u0417\u0430\u0432\u043E\u0434\u044B \u043D\u0435 \u0441\u043F\u0440\u0430\u0432\u043B\u044F\u043B\u0438\u0441\u044C \u0441 \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u0441\u0442\u0432\u043E\u043C. \u041F\u0440\u043E\u0442\u0438\u0432\u043D\u0438\u043A \u043F\u0440\u0435\u0432\u043E\u0441\u0445\u043E\u0434\u0438\u043B \u043D\u0430\u0441 \u0432\u043E \u0432\u0441\u0451\u043C. \u0415\u0433\u043E \u043E\u0440\u0443\u0436\u0438\u0435 \u0432\u044B\u043F\u0443\u0441\u043A\u0430\u044E\u0449\u0435\u0435 \u043E\u0433\u043D\u0435\u043D\u043D\u044B\u0435 \u0448\u0430\u0440\u044B, \u043F\u0440\u043E\u0431\u0438\u0432\u0430\u043B\u043E \u043B\u044E\u0431\u043E\u0435 \u0431\u0435\u0442\u043E\u043D\u043D\u043E\u0435 \u0441\u043E\u043E\u0440\u0443\u0436\u0435\u043D\u0438\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+,2
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0412\u0435\u0441\u044C \u0433\u043E\u0440\u043E\u0434 \u0431\u044B\u043B \u0432 \u043E\u0433\u043D\u0435. \u0411\u0438\u0442\u0432\u0430 \u0434\u043E\u0441\u0442\u0438\u0433\u0430\u043B\u0430 \u0441\u0432\u043E\u0435\u0433\u043E \u0430\u043F\u043E\u0433\u0435\u044F. \u0421 \u0434\u0440\u0443\u0433\u0438\u0445 \u0440\u0435\u0433\u0438\u043E\u043D\u043E\u0432 \u044D\u0448\u0435\u043B\u043E\u043D\u0430\u043C\u0438 \u043F\u0440\u0438\u0431\u044B\u0432\u0430\u043B\u043E \u043F\u043E\u0434\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0438\u0435. \u0422\u043E\u043D\u043D\u044B \u0431\u0435\u0442\u043E\u043D\u043D\u044B\u0445 \u0437\u0434\u0430\u043D\u0438\u0439 \u043F\u0440\u0435\u0432\u0440\u0430\u0442\u0438\u043B\u0438\u0441\u044C \u0432 \u0440\u0443\u0438\u043D\u044B. \u041A\u0440\u044B\u0448\u0438 \u0434\u043E\u043C\u043E\u0432 \u0441\u0440\u0430\u0432\u043D\u044F\u043B\u0438\u0441\u044C \u0441 \u0437\u0435\u043C\u043B\u0451\u0439.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u0436\u0430\u0440\u0441\u043A\u043E\u0433\u043E. \u0417\u0430 \u043C\u043E\u0441\u0442\u043E\u043C, \u043F\u0435\u0440\u0432\u044B\u0439 \u043A\u0440\u043E\u0432\u0435\u043B\u044C\u043D\u044B\u0439 \u0437\u0430\u0432\u043E\u0434.
TASK_CODE_6=5C148V
HINT_CODE_6=48J2Zdg5ya9qm8fxs4d
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u041D\u0435\u043F\u043E\u0434\u0430\u043B\u0435\u043A\u0443 \u0432 \u043D\u0435\u0431\u0435 \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u043B\u0438 \u043E\u0436\u0435\u0441\u0442\u043E\u0447\u0451\u043D\u043D\u044B\u0435 \u0431\u043E\u0438, \u0440\u0430\u0437\u0440\u044F\u0434\u044B \u044F\u0440\u043A\u0438\u0445 \u0432\u0441\u043F\u044B\u0448\u0435\u043A \u043F\u043E\u0445\u043E\u0436\u0438\u0445 \u043D\u0430 \u0441\u0430\u043B\u044E\u0442 \u043E\u0441\u0432\u0435\u0449\u0430\u043B\u0438 \u0432\u0435\u0441\u044C \u0433\u043E\u0440\u043E\u0434. \u041D\u0430\u0440\u043E\u0434 \u0431\u044B\u043B \u0432\u044B\u043C\u043E\u0442\u0430\u043D, \u0434\u043B\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u043D\u0430\u0445\u043E\u0434\u044F\u0441\u044C \u0431\u0435\u0437 \u0435\u0434\u044B. \u041C\u044B \u044F\u0432\u043D\u043E \u0443\u0441\u0442\u0443\u043F\u0430\u043B\u0438 \u043F\u0440\u043E\u0442\u0438\u0432\u043D\u0438\u043A\u0443. \u0421\u043E \u0441\u0442\u043E\u043B\u0438\u0446\u044B \u0438 \u0434\u0440\u0443\u0433\u0438\u0445 \u043A\u0440\u0443\u043F\u043D\u044B\u0445 \u0440\u0435\u0433\u0438\u043E\u043D\u043E\u0432 \u043C\u0438\u0440\u0430 \u043A \u043D\u0430\u043C \u043D\u0430\u043F\u0440\u0430\u0432\u043B\u044F\u043B\u0438\u0441\u044C \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u043E \u043E\u0431\u0443\u0447\u0435\u043D\u043D\u044B\u0435 \u0432\u043E\u0439\u0441\u043A\u0430. \u041E\u0447\u0430\u0433 \u0432\u0441\u0435\u0439 \u0431\u0438\u0442\u0432\u044B \u043D\u0430\u0445\u043E\u0434\u0438\u043B\u0441\u044F \u0438\u043C\u0435\u043D\u043D\u043E \u0442\u0443\u0442, \u0438 \u043D\u0430\u043C \u043D\u0438\u043A\u0430\u043A \u043D\u0435\u043B\u044C\u0437\u044F \u0431\u044B\u043B\u043E \u0443\u0441\u0442\u0443\u043F\u0430\u0442\u044C \u0432 \u044D\u0442\u043E\u043C \u0431\u043E\u044E. \u0417\u0434\u0435\u0441\u044C \u0440\u0435\u0448\u0430\u043B\u0430\u0441\u044C \u0441\u0443\u0434\u044C\u0431\u0430 \u0447\u0435\u043B\u043E\u0432\u0435\u0447\u0435\u0441\u0442\u0432\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+,1+
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0412\u0435\u0441\u044C \u0433\u043E\u0440\u043E\u0434 \u0431\u044B\u043B \u0437\u0430\u043B\u0438\u0442 \u0430\u043B\u043E\u0439 \u043A\u0440\u043E\u0432\u044C\u044E. \u041C\u044B \u0441\u0442\u0430\u043B\u0438 \u043F\u043E\u0442\u0438\u0445\u043E\u043D\u044C\u043A\u0443 \u043E\u0442\u0432\u043E\u0451\u0432\u044B\u0432\u0430\u0442\u044C \u0442\u0435\u0440\u0440\u0438\u0442\u043E\u0440\u0438\u044E \u0438 \u0432 \u043D\u0435\u0431\u0435 \u0438 \u043D\u0430 \u0437\u0435\u043C\u043B\u0435. \u0420\u0430\u0441\u043A\u0440\u044B\u0432 \u043F\u0430\u0440\u0443\u0441\u0430 \u043F\u043E \u043C\u043E\u0440\u044E \u043A \u043D\u0430\u043C \u0448\u043B\u043E \u0441\u043E\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E \u043D\u043E\u0432\u043E\u0435 \u043E\u0440\u0443\u0436\u0438\u0435 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0430\u043D\u043D\u043E\u0435 \u0432 \u0441\u0442\u043E\u043B\u0438\u0446\u0435. \u0418\u043C\u0435\u043D\u043D\u043E \u043E\u043D\u043E \u043C\u043E\u0433\u043B\u043E \u043E\u043A\u043E\u043D\u0447\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u043F\u043E\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u0442\u043E\u0447\u043A\u0443 \u0432 \u044D\u0442\u043E\u0439 \u0431\u0435\u0441\u043F\u043E\u0449\u0430\u0434\u043D\u043E\u0439 \u0432\u043E\u0439\u043D\u0435.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u0433\u043E\u043B \u041A\u0430\u043B\u0438\u043D\u0438\u043D\u0430 \u0438 \u041C\u043E\u0441\u043A\u043E\u0432\u0441\u043A\u043E\u0439.
TASK_CODE_7=C7362V
HINT_CODE_7=J731Zde3uv21bd78dy6hd5
BONUS_TASK=\u0411\u043E\u043D\u0443\u0441\u043D\u043E\u0435 \u0437\u0430\u0434\u0430\u043D\u0438\u0435\n\u0412 \u044D\u0442\u043E\u0439 \u0441\u0435\u0440\u044C\u0435\u0437\u043D\u043E\u0439 \u0431\u0438\u0442\u0432\u0435 \u043D\u0430\u0448 \u043D\u0430\u0440\u043E\u0434 \u0431\u044B\u043B \u043D\u0430 \u0432\u044B\u0441\u043E\u0442\u0435. \u041C\u044B \u0441\u043C\u043E\u0433\u043B\u0438 \u043F\u043E\u0431\u0435\u0434\u0438\u0442\u044C \u0431\u043B\u0430\u0433\u043E\u0434\u0430\u0440\u044F \u043D\u0430\u0432\u044B\u043A\u0430\u043C \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u043C\u044B \u043F\u0440\u043E\u0444\u0435\u0441\u0441\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E \u043D\u0430\u0443\u0447\u0438\u043B\u0438\u0441\u044C \u0437\u0430 \u0432\u0441\u0435 \u044D\u0442\u0438 \u0442\u0440\u0438 \u0433\u043E\u0434\u0430 \u0441\u0440\u0430\u0436\u0435\u043D\u0438\u0439. \u041C\u044B \u0434\u0430\u0436\u0435 \u0441\u043C\u043E\u0433\u043B\u0438 \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0438\u0445 \u043E\u0440\u0443\u0436\u0438\u0435\u043C \u0441\u0434\u0435\u043B\u0430\u043D\u043D\u044B\u043C \u0438\u0437 \u043D\u0435\u043F\u043E\u043D\u044F\u0442\u043D\u043E\u0433\u043E \u043C\u0435\u0442\u0430\u043B\u043B\u0430, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u043C\u044B \u0437\u0430\u0431\u0438\u0440\u0430\u043B\u0438 \u0443 \u043D\u0438\u0445 \u0432 \u0431\u043E\u044E, \u043C\u043E\u0436\u043D\u043E \u0441\u043A\u0430\u0437\u0430\u0442\u044C \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u043D\u043E\u0435 \u043D\u0430 \u043F\u0440\u043E\u043A\u0430\u0442.
BONUS_CODE=CV4142
BONUS_FIVE_MINUTES=KKGR8234F5AV3BN4SDA
BONUS_TEN_MINUTES=KfK5FH55Vhr5DDF
BONUS_FIFTEEN_MINUTES=Ou6dgt6wcx6itq6sre