#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="\u0411\u0435\u0433\u043B\u0435\u0446."\n\n\u0414\u043E\u043A\u0442\u043E\u0440 \u0420\u0438\u0447\u0430\u0440\u0434 \u041A\u0438\u043C\u0431\u043B, \u0447\u0438\u043A\u0430\u0433\u0441\u043A\u0438\u0439 \u0445\u0438\u0440\u0443\u0440\u0433, \u043B\u043E\u0436\u043D\u043E \u043E\u0431\u0432\u0438\u043D\u0435\u043D \u0432 \u0443\u0431\u0438\u0439\u0441\u0442\u0432\u0435 \u0441\u0432\u043E\u0435\u0439 \u0436\u0435\u043D\u044B. \u041F\u043E\u043B\u043D\u044B\u0439 \u0440\u0435\u0448\u0438\u043C\u043E\u0441\u0442\u0438 \u0434\u043E\u043A\u0430\u0437\u0430\u0442\u044C \u0441\u0432\u043E\u044E \u043D\u0435\u0432\u0438\u043D\u043E\u0432\u043D\u043E\u0441\u0442\u044C \u0434\u043E\u043A\u0442\u043E\u0440 \u0441\u043E\u0432\u0435\u0440\u0448\u0430\u0435\u0442 \u043F\u043E\u0431\u0435\u0433 \u0438\u0437 \u0442\u044E\u0440\u044C\u043C\u044B. \u041E\u043D \u0445\u043E\u0447\u0435\u0442 \u0441\u0430\u043C \u043F\u0440\u0438\u0432\u0435\u0441\u0442\u0438 \u0441\u0432\u043E\u0438\u0445 \u043F\u0440\u0435\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439 - \u0441\u043B\u0443\u0436\u0438\u0442\u0435\u043B\u0435\u0439 \u0437\u0430\u043A\u043E\u043D\u0430 - \u043A \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0435\u043C\u0443 \u0443\u0431\u0438\u0439\u0446\u0435.
START_CODE=run
START_DATE=12-07-2019
START_TIME=22-10
FIRST_HINT_TIMER=25
SECOND_HINT_TIMER=15
END_TASK_TIMER=20
BONUS_TASK_TIMER=40
BONUS_TASK_TIME=30
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0410\u0433\u0435\u043D\u0442)\n\u0420\u0438\u0447\u0430\u0440\u0434\u0430 \u043F\u0440\u0438\u0432\u0435\u0437\u043B\u0438 \u043D\u0430 \u0434\u043E\u043F\u0440\u043E\u0441! \u0412\u0441\u0435 \u0444\u0430\u043A\u0442\u044B \u0433\u043E\u0432\u043E\u0440\u0438\u043B\u0438 \u043E \u0442\u043E\u043C, \u0447\u0442\u043E \u0438\u043C\u0435\u043D\u043D\u043E \u043E\u043D \u0432\u0438\u043D\u043E\u0432\u0435\u043D \u0432 \u0443\u0431\u0438\u0439\u0441\u0442\u0432\u0435 \u0441\u0432\u043E\u0435\u0439 \u0441\u0443\u043F\u0440\u0443\u0433\u0438. \u0412\u0437\u043B\u043E\u043C\u0430 \u0434\u0432\u0435\u0440\u0438 \u043D\u0435 \u0431\u044B\u043B\u043E, \u043D\u0438\u043A\u0442\u043E \u043D\u0435 \u0443\u0433\u0440\u043E\u0436\u0430\u043B \u0435\u043C\u0443, \u043E\u0442\u043F\u0435\u0447\u0430\u0442\u043A\u0438 \u043F\u0430\u043B\u044C\u0446\u0435\u0432 \u043D\u0430 \u043C\u0435\u0442\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u043C \u043E\u0440\u0443\u0436\u0438\u0438 \u043F\u0440\u0438\u043D\u0430\u0434\u043B\u0435\u0436\u0430\u043B\u0438 \u0435\u043C\u0443, \u0430 \u043F\u0440\u043E\u043A\u0443\u0440\u043E\u0440 \u0441 \u0443\u0441\u043C\u0435\u0448\u043A\u043E\u0439 \u043E\u0442\u043D\u043E\u0441\u0438\u043B\u0441\u044F \u043A \u0441\u043B\u043E\u0432\u0430\u043C \u041A\u0438\u043C\u0431\u043B\u0430 \u043F\u043E \u043F\u043E\u0432\u043E\u0434\u0443 \u0434\u0440\u0430\u043A\u0438 \u0441 \u043E\u0434\u043D\u043E\u0440\u0443\u043A\u0438\u043C. \u0420\u0438\u0447\u0430\u0440\u0434 \u0434\u0430\u043B \u043F\u043E\u043A\u0430\u0437\u0430\u043D\u0438\u044F, \u0447\u0442\u043E \u0443 \u043D\u0430\u043F\u0430\u0434\u0430\u0432\u0448\u0435\u0433\u043E \u0431\u044B\u043B \u043F\u0440\u043E\u0442\u0435\u0437, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043E\u043D \u0441\u043C\u043E\u0433 \u0432\u044B\u0434\u0435\u0440\u043D\u0443\u0442\u044C \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0434\u0440\u0430\u043A\u0438. \u0423 \u043D\u0435\u0433\u043E \u0431\u044B\u043B\u0430 \u043C\u0435\u0445\u0430\u043D\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u0440\u0443\u043A\u0430, \u043D\u0430\u0439\u0434\u0438\u0442\u0435 \u0435\u0433\u043E, \u043D\u0430\u0439\u0434\u0438\u0442\u0435 - \u044D\u0442\u043E \u0432\u0441\u0451, \u0447\u0442\u043E \u0420\u0438\u0447\u0430\u0440\u0434 \u043C\u043E\u0433 \u0441\u043A\u0430\u0437\u0430\u0442\u044C \u043D\u0430 \u0434\u043E\u043F\u0440\u043E\u0441\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0415\u0441\u043B\u0438 \u0431\u044B \u043F\u0440\u043E\u043A\u0443\u0440\u0430\u0442\u0443\u0440\u0430 \u0431\u044B\u043B\u0430 \u0431\u043E\u043B\u0435\u0435 \u0432\u043D\u0438\u043C\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0439, \u043E\u043D\u0438 \u0431\u044B \u043F\u0440\u0438\u0441\u043B\u0443\u0448\u0430\u043B\u0438\u0441\u044C \u043A \u0420\u0438\u0447\u0430\u0440\u0434\u0443 \u0438 \u0441\u0440\u0430\u0437\u0443 \u043F\u043E\u043D\u044F\u043B\u0438, \u0447\u0442\u043E \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0438\u0439 \u0443\u0431\u0438\u0439\u0446\u0430 \u0431\u044B\u043B \u0441\u043E\u0432\u0441\u0435\u043C \u0440\u044F\u0434\u043E\u043C, \u0442\u0435\u043C \u0431\u043E\u043B\u0435\u0435 \u043E\u043D \u0431\u044B\u043B \u043F\u043E\u043B\u0438\u0446\u0435\u0439\u0441\u043A\u0438\u043C, \u0430 \u043F\u043E\u043B\u0438\u0446\u0435\u0439\u0441\u043A\u0438\u0445 \u0441 \u043F\u0440\u043E\u0442\u0435\u0437\u043E\u043C \u043D\u0435 \u0442\u0430\u043A \u0443\u0436 \u0438 \u043C\u043D\u043E\u0433\u043E.
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0443\u0448\u043A\u0438\u043D\u0441\u043A\u0430\u044F 5, \u043F\u0440\u043E\u0442\u0435\u0437\u043D\u043E-\u043E\u0440\u0442\u043E\u043F\u0435\u0434\u0438\u0447\u0435\u0441\u043A\u043E\u0435 \u043F\u0440\u0435\u0434\u043F\u0440\u0438\u044F\u0442\u0438\u0435 \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u043F\u0440\u043E\u043A\u0443\u0440\u0430\u0442\u0443\u0440\u044B.
TASK_CODE_1=P8965R
HINT_CODE_1=T7SDFE212G7SD
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0421\u0443\u0434 \u0432\u044B\u043D\u0435\u0441 \u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u0442\u0438\u0432 \u0420\u0438\u0447\u0430\u0440\u0434\u0430 \u0438 \u043F\u0440\u0438\u0433\u043E\u0432\u043E\u0440\u0438\u043B \u0435\u0433\u043E \u043A \u0441\u043C\u0435\u0440\u0442\u043D\u043E\u0439 \u043A\u0430\u0437\u043D\u0438, \u0447\u0435\u0440\u0435\u0437 \u0432\u0432\u043E\u0434 \u0441\u043C\u0435\u0440\u0442\u0435\u043B\u044C\u043D\u043E\u0439 \u0438\u043D\u044A\u0435\u043A\u0446\u0438\u0438. \u0418 \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u043B \u0435\u0433\u043E \u0432 \u0442\u044E\u0440\u044C\u043C\u0443 \u0431\u043E\u0440\u0430 \u0448\u0442\u0430\u0442\u0430 \u0418\u043B\u043B\u0438\u043D\u043E\u0439\u0441. \u0412\u043C\u0435\u0441\u0442\u0435 \u0441 \u041A\u0438\u043C\u0431\u043B\u043E\u043C \u0442\u0443\u0434\u0430 \u0436\u0435 \u043F\u0435\u0440\u0435\u0432\u043E\u0437\u0438\u043B\u0438 \u0435\u0449\u0451 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043E\u0441\u0443\u0436\u0434\u0435\u043D\u043D\u044B\u0445, \u0437\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u043C\u0438 \u0431\u044B\u043B\u0438 \u0441\u043E\u0442\u043D\u0438 \u0442\u0440\u0443\u043F\u043E\u0432. \u0414\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0437\u0430\u043A\u043B\u044E\u0447\u0451\u043D\u043D\u044B\u0445 \u0434\u043E \u0442\u044E\u0440\u044C\u043C\u044B \u0431\u044B\u043B\u043E \u0440\u0435\u0448\u0435\u043D\u043E \u0430\u0432\u0442\u043E\u0431\u0443\u0441\u043E\u043C. \u041D\u0435 \u0441\u0430\u043C\u043E\u0435 \u0443\u0434\u0430\u0447\u043D\u043E\u0435 \u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u0432 \u0432\u044B\u0431\u043E\u0440\u0435 \u0442\u0440\u0430\u043D\u0441\u043F\u043E\u0440\u0442\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,2
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0435\u043B\u044C\u0437\u044F \u0441\u043A\u0430\u0437\u0430\u0442\u044C, \u0447\u0442\u043E \u043E\u0442\u043D\u043E\u0448\u0435\u043D\u0438\u0435 \u043A \u043D\u0438\u043C \u0431\u044B\u043B\u043E \u043A\u0430\u043A \u043A \u0431\u0430\u0440\u0430\u043D\u0430\u043C, \u0430\u0432\u0442\u043E\u0431\u0443\u0441 \u0431\u044B\u043B \u0434\u043E\u0432\u043E\u043B\u044C\u043D\u043E \u043A\u043E\u043C\u0444\u043E\u0440\u0442\u043D\u044B\u043C, \u0434\u0430 \u0438 \u0431\u044B\u043B\u043E \u0438\u0445 \u0432\u0441\u0435\u0433\u043E \u0447\u0435\u0442\u0432\u0435\u0440\u043E, \u0441\u0438\u0434\u0435\u0442\u044C \u0431\u044B\u043B\u043E \u0434\u043E\u0432\u043E\u043B\u044C\u043D\u043E \u0443\u0434\u043E\u0431\u043D\u043E, \u0434\u043B\u044F \u043B\u044E\u0434\u0435\u0439 \u0441 \u0443\u0439\u043C\u043E\u0439 \u0441\u043C\u0435\u0440\u0442\u0435\u0439 \u0437\u0430 \u0441\u043F\u0438\u043D\u043E\u0439 \u0434\u0430\u0436\u0435 \u0447\u0435\u0440\u0435\u0437 \u0447\u0443\u0440 \u043A\u043E\u043C\u0444\u043E\u0440\u0442\u043D\u043E. \u041E\u0441\u0442\u0430\u043B\u043E\u0441\u044C \u0438\u043C \u0432\u043A\u043B\u044E\u0447\u0438\u0442\u044C \u043F\u0435\u0441\u043D\u044E \u041A\u0440\u0443\u0433\u0430 \u0412\u043B\u0430\u0434\u0438\u043C\u0438\u0440\u0441\u043A\u0438\u0439 \u0446\u0435\u043D\u0442\u0440\u0430\u043B \u0432\u0435\u0442\u0435\u0440 \u0441\u0435\u0432\u0435\u0440\u043D\u044B\u0439, \u0438 \u043C\u043E\u0436\u043D\u043E \u0431\u044B\u043B\u043E \u0431\u044B \u043F\u043E\u0434\u0443\u043C\u0430\u0442\u044C, \u0447\u0442\u043E \u0438\u0445 \u0432\u0435\u0437\u0443\u0442 \u043D\u0430 \u043A\u0443\u0440\u043E\u0440\u0442.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0435\u0432\u0435\u0440\u043D\u043E\u0435 \u043A\u043B\u0430\u0434\u0431\u0438\u0449\u0435, \u043D\u0430 \u0412\u043B\u0430\u0434\u0438\u0432\u043E\u0441\u0442\u043E\u043A\u0441\u043A\u043E\u0439 \u0443\u043B\u0438\u0446\u0435.
TASK_CODE_2=P4561R
HINT_CODE_2=J351Zdg452achhfw
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u041F\u043E\u0441\u043B\u0435 \u0437\u0430\u0432\u0430\u0440\u0443\u0448\u043A\u0438 \u0443\u0441\u0442\u0440\u043E\u0435\u043D\u043D\u043E\u0439 \u0437\u0435\u043A\u0430\u043C\u0438 \u0432 \u0430\u0432\u0442\u043E\u0431\u0443\u0441\u0435, \u0420\u0438\u0447\u0430\u0440\u0434\u0443 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0441\u0431\u0435\u0436\u0430\u0442\u044C. \u041D\u043E \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u043F\u043E\u0431\u0435\u0433\u0430 \u043E\u043D \u043F\u043E\u043B\u0443\u0447\u0438\u043B \u0442\u0440\u0430\u0432\u043C\u0443. \u0420\u0430\u043D\u0430 \u043A\u0440\u043E\u0432\u043E\u0442\u043E\u0447\u0438\u043B\u0430 \u0438 \u0435\u043C\u0443 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0431\u044B\u043B\u043E \u0441\u0440\u043E\u0447\u043D\u043E \u043F\u043E\u043F\u0430\u0441\u0442\u044C \u0432 \u0431\u043E\u043B\u044C\u043D\u0438\u0446\u0443. \u0412\u044B\u0441\u043A\u043E\u0447\u0438\u0432 \u043D\u0430 \u0434\u043E\u0440\u043E\u0433\u0443 \u043E\u043D \u0442\u0443\u0442 \u0436\u0435 \u043E\u043A\u0430\u0437\u044B\u0432\u0430\u043B\u0441\u044F \u0432 \u043F\u043E\u043B\u0435 \u0437\u0440\u0435\u043D\u0438\u044F \u043F\u043E\u043B\u0438\u0446\u0438\u0438, \u043D\u043E \u043E\u0442\u0441\u0442\u0443\u043F\u0430\u0442\u044C \u0431\u044B\u043B\u043E \u043D\u0435\u043B\u044C\u0437\u044F, \u043E\u043D \u0432\u044B\u043D\u0443\u0436\u0434\u0435\u043D \u0431\u044B\u043B \u0437\u0430\u0449\u0438\u0449\u0430\u0442\u044C\u0441\u044F. \u0415\u043C\u0443 \u0432\u043E \u0447\u0442\u043E\u0431\u044B \u0442\u043E \u043D\u0438 \u0441\u0442\u0430\u043B\u043E \u0441\u043B\u0435\u0434\u043E\u0432\u0430\u043B\u043E \u043D\u0430\u0439\u0442\u0438 \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0435\u0433\u043E \u0443\u0431\u0438\u0439\u0446\u0443 \u0438 \u0437\u0430\u0449\u0438\u0442\u0438\u0442\u044C \u0441\u0432\u043E\u044E \u0447\u0435\u0441\u0442\u044C. \u0418 \u041A\u0438\u043C\u0431\u043B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u043B \u0441\u0432\u043E\u0439 \u043F\u0443\u0442\u044C, \u0434\u043E\u0440\u043E\u0433\u0430 \u0432\u0434\u043E\u043B\u044C \u0440\u0435\u043A\u0438 \u043F\u043B\u0430\u0432\u043D\u043E \u043F\u0435\u0440\u0435\u0445\u043E\u0434\u0438\u043B\u0430 \u0432 \u0448\u043E\u0441\u0441\u0435, \u0438 \u0435\u0433\u043E \u0442\u0443\u0442 \u0436\u0435 \u0437\u0430\u0441\u0435\u043A\u043B\u0438. \u041E\u043D \u043F\u043E\u043D\u0438\u043C\u0430\u043B, \u0447\u0442\u043E \u0434\u0432\u0438\u0433\u0430\u0442\u044C\u0441\u044F \u043F\u043E \u0448\u043E\u0441\u0441\u0435 \u0431\u044B\u043B\u043E \u043E\u043F\u0430\u0441\u043D\u043E, \u043D\u043E \u044D\u0442\u043E \u0431\u044B\u043B \u0435\u0434\u0438\u043D\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0439 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u044B\u0439 \u043F\u0443\u0442\u044C.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,2+
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0430 \u0448\u043E\u0441\u0441\u0435 \u043F\u0440\u044F\u043C\u043E \u0443 \u0434\u043E\u0440\u043E\u0433\u0438 \u0440\u0430\u0437\u0432\u0438\u0432\u0430\u043B\u0441\u044F \u0444\u043B\u0430\u0433 \u0441 \u0433\u043E\u0440\u043D\u043E\u0441\u0442\u0430\u0435\u043C, \u0420\u0438\u0447\u0430\u0440\u0434 \u0437\u043D\u0430\u043B \u0447\u0442\u043E \u0434\u0440\u0443\u0433\u043E\u0433\u043E \u043F\u0443\u0442\u0438 \u043D\u0435\u0442. \u0411\u043E\u043B\u044C\u043D\u0438\u0446\u0430 \u043D\u0430\u0445\u043E\u0434\u0438\u043B\u0430\u0441\u044C \u043D\u0430 \u044E\u0433\u0435 \u0438 \u044D\u0442\u043E \u0448\u043E\u0441\u0441\u0435 \u0431\u044B\u043B\u043E \u0435\u0433\u043E \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0439 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C\u044E.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u0441. \u042E\u0436\u043D\u044B\u0439. \u0422\u0430\u0440\u0441\u043A\u043E\u0435 \u0448\u043E\u0441\u0441\u0435.
TASK_CODE_3=82P7R4
HINT_CODE_3=JZ85s5dfs3whm732dxu
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n\u0422\u0435\u043F\u0435\u0440\u044C \u041A\u0438\u043C\u0431\u043B\u0443 \u0441\u043B\u0435\u0434\u043E\u0432\u0430\u043B\u043E \u0441\u0440\u043E\u0447\u043D\u043E \u043D\u0430\u0439\u0442\u0438 \u043B\u044E\u0434\u0435\u0439 \u0441 \u0442\u043E\u0447\u043D\u043E \u0442\u0430\u043A\u0438\u043C\u0438 \u0436\u0435 \u043F\u0440\u043E\u0442\u0435\u0437\u0430\u043C\u0438 \u043A\u0430\u043A \u0431\u044B\u043B\u0438 \u0443 \u0443\u0431\u0438\u0439\u0446\u044B. \u0414\u043E\u0431\u0440\u0430\u0432\u0448\u0438\u0441\u044C \u0434\u043E \u043A\u043E\u043C\u043F\u044C\u044E\u0442\u0435\u0440\u0430, \u043D\u0430 \u0437\u0430\u043F\u0440\u043E\u0441 \u043E \u043B\u044E\u0434\u044F\u0445 \u0438\u043C\u0435\u044E\u0449\u0438\u0445 \u043F\u043E\u0445\u043E\u0436\u0438\u0439 \u043F\u0440\u043E\u0442\u0435\u0437 \u0435\u043C\u0443 \u0432\u044B\u0434\u0430\u043B\u043E 4 \u0432\u0430\u0440\u0438\u0430\u043D\u0442\u0430. \u041F\u043E\u043B\u0443\u0447\u0438\u0432 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E, \u0420\u0438\u0447\u0430\u0440\u0434 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442\u0441\u044F \u043A \u0441\u0435\u0431\u0435 \u0432 \u043D\u043E\u043C\u0435\u0440, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043E\u043D \u0441\u043D\u044F\u043B \u0434\u043B\u044F \u043D\u043E\u0447\u043B\u0435\u0433\u0430 \u0433\u0434\u0435-\u0442\u043E \u043D\u0430 \u043E\u043A\u0440\u0430\u0438\u043D\u0435. \u0425\u043E\u0437\u044F\u0435\u0432\u0430 \u043D\u0435 \u0433\u043E\u0432\u043E\u0440\u0438\u043B\u0438 \u043D\u0430 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u043E\u043C, \u043D\u043E \u0435\u0433\u043E \u044D\u0442\u043E \u043D\u0435 \u0441\u043C\u0443\u0442\u0438\u043B\u043E, \u0445\u043E\u0442\u044F \u0437\u043D\u0430\u043D\u0438\u0435 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u043E\u0433\u043E \u0438\u043C \u0431\u044B \u043D\u0435 \u043F\u043E\u043C\u0435\u0448\u0430\u043B\u043E. \u041A\u0430\u043A \u0442\u043E\u043B\u044C\u043A\u043E \u0420\u0438\u0447\u0430\u0440\u0434 \u043F\u0440\u0438\u0448\u0451\u043B \u043E\u0442\u0434\u043E\u0445\u043D\u0443\u0442\u044C, \u0432 \u0434\u043E\u043C \u0432\u043E\u0440\u0432\u0430\u043B\u0438\u0441\u044C \u043F\u043E\u043B\u0438\u0446\u0435\u0439\u0441\u043A\u0438\u0435, \u043D\u043E \u043E\u043A\u0430\u0437\u0430\u043B\u043E\u0441\u044C, \u0447\u0442\u043E \u043F\u0440\u0438\u0448\u043B\u0438 \u043D\u0435 \u0437\u0430 \u043D\u0438\u043C, \u0430 \u0437\u0430 \u0441\u044B\u043D\u043E\u043C \u0445\u043E\u0437\u044F\u0439\u043A\u0438, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043F\u043E\u0445\u0438\u0442\u0438\u043B \u0431\u0440\u0438\u043B\u043B\u0438\u0430\u043D\u0442. \u0412 \u044D\u0442\u043E\u0442 \u0440\u0430\u0437 \u041A\u0438\u043C\u0431\u043B\u0443 \u043A\u0440\u0443\u043F\u043D\u043E \u043F\u043E\u0432\u0435\u0437\u043B\u043E.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041A\u0435\u0440\u0440, \u043F\u043E-\u043C\u043E\u0435\u043C\u0443 \u0442\u0430\u043A \u0437\u0432\u0430\u043B\u0438 \u0445\u043E\u0437\u044F\u0439\u043A\u0443 \u044D\u0442\u043E\u0433\u043E \u043C\u0438\u043D\u0438 \u043E\u0442\u0435\u043B\u044F, \u043F\u044B\u0442\u0430\u043B\u0430\u0441\u044C \u043A\u0440\u0438\u0447\u0430\u0442\u044C \u043D\u0430 \u043F\u043E\u043B\u0438\u0446\u0435\u0439\u0441\u043A\u0438\u0445 \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0434\u0430\u0436\u0435 \u043D\u0435 \u043F\u043E\u043F\u044B\u0442\u0430\u043B\u0438\u0441\u044C \u043D\u0430\u0439\u0442\u0438 \u043F\u0440\u043E\u043F\u0430\u0432\u0448\u0438\u0439 \u0431\u0440\u0438\u043B\u043B\u0438\u0430\u043D\u0442. \u0418\u043C \u0431\u044B\u043B\u043E \u0432\u0441\u0451 \u0440\u0430\u0432\u043D\u043E, \u0442\u0435\u043C \u0431\u043E\u043B\u0435\u0435 \u0445\u043E\u0437\u044F\u0439\u043A\u0430 \u043A\u0440\u0438\u0447\u0430\u043B\u0430 \u043D\u0430 \u0441\u0432\u043E\u0451\u043C \u044F\u0437\u044B\u043A\u0435, \u0430 \u043E\u043D \u044F\u0432\u043D\u043E \u043E\u0442\u043B\u0438\u0447\u0430\u043B\u0441\u044F \u043E\u0442 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u043E\u0433\u043E.
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041E\u0442\u0435\u043B\u044C \u0414\u0438\u0430\u043C\u043E\u043D\u0434, \u0421\u0442\u0430\u0432\u0440\u043E\u043F\u043E\u043B\u044C\u0441\u043A\u0430\u044F 4
TASK_CODE_4=26PR91
HINT_CODE_4=129JZs5sf2dx8
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u0427\u0442\u043E\u0431\u044B \u0441\u043A\u0440\u044B\u0442\u044C\u0441\u044F \u043E\u0442 \u043F\u0440\u0435\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u043D\u0438\u044F, \u0420\u0438\u0447\u0430\u0440\u0434 \u0432\u043B\u0438\u043B\u0441\u044F \u0432 \u0442\u043E\u043B\u043F\u0443 \u0418\u0440\u043B\u0430\u043D\u0434\u0446\u0435\u0432, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0447\u0442\u043E-\u0442\u043E \u043A\u0440\u0438\u0447\u0430\u043B\u0438 \u043D\u0430 \u0441\u0432\u043E\u0451\u043C \u043D\u0435\u043F\u043E\u043D\u044F\u0442\u043D\u043E\u043C \u044F\u0437\u044B\u043A\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u0435\u0440\u0435\u0432\u043E\u0434 \u043E\u043A\u0430\u0437\u0430\u043B\u0441\u044F \u043B\u0451\u0433\u043A\u0438\u043C, \u0442\u0435\u043F\u0435\u0440\u044C \u0441\u0442\u043E\u0438\u043B\u043E \u0432\u0435\u0440\u043D\u0443\u0442\u044C\u0441\u044F \u043A \u043F\u0435\u0440\u0432\u043E\u043C\u0443 \u0440\u0438\u0441\u0443\u043D\u043A\u0443 \u0438 \u0432\u043D\u0438\u043C\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0447\u0442\u043E \u0442\u0430\u043C \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u043E.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B\u0438\u0446\u0430 \u041D\u0430\u0433\u043E\u0440\u043D\u0430\u044F, \u0441\u044A\u0435\u0437\u0434 \u0441 \u0413\u0430\u0434\u0438\u0435\u0432\u0430
TASK_CODE_5=P17R34
HINT_CODE_5=25JZ7e6c2kv29gsl8
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0421\u0443\u043C\u0435\u0432 \u0443\u0439\u0442\u0438 \u043E\u0442 \u043F\u0440\u0435\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u043D\u0438\u044F \u0420\u0438\u0447\u0430\u0440\u0434 \u043D\u0430\u043F\u0440\u0430\u0432\u0438\u043B\u0441\u044F \u0438\u0441\u043A\u0430\u0442\u044C \u0434\u043E\u043C \u0443\u0431\u0438\u0439\u0446\u044B. \u0423\u0436\u0435 \u0441\u043F\u0443\u0441\u0442\u044F \u043A\u0430\u043A\u043E\u0435-\u0442\u043E \u0432\u0440\u0435\u043C\u044F \u043E\u043D \u043E\u043A\u0430\u0437\u0430\u043B\u0441\u044F \u043D\u0430 \u043C\u0435\u0441\u0442\u0435, \u0432 \u0434\u043E\u043C\u0435 \u0431\u044B\u043B \u0431\u0430\u0440\u0434\u0430\u043A, \u043F\u043E\u0432\u0441\u044E\u0434\u0443 \u0431\u044B\u043B\u0438 \u0440\u0430\u0437\u0431\u0440\u043E\u0441\u0430\u043D\u044B \u0432\u0435\u0449\u0438, \u043E\u0441\u0442\u0430\u0442\u043A\u0438 \u043F\u0438\u0449\u0438, \u043A\u0443\u0440\u0430\u0433\u0430, \u043A\u0430\u043A\u0438\u0435-\u0442\u043E \u0431\u0443\u043C\u0430\u0436\u043A\u0438, \u043A\u0440\u0430\u043D \u043F\u0440\u043E\u0442\u0435\u043A\u0430\u043B, \u044F\u0432\u043D\u043E \u0431\u044B\u043B\u043E \u0432\u0438\u0434\u043D\u043E, \u0447\u0442\u043E \u0441\u0430\u043D\u0442\u0435\u0445\u043D\u0438\u043A\u0443 \u0434\u0430\u0432\u043D\u043E \u043D\u0430 \u043C\u0435\u043D\u044F\u043B\u0438. \u0416\u0430\u0440\u0430 \u043D\u0435 \u0434\u0430\u0432\u0430\u043B\u0430 \u043F\u043E\u043A\u043E\u044F, \u043D\u043E \u0420\u0438\u0447\u0430\u0440\u0434 \u0431\u044B\u043B\u043E \u0432\u0441\u0451 \u0440\u0430\u0432\u043D\u043E, \u0435\u0433\u043E \u0446\u0435\u043B\u044C\u044E \u0431\u044B\u043B \u0445\u043E\u0437\u044F\u0438\u043D \u0434\u043E\u043C\u0430. \u041E\u043D \u043D\u0430\u0448\u0451\u043B \u0444\u043E\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u0438 \u043D\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0431\u044B\u043B \u0435\u0433\u043E \u0434\u0440\u0443\u0433 \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u0443\u0431\u0438\u0439\u0446\u0435\u0439.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,2
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0420\u0430\u0441\u043A\u0438\u0434\u0430\u0432 \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u043E\u0441\u0442\u0430\u0442\u043A\u0438 \u043A\u0443\u0440\u0430\u0433\u0438, \u041A\u0438\u043C\u0431\u043B \u043D\u0430\u0447\u0430\u043B \u0431\u043E\u043B\u0435\u0435 \u0434\u0435\u0442\u0430\u043B\u044C\u043D\u043E \u0438\u0437\u0443\u0447\u0430\u0442\u044C \u043E\u0431\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u0443. \u042D\u0442\u043E\u0442 \u043D\u0430\u0434\u043E\u0435\u0434\u043B\u0438\u0432\u044B\u0439 \u0444\u0440\u0443\u043A\u0442 \u0431\u044B\u043B \u0437\u0434\u0435\u0441\u044C \u043F\u043E\u0432\u0441\u044E\u0434\u0443.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041C\u043E\u0441\u043A\u043E\u0432\u0441\u043A\u0430\u044F 8 "\u0410\u0431\u0440\u0438\u043A\u043E\u0441"
TASK_CODE_6=P1936R
HINT_CODE_6=48J2Zdg5ya9qm8fxs4d
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\u0420\u0438\u0447\u0430\u0440\u0434 \u0437\u0430\u0433\u043B\u044F\u043D\u0443\u043B \u0432 \u0448\u043A\u0430\u0444 \u0438 \u0434\u043E\u0441\u0442\u0430\u043B \u0430\u043B\u044C\u0431\u043E\u043C, \u0433\u0434\u0435 \u0441\u0440\u0435\u0434\u0438 \u0444\u043E\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u0439 \u043B\u0435\u0436\u0430\u043B \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0439 \u043B\u0438\u0441\u0442\u0438\u043A \u0441 \u043A\u0430\u043A\u0438\u043C-\u0442\u043E \u0446\u0438\u0444\u0440\u0430\u043C\u0438, \u043F\u043E\u0445\u043E\u0436\u0438\u0439 \u043D\u0430 \u043D\u0435\u043A\u0438\u0439 \u043A\u043E\u0434. \u041F\u043E\u043D\u044F\u0432, \u0447\u0442\u043E \u043E\u0437\u043D\u0430\u0447\u0430\u0435\u0442 \u044D\u0442\u043E\u0442 \u0448\u0438\u0444\u0440 \u0420\u0438\u0447\u0430\u0440\u0434 \u043E\u0441\u043E\u0437\u043D\u0430\u043B, \u0447\u0442\u043E \u043D\u0430\u0441\u0442\u043E\u044F\u0449\u0438\u0439 \u0437\u0430\u043A\u0430\u0437\u0447\u0438\u043A \u0443\u0431\u0438\u0439\u0441\u0442\u0432\u0430 \u0432\u0441\u0435\u0433\u0434\u0430 \u0431\u044B\u043B \u0440\u044F\u0434\u043E\u043C. \u0422\u0435\u043F\u0435\u0440\u044C \u043E\u043D \u0442\u043E\u0447\u043D\u043E \u0437\u043D\u0430\u043B \u043A\u0443\u0434\u0430 \u0435\u043C\u0443 \u0434\u0432\u0438\u0433\u0430\u0442\u044C\u0441\u044F \u0434\u0430\u043B\u044C\u0448\u0435, \u0442\u0435\u043C \u0431\u043E\u043B\u0435\u0435 \u0434\u043E \u043C\u0435\u0441\u0442\u0430 \u0431\u044B\u043B\u043E \u0432\u0441\u0435\u0433\u043E 10 \u043C\u0438\u043D\u0443\u0442.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0420\u0430\u0437\u043D\u044B\u0435 \u0441\u0438\u0441\u0442\u0435\u043C\u044B \u0438\u0441\u0447\u0438\u0441\u043B\u0435\u043D\u0438\u044F, \u0432\u0441\u0435\u0433\u0434\u0430 \u0434\u0430\u044E\u0442 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0441\u043F\u0440\u044F\u0442\u0430\u0442\u044C \u0447\u0442\u043E-\u0442\u043E \u043D\u0443\u0436\u043D\u043E\u0435. \u041D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043F\u043E\u0442\u0435\u0440\u044F\u043D\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0420\u0438\u0447\u0430\u0440\u0434 \u043F\u043E\u043D\u0438\u043C\u0430\u043B, \u0447\u0442\u043E \u0432\u0441\u0451 \u0440\u0430\u0432\u043D\u043E \u0443\u0441\u043F\u0435\u0435\u0442, 10 \u043C\u0438\u043D\u0443\u0442 \u043D\u0435 \u0442\u0430\u043A \u0443\u0436 \u0438 \u0434\u043E\u043B\u0433\u043E.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n42.981886, 44.655922
TASK_CODE_7=P62R41
HINT_CODE_7=J731Zde3uv21bd78dy6hd5
BONUS_TASK=\u0411\u043E\u043D\u0443\u0441\u043D\u043E\u0435 \u0437\u0430\u0434\u0430\u043D\u0438\u0435\n\u041E\u0447\u0435\u043D\u044C \u0445\u043E\u0440\u043E\u0448\u043E , \u0447\u0442\u043E \u043C\u0430\u0440\u0448\u0430\u043B \u0421\u0430\u043C\u044E\u044D\u043B \u0414\u0436\u0435\u0440\u0430\u0440\u0434 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0432\u0441\u0435 \u043D\u0430\u0437\u044B\u0432\u0430\u043B\u0438 \u0431\u043E\u043B\u044C\u0448\u043E\u0439 \u0431\u0440\u0430\u0442, \u0441\u043C\u043E\u0433 \u0440\u0430\u0437\u043E\u0431\u0440\u0430\u0442\u044C\u0441\u044F \u0432\u043E \u0432\u0441\u0435\u0445 \u0442\u043E\u043D\u043A\u043E\u0441\u0442\u044F\u0445 \u0441\u043B\u043E\u0436\u0438\u0432\u0448\u0435\u0439\u0441\u044F \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u0438 \u0438 \u043F\u043E\u043C\u043E\u0433 \u0420\u0438\u0447\u0430\u0440\u0434\u0443 \u0438\u0437\u0431\u0435\u0436\u0430\u0442\u044C \u043D\u0430\u043A\u0430\u0437\u0430\u043D\u0438\u044F. \u041D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u0442\u043E, \u0447\u0442\u043E \u0432 \u043E\u0434\u0438\u043D \u043C\u043E\u043C\u0435\u043D\u0442 \u0421\u0430\u043C\u044E\u044D\u043B \u0441\u043A\u0430\u0437\u0430\u043B \u041A\u0438\u043C\u0431\u043B\u0443, \u0447\u0442\u043E \u0435\u043C\u0443 \u043D\u0430\u043F\u043B\u0435\u0432\u0430\u0442\u044C \u043D\u0430 \u043D\u0435\u0433\u043E. \u0412\u0438\u0434 \u0443 \u0420\u0438\u0447\u0430\u0440\u0434\u0430 \u0431\u044B\u043B \u043A\u043E\u043D\u0435\u0447\u043D\u043E \u043D\u0435 \u043E\u0447\u0435\u043D\u044C, \u0435\u043C\u0443 \u044F\u0432\u043D\u043E \u043D\u0435 \u0445\u0432\u0430\u0442\u0430\u043B\u043E \u0431\u0430\u043B\u044C\u0431\u043E \u043D\u0430 \u043B\u0438\u0446\u0435.
BONUS_CODE=P7124R
BONUS_FIVE_MINUTES=dan4ted4sfa4ssr
BONUS_TEN_MINUTES=Ndd4tw52vx84sws
BONUS_FIFTEEN_MINUTES=Ou6dgt6wcx6itq6sre