#Sun Sep 17 21:30:01 MSK 2017
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0441 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0414\u043E \u0441\u0430\u043C\u043E\u0433\u043E \u0432\u0435\u0441\u0435\u043B\u043E\u0433\u043E \u0435\u0449\u0435 \u0434\u0430\u043B\u0435\u043A\u043E. \u041D\u0430 \u043F\u043E\u043B\u043A\u0435 \u0441\u0442\u043E\u044F\u043B\u0430 \u0444\u043E\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u044F \u0441 \u043F\u0430\u043C\u044F\u0442\u043D\u0438\u043A\u043E\u043C, \u043C\u043D\u043E\u0433\u0438\u0435 \u0445\u043E\u0442\u0435\u043B\u0438 \u0431\u044B \u0438\u043C\u0435\u0442\u044C \u0442\u0430\u043A\u043E\u0435 \u0444\u043E\u0442\u043E. \u0414\u0436\u0435\u0440\u043E\u043C, \u043D\u0435 \u0441\u043F\u0435\u0448\u0430, \u043D\u0430\u0442\u044F\u0433\u0438\u0432\u0430\u043B \u0441\u0432\u043E\u0439 \u043A\u043E\u0441\u0442\u044E\u043C, \u0441\u043E\u0431\u0438\u0440\u0430\u044F\u0441\u044C \u0437\u0432\u043E\u043D\u0438\u0442\u044C \u0441\u0432\u043E\u0435\u043C\u0443 \u0434\u0440\u0443\u0433\u0443. \u041E\u043D \u043F\u043E\u043C\u043D\u0438\u043B \u043D\u043E\u043C\u0435\u0440 \u043D\u0430\u0438\u0437\u0443\u0441\u0442\u044C, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u043C\u0430\u0448\u0438\u043D\u0430\u043B\u044C\u043D\u043E \u0442\u044B\u043A\u0430\u043B \u043A\u043B\u0430\u0432\u0438\u0448\u0438 \u0441\u0432\u043E\u0435\u0433\u043E \u0442\u0435\u043B\u0435\u0444\u043E\u043D\u0430: 11-5, 3-1,6-2,9-8,2-9,10-7,4-9,8-4,5-4,1-8,7-8. (\u0430\u0433\u0435\u043D\u0442 \u0441\u043A\u0430\u0436\u0435\u0442, \u0447\u0442\u043E \u0434\u0435\u043B\u0430\u0442\u044C \u0434\u0430\u043B\u044C\u0448\u0435. \u0413\u043B\u0430\u0432\u043D\u043E\u0435 \u0431\u044B\u0442\u044C \u0432 \u043A\u043E\u0441\u0442\u044E\u043C\u0435 \u0434\u043B\u044F \u0425\u044D\u043B\u043B\u043E\u0443\u0438\u043D\u0430).
GAME_LEGEND=\u041A\u0430\u043D\u0443\u043D \u0432\u0441\u0435\u0445 \u0441\u0432\u044F\u0442\u044B\u0445\n\n\u0427\u0442\u043E \u0412\u044B \u0437\u043D\u0430\u0435\u0442\u0435 \u043E\u0431 \u044D\u0442\u043E\u043C \u0432\u0440\u0435\u043C\u0435\u043D\u0438, \u0432\u0440\u0435\u043C\u0435\u043D\u0438 \u041A\u0430\u043D\u0443\u043D\u0430 \u0432\u0441\u0435\u0445 \u0441\u0432\u044F\u0442\u044B\u0445? \u0412\u0440\u0435\u043C\u0435\u043D\u0438, \u043A\u043E\u0433\u0434\u0430 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u044F\u0442 \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0435 \u0438 \u043D\u0435\u043E\u0431\u044A\u044F\u0441\u043D\u0438\u043C\u044B\u0435 \u0432\u0435\u0449\u0438. \u0412\u0440\u0435\u043C\u0435\u043D\u0438 \u0412\u043E\u043B\u0448\u0435\u0431\u0441\u0442\u0432\u0430 \u0438 \u0441\u0443\u0435\u0432\u0435\u0440\u0438\u0439. \u0414\u0443\u043C\u0430\u0435\u0442\u0435, \u0447\u0442\u043E \u044D\u0442\u043E \u0432\u0441\u0435 \u0432\u044B\u0434\u0443\u043C\u043A\u0438? \u0410\u0433\u0430, \u043A\u0430\u043A \u0436\u0435\u2026\n\u0420\u0435\u0447\u044C \u043F\u043E\u0439\u0434\u0435\u0442 \u043E \u0434\u0432\u0443\u0445 \u043C\u0430\u043B\u044C\u0447\u0443\u0433\u0430\u043D\u0430\u0445, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0434\u0443\u043C\u0430\u043B\u0438 \u0442\u0430\u043A \u0436\u0435. \u0418 \u0432 \u044D\u0442\u043E\u0442 \u0432\u0435\u0447\u0435\u0440 \u0441\u043E\u0431\u0438\u0440\u0430\u043B\u0438\u0441\u044C \u043F\u0443\u0433\u0430\u0442\u044C \u0434\u0435\u0442\u0438\u0448\u0435\u043A \u043F\u043E \u043C\u043B\u0430\u0434\u0448\u0435, \u0441\u043E\u0431\u0438\u0440\u0430\u044F \u0441\u043B\u0430\u0434\u043E\u0441\u0442\u0438 \u0438 \u0432\u0435\u0441\u0435\u043B\u044F\u0441\u044C, \u043D\u043E\u2026. 
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041D\u043E\u0433\u0438\u0440\u0441\u043A\u0438\u0439 \u043F\u043E\u0432\u043E\u0440\u043E\u0442, \u0440\u0430\u0437\u0440\u0443\u0448\u0435\u043D\u043D\u043E\u0435 \u0437\u0434\u0430\u043D\u0438\u0435 \u0437\u0430 \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u043E\u0439.
TASK_CODE_6=ANG789
START_CODE=kd
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041B\u0435\u043E\u043D \u0431\u044B\u043B \u043D\u0430\u043F\u043E\u043B\u043E\u0432\u0438\u043D\u0443 \u043A\u0438\u0442\u0430\u0439\u0446\u0435\u043C. \u0418 \u044D\u0442\u0438 \u043A\u0438\u0442\u0430\u0439\u0441\u043A\u0438\u0435 \u043A\u043E\u0440\u043D\u0438 \u0434\u0435\u043B\u0430\u043B\u0438 \u0435\u0433\u043E \u043D\u0435\u0442\u043E\u0440\u043E\u043F\u043B\u0438\u0432\u044B\u043C \u0432 \u0441\u0432\u043E\u0438\u0445 \u0448\u0430\u0433\u0430\u0445 \u0438 \u043F\u043E\u0441\u0442\u0443\u043F\u043A\u0430\u0445. \u041E\u043D \u0432\u044B\u0440\u043E\u0441 \u0432 \u0441\u0442\u043E\u043B\u0438\u0446\u0435 \u0438 2 \u0434\u0432\u0430 \u0433\u043E\u0434\u0430 \u043D\u0430\u0437\u0430\u0434 \u043F\u0435\u0440\u0435\u0431\u0440\u0430\u043B\u0441\u044F \u0432 \u044D\u0442\u043E\u0442 \u0442\u0438\u0445\u0438\u0439 \u0438 \u0441\u043F\u043E\u043A\u043E\u0439\u043D\u044B\u0439 \u0433\u043E\u0440\u043E\u0434\u043E\u043A.
TASK_CODE_4=A7N7G7
TASK_CODE_3=AN35G1
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0442\u0440\u043E\u0439\u043A\u0430 \u043D\u0430 \u0432\u0435\u0441\u0435\u043D\u043D\u0435\u0439 \u043C\u0435\u0436\u0434\u0443 \u0410\u043D\u0435\u0447\u043A\u043E\u0439 \u0438 \u041C\u043E\u0446\u0430\u0440\u0435\u043B\u043B\u043E\u0439.
TASK_CODE_2=17AN7G
TASK_CODE_1=A6N97G
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u043E\u0434 \u043C\u043E\u0440\u0434\u043E\u0439 \u0437\u0432\u0435\u0440\u044F \u0431\u044B\u043B\u043E \u0432\u044B\u0431\u0438\u0442\u043E, \u0447\u0442\u043E \u0442\u043E \u043D\u0430 \u043D\u0435\u043F\u043E\u043D\u044F\u0442\u043D\u043E\u043C \u044F\u0437\u044B\u043A\u0435: Ecce enim Sic invenies,in fontem inter dulcia et italiae caseum. \u041C\u0430\u043B\u044C\u0447\u0438\u0448\u043A\u0438 \u043D\u0435 \u0437\u043D\u0430\u043B\u0438 \u0447\u0442\u043E \u0436\u0435 \u0442\u0430\u043C \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u043E, \u0438 \u0441 \u0431\u043E\u043B\u044C\u0448\u043E\u0439 \u043E\u043F\u0430\u0441\u043A\u043E\u0439 \u043F\u043E\u0441\u0442\u0443\u0447\u0430\u043B\u0438 \u0432 \u0434\u0432\u0435\u0440\u044C.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u043A\u0432\u0435\u0440 \u0413\u0430\u0433\u0430\u0440\u0438\u043D\u0430, \u0433\u0438\u043C\u043D\u0430\u0437\u0438\u044F \u211616.
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0414\u0436\u0435\u0440\u043E\u043C \u043D\u0430\u0441\u0447\u0438\u0442\u0430\u043B \u0440\u043E\u0432\u043D\u043E 16 \u0443\u0434\u0430\u0440\u043E\u0432 \u0441\u0435\u0440\u0434\u0446\u0430 \u0438 \u043A\u043E\u0433\u0434\u0430 \u043E\u043D \u0443\u0436\u0435 \u0433\u043E\u0442\u043E\u0432\u0438\u043B\u0441\u044F \u0434\u0430\u0442\u044C \u0441\u0442\u0440\u0435\u043A\u043E\u0447\u0430, \u043A\u0430\u043A \u0432 \u0448\u043A\u043E\u043B\u0435, \u0441\u0442\u0430\u0440\u0438\u043A \u0441\u0445\u0432\u0430\u0442\u0438\u043B \u0438\u0445 \u0437\u0430 \u0440\u0443\u043A\u0438 \u0438 \u043F\u043E\u0442\u0430\u0449\u0438\u043B \u0432\u043D\u0443\u0442\u0440\u044C \u0434\u043E\u043C\u0430. \u0421\u043A\u0440\u0438\u043F \u043F\u043E\u043B\u043E\u0432\u0438\u0446 \u043F\u043E\u0445\u043E\u0434\u0438\u043B \u043D\u0430 \u0441\u0442\u043E\u043D, \u0430 \u043E\u043D \u0442\u0430\u0449\u0438\u043B \u043C\u0430\u043B\u044C\u0447\u0438\u0448\u0435\u043A \u0432\u0441\u0435 \u0434\u0430\u043B\u044C\u0448\u0435. \u041A\u0430\u043A \u0432 \u0444\u0438\u043B\u044C\u043C\u0430\u0445 \u0443\u0436\u0430\u0441\u043E\u0432, \u0442\u0430\u0449\u0438\u0442 \u0432 \u0441\u0432\u043E\u0435 \u043B\u043E\u0433\u043E\u0432\u043E \u0436\u0435\u0440\u0442\u0432 \u043A\u0430\u043A\u043E\u0439-\u043D\u0438\u0431\u0443\u0434\u044C \u0440\u0430\u0434\u0438\u043E\u0430\u043A\u0442\u0438\u0432\u043D\u044B\u0439 \u043C\u0443\u0442\u0430\u043D\u0442. \u0412\u043E\u0442 \u0442\u043E\u043B\u044C\u043A\u043E \u043B\u0438\u043A\u0432\u0438\u0434\u0430\u0442\u043E\u0440\u043E\u0432 \u043F\u043E\u0431\u043B\u0438\u0437\u043E\u0441\u0442\u0438 \u043D\u0435 \u0431\u044B\u043B\u043E.
START_TIME=22-00
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0412\u0442\u043E\u0440\u0430\u044F \u0446\u0438\u0444\u0440\u0430 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043D\u043E\u043C\u0435\u0440\u0443 \u0442\u0435\u043B\u0435\u0444\u043E\u043D\u0430, \u043F\u0435\u0440\u0432\u0430\u044F \u043F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u044C.\n1-8, 2-9, 3-1\u2026
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0414\u0436\u0435\u0440\u043E\u043C \u043D\u0430\u0441\u0442\u043E\u043B\u044C\u043A\u043E \u0445\u043E\u0440\u043E\u0448\u043E \u0437\u043D\u0430\u043B \u043D\u043E\u043C\u0435\u0440 \u0442\u0435\u043B\u0435\u0444\u043E\u043D\u0430, \u0447\u0442\u043E \u0434\u0430\u0436\u0435 \u043C\u043E\u0433 \u0441\u043A\u0430\u0437\u0430\u0442\u044C \u043A\u0430\u043A\u0430\u044F \u0446\u0438\u0444\u0440\u0430 \u043D\u043E\u043C\u0435\u0440\u0430 \u043A\u0430\u043A\u043E\u0439 \u0438\u0434\u0435\u0442 \u043F\u043E \u0441\u0447\u0435\u0442\u0443. (\u041A\u043E\u0441\u0442\u044E\u043C \u0434\u043B\u044F \u0425\u044D\u043B\u043B\u043E\u0443\u0438\u043D\u0430 \u043E\u0431\u044F\u0437\u0430\u0442\u0435\u043B\u0435\u043D)
TASK_CODE_5=A8N1G5
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0442\u0440\u043E\u0439\u043A\u0430 \u043F\u043E \u0414\u043E\u0432\u0430\u0442\u043E\u0440\u0430 \u0432 \u0441/\u0442 \u0418\u0440\u0438\u0441\u0442\u043E\u043D, \u0443\u043B\u0438\u0446\u0430 \u0414\u043E\u043A\u0442\u043E\u0440\u0441\u043A\u0430\u044F.
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0414\u043E\u043C, \u043A \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443, \u043F\u0440\u0438\u0431\u043B\u0438\u0436\u0430\u043B\u0438\u0441\u044C \u043C\u0430\u043B\u044C\u0447\u0438\u0448\u043A\u0438, \u0438\u043C\u0435\u043B \u0434\u0443\u0440\u043D\u0443\u044E \u0441\u043B\u0430\u0432\u0443. \u0425\u043E\u0434\u0438\u043B\u0438 \u0441\u043B\u0443\u0445\u0438 \u043E \u043F\u0440\u0438\u0437\u0440\u0430\u043A\u0430\u0445, \u0436\u0438\u0432\u0443\u0449\u0438\u0445 \u0437\u0434\u0435\u0441\u044C. \u0412 \u0434\u043E\u043C\u0435 \u0436\u0438\u043B \u0441\u0442\u0430\u0440\u0438\u043A\u0430\u043D, \u0447\u0435\u0439 \u0441\u0430\u0434 \u043F\u0443\u0433\u0430\u043B \u0432\u0441\u0435\u0445 \u0432\u043E\u043A\u0440\u0443\u0433, \u043D\u0435 \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u043A\u0430\u043D\u0443\u043D \u0425\u044D\u043B\u043B\u043E\u0443\u0438\u043D\u0430. \u0422\u043E\u0432\u0430\u0440\u0438\u0449\u0438 \u043C\u0435\u0434\u043B\u0435\u043D\u043D\u043E \u0438 \u043D\u0435 \u0440\u0435\u0448\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u043F\u043E\u0434\u0445\u043E\u0434\u0438\u043B\u0438 \u043A \u0434\u043E\u043C\u0443, \u0434\u043E\u043A\u0442\u043E\u0440\u0441\u043A\u0430\u044F \u043C\u0430\u0441\u043A\u0430 \u0441\u044A\u0435\u0445\u0430\u043B\u0430. \u0421\u0437\u0430\u0434\u0438 \u043D\u0430 \u0434\u043E\u0440\u043E\u0433\u0435 \u043D\u0435\u0441\u043B\u0438\u0441\u044C \u0430\u0432\u0442\u043E\u043C\u043E\u0431\u0438\u043B\u0438, \u0438 \u0445\u043E\u0442\u044F \u043E\u043D\u0430 \u0431\u044B\u043B\u0430 \u043D\u0435 \u0441\u0442\u043E\u043B\u0438\u0447\u043D\u043E\u0439, \u0434\u0432\u0438\u0436\u0435\u043D\u0438\u0435 \u043D\u0430 \u043D\u0435\u0439 \u0431\u044B\u043B\u043E \u043E\u0433\u043E-\u0433\u043E.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u043C\u043E\u0442\u0440\u043E\u0432\u0430\u044F \u043D\u0430 \u041B\u044B\u0441\u043E\u0439 \u0433\u043E\u0440\u0435.
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041E\u0441\u043C\u043E\u0442\u0440\u0435\u0432 \u0441 \u0432\u044B\u0441\u043E\u0442\u044B \u043C\u0430\u043B\u044C\u0447\u0443\u0433\u0430\u043D\u043E\u0432, \u0441\u0442\u0430\u0440\u0438\u043A \u0441\u0443\u0445\u0438\u043C \u0438 \u043A\u0430\u0448\u043B\u044F\u044E\u0449\u0438\u043C \u0433\u043E\u043B\u043E\u0441\u043E\u043C \u0441\u043F\u0440\u043E\u0441\u0438\u043B:\n-\u0427\u0435\u0433\u043E \u043F\u0440\u0438\u043F\u0435\u0440\u043B\u0438\u0441\u044C \u043C\u0435\u043B\u044E\u0437\u0433\u0430??? \u0410? \u0423 \u043D\u0430\u0441 \u043D\u0430 \u0445\u0443\u0442\u043E\u0440\u0435 \u0432\u0430\u0441 \u0431\u044B \u0431\u044B\u0441\u0442\u0440\u043E \u0432\u044B\u043F\u043E\u0440\u043E\u043B\u0438 \u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u043B\u0438 \u0432 \u0433\u043E\u0440\u0443 \u0441\u043E\u0431\u0438\u0440\u0430\u0442\u044C \u0445\u0432\u043E\u0440\u043E\u0441\u0442!!!!
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n\u041C\u0430\u043B\u044C\u0447\u0438\u0448\u043A\u0438 \u0445\u043E\u0442\u0435\u043B\u0438 \u0431\u0440\u043E\u0441\u0438\u0442\u044C\u0441\u044F \u043D\u0430\u0443\u0442\u0435\u043A, \u043A\u0430\u043A \u043E\u0431\u044B\u0447\u043D\u043E \u0434\u0435\u043B\u0430\u043B\u0438 \u0432 \u0433\u0438\u043C\u043D\u0430\u0437\u0438\u0438, \u043A\u043E\u0433\u0434\u0430 \u0443\u0447\u0438\u043B\u043A\u0430 \u043B\u043E\u0432\u0438\u043B\u0430 \u0438\u0445 \u043D\u0430 \u0445\u0443\u043B\u0438\u0433\u0430\u043D\u0441\u0442\u0432\u0435. \u041D\u043E \u0432 \u044D\u0442\u043E\u0442 \u043C\u043E\u043C\u0435\u043D\u0442, \u043D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E \u043B\u0443\u0436\u0430\u0439\u043A\u0430 \u043F\u0435\u0440\u0435\u0434 \u0434\u043E\u043C\u043E\u043C \u043D\u0430\u0447\u0430\u043B\u0430 \u043C\u0435\u043D\u044F\u0442\u044C\u0441\u044F, \u0444\u043E\u043D\u0430\u0440\u044C \u0437\u0430\u043C\u043E\u0440\u0433\u0430\u043B \u043A\u0430\u043A\u0438\u043C-\u0442\u043E \u043D\u0435\u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u043C, \u0440\u0430\u0434\u0438\u043E\u0430\u043A\u0442\u0438\u0432\u043D\u044B\u043C \u0441\u0432\u0435\u0442\u043E\u043C \u0438 \u043F\u043E\u0433\u0430\u0441. \u041A\u043E\u0433\u0434\u0430 \u043E\u043D \u0432\u043D\u043E\u0432\u044C \u0437\u0430\u0441\u0432\u0435\u0442\u0438\u043B, \u0432\u043C\u0435\u0441\u0442\u043E \u043B\u0443\u0436\u0430\u0439\u043A\u0438, \u043A \u0414\u0436\u0435\u0440\u043E\u043C\u0443 \u0438 \u041B\u0435\u043E\u043D\u0443, \u0442\u044F\u043D\u0443\u043B \u0441\u0432\u043E\u0438 \u043B\u0430\u043F\u0438\u0449\u0430-\u0432\u0435\u0442\u043A\u0438 \u0437\u043B\u043E\u0432\u0435\u0449\u0438\u0439 \u0441\u043A\u0432\u0435\u0440\u0438\u043A.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+
START_DATE=28-10-2017
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u0414\u0432\u0435\u0440\u044C \u0440\u0430\u0441\u043F\u0430\u0445\u043D\u0443\u043B\u0430\u0441\u044C \u0438 \u043F\u043E\u0432\u0435\u044F\u043B\u043E \u0441\u0442\u0430\u0440\u044B\u043C \u043B\u0435\u0441\u043E\u043C \u0438 \u0442\u043B\u0435\u043D\u043E\u043C, \u043D\u0430 \u043F\u043E\u0440\u043E\u0433\u0435 \u043F\u043E\u044F\u0432\u0438\u043B\u0441\u044F \u0441\u0442\u0430\u0440\u0438\u043A, \u0435\u0433\u043E \u043B\u0438\u0446\u043E \u0431\u044B\u043B\u043E \u0438\u0437\u044A\u0435\u0434\u0435\u043D\u043E \u043C\u043E\u0440\u0449\u0438\u043D\u0430\u043C\u0438. \u041C\u0430\u043A\u0443\u0448\u043A\u0430 \u0431\u044B\u043B\u0430 \u043B\u044B\u0441\u043E\u0439 \u0438 \u043B\u0438\u0448\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0432\u043E\u043B\u043E\u0441\u0438\u043D\u043E\u043A, \u043D\u0430 \u043D\u0435\u0439 \u043D\u0430\u043F\u043E\u043C\u0438\u043D\u0430\u043B\u043E \u043E \u0431\u044B\u043B\u043E\u043C \u0432\u0435\u043B\u0438\u0447\u0438\u0438 \u0435\u0433\u043E \u0448\u0435\u0432\u0435\u043B\u044E\u0440\u044B.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n\u041D\u0435\u0434\u0430\u043B\u0435\u043A\u043E \u043E\u0442 \u0432\u0445\u043E\u0434\u0430 \u0440\u043E\u0441\u043B\u0438 \u0438\u0432\u0443\u0448\u043A\u0438. \u0412\u0435\u0441\u0435\u043D\u043D\u0438\u043C \u043C\u0435\u0441\u044F\u0446\u0435\u043C, \u043E\u043D\u0438 \u043A\u0440\u0430\u0441\u0438\u0432\u043E \u0440\u0430\u0441\u0446\u0432\u0435\u0442\u0430\u043B\u0438, \u0441\u0435\u0439\u0447\u0430\u0441 \u0436\u0435 \u0435\u0435 \u0432\u0435\u0442\u0432\u0438 \u0432 \u0441\u0432\u0435\u0442\u0435 \u0444\u043E\u043D\u0430\u0440\u0435\u0439 \u043E\u0442\u0431\u0440\u0430\u0441\u044B\u0432\u0430\u043B\u0438 \u043F\u0440\u0438\u0447\u0443\u0434\u043B\u0438\u0432\u044B\u0435 \u0442\u0435\u043D\u0438 \u0438 \u043F\u0443\u0433\u0430\u043B\u0438 \u0440\u0435\u0431\u044F\u0442. \u041D\u0430 \u0434\u0432\u0435\u0440\u0438 \u0432\u0438\u0441\u0435\u043B\u0430 \u043F\u0440\u0438\u0447\u0443\u0434\u043B\u0438\u0432\u0430\u044F \u0441\u0442\u0443\u043A\u0430\u043B\u043A\u0430 \u0432 \u0444\u043E\u0440\u043C\u0435 \u0442\u043E\u043B\u0438 \u0432\u043E\u043B\u043A\u0430, \u0442\u043E\u043B\u0438 \u0441\u043E\u0431\u0430\u043A\u0438.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n\u041D\u0430 \u041B\u0435\u043E\u043D\u0435 \u0431\u044B\u043B \u0441\u0442\u0440\u0430\u0448\u043D\u044B\u0439 \u0433\u0440\u0438\u043C\u043C - \u0434\u043E\u043A\u0442\u043E\u0440\u0441\u043A\u0430\u044F \u043C\u0430\u0441\u043A\u0430 \u0441\u0430\u0434\u043E\u0432\u043E\u0434\u0430-\u0443\u0431\u0438\u0439\u0446\u044B. \u041E\u043D \u0431\u044B\u043B \u043D\u0430\u0441\u0442\u043E\u043B\u044C\u043A\u043E \u043F\u0443\u0433\u0430\u044E\u0449, \u0447\u0442\u043E \u043F\u0435\u0440\u0432\u044B\u0439 \u0436\u0435 \u0432\u0441\u0442\u0440\u0435\u0447\u043D\u044B\u0439 \u043E\u0442\u0441\u043A\u043E\u0447\u0438\u043B \u0432 \u0443\u0436\u0430\u0441\u0435. \u0410 \u043C\u0430\u043B\u044C\u0447\u0438\u0448\u043A\u0438 \u0440\u0430\u0441\u0441\u043C\u0435\u044F\u0432\u0448\u0438\u0441\u044C, \u0440\u0438\u043D\u0443\u043B\u0438\u0441\u044C \u043A \u0431\u043B\u0438\u0436\u0430\u0439\u0448\u0435\u043C\u0443 \u0434\u043E\u043C\u0443. \u0412\u043F\u0435\u0440\u0435\u0434\u0438 \u0431\u044B\u043B \u0434\u043E\u043B\u0433\u0438\u0439 \u0432\u0435\u0447\u0435\u0440, \u0438 \u0441\u043B\u0430\u0434\u043E\u0441\u0442\u0435\u0439 \u0434\u043E\u043B\u0436\u043D\u0430 \u043D\u0430\u0431\u0440\u0430\u0442\u044C\u0441\u044F \u043A\u0443\u0447\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u0414\u043B\u044F \u0414\u0436\u0435\u0440\u043E\u043C\u0430 \u0431\u044B\u043B\u043E \u0441\u0435\u043A\u0440\u0435\u0442\u043E\u043C, \u0432\u043E \u0447\u0442\u043E \u043E\u0434\u0435\u043D\u0435\u0442\u0441\u044F \u0435\u0433\u043E \u043B\u0443\u0447\u0448\u0438\u0439 \u0434\u0440\u0443\u0433. \u041F\u043E\u044D\u0442\u043E\u043C\u0443, \u0441\u043F\u0443\u0441\u0442\u044F \u043A\u0430\u043A\u0438\u0445-\u0442\u043E 2 \u043C\u0438\u043D\u0443\u0442\u044B \u043F\u043E \u0441\u0442\u043E\u043B\u0438\u0447\u043D\u043E\u043C\u0443 \u0432\u0440\u0435\u043C\u0435\u043D\u0438, \u043E\u043D \u0441\u0442\u043E\u044F\u043B \u0443 \u0434\u0432\u0435\u0440\u0438 \u0441\u0432\u043E\u0435\u0433\u043E \u043F\u0440\u0438\u044F\u0442\u0435\u043B\u044F. \u041B\u0435\u043E\u043D \u043E\u043F\u044F\u0442\u044C \u043E\u043F\u0430\u0437\u0434\u044B\u0432\u0430\u043B. \u0410 \u0432\u0435\u0434\u044C \u0414\u0436\u0435\u0440\u043E\u043C \u043B\u0438\u0448\u044C \u0447\u0443\u0434\u043E\u043C \u043F\u0440\u043E\u0441\u043A\u043E\u0447\u0438\u043B \u0443\u0433\u043E\u043B, \u0433\u0434\u0435 \u0432\u0441\u0435\u043C \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u0435 \u0445\u0443\u043B\u0438\u0433\u0430\u043D\u044B \u0442\u0432\u043E\u0440\u0438\u043B\u0438 \u0431\u0435\u0437\u043E\u0431\u0440\u0430\u0437\u0438\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\u041F\u0440\u043E\u0442\u0430\u0449\u0438\u0432 \u043C\u0430\u043B\u044C\u0447\u0438\u0448\u0435\u043A \u0447\u0435\u0440\u0435\u0437 \u0432\u0435\u0441\u044C \u0434\u043E\u043C, \u043E\u043D \u043A\u0438\u043D\u0443\u043B \u0438\u0445 \u0432 \u043A\u043E\u043C\u043D\u0430\u0442\u0443. \u0412 \u043D\u0435\u0439 \u0441\u0442\u043E\u044F\u043B\u0430 \u041C\u0435\u0440\u0442\u0432\u0430\u044F \u0442\u0438\u0448\u0438\u043D\u0430. \u0412 \u0446\u0435\u043D\u0442\u0440\u0435 \u0431\u044B\u043B\u0430 \u0440\u0430\u0437\u043B\u043E\u0436\u0435\u043D\u0430 \u043E\u0433\u0440\u043E\u043C\u043D\u0430\u044F \u0442\u044B\u043A\u0432\u0430 \u0441 \u0432\u044B\u0440\u0435\u0437\u0430\u043D\u043D\u044B\u043C \u043D\u0430 \u043D\u0435\u0439 \u043B\u0438\u0446\u043E\u043C. \u0412\u043E\u043A\u0440\u0443\u0433 \u043D\u0435\u0435 \u0441\u0442\u043E\u044F\u043B\u0430 \u043C\u043D\u043E\u0436\u0435\u0441\u0442\u0432\u043E \u0441\u0432\u0435\u0447\u0435\u043A. \u0417\u0430\u043F\u0435\u0440\u0435\u0432 \u0437\u0430 \u0441\u043E\u0431\u043E\u0439 \u0434\u0432\u0435\u0440\u044C, \u0441\u0442\u0430\u0440\u0438\u043A \u043A\u0430\u043A \u043F\u043E\u043F, \u043D\u0430\u0447\u0430\u043B \u043D\u0430\u0448\u0435\u043F\u0442\u044B\u0432\u0430\u0442\u044C : \u00AB \u0411\u0435\u0433\u0438 \u043E\u0442 \u0434\u0432\u0435\u0440\u0438 \u0412\u0435\u0434\u044C\u043C\u044B \u041C\u044D\u0440\u0438, \u0411\u0435\u0433\u0438 \u043E\u0442 \u0434\u0432\u0435\u0440\u0438 \u043F\u043E\u0441\u043A\u043E\u0440\u0435\u0439\u00BB. \u041F\u043E \u0432\u0441\u0435\u043C \u0441\u0442\u0435\u043D\u0430\u043C \u0442\u044F\u043D\u0443\u043B\u0430\u0441\u044C \u0434\u043B\u0438\u043D\u043D\u0430\u044F \u043D\u0430\u0434\u043F\u0438\u0441\u044C: 8-1,16-2,13-3,21-8,28-4,35-1,17-1,9-1,14-3,11-5,21-9.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u043E \u043F\u0440\u0435\u0436\u043D\u0435\u043C\u0443 \u0441\u0442\u043E\u044F\u043B\u0430 \u043C\u0435\u0440\u0442\u0432\u0430\u044F \u0442\u0438\u0448\u0438\u043D\u0430, \u0430 \u0441\u0442\u0430\u0440\u0438\u0447\u043E\u043A \u0434\u043E\u0441\u0442\u0430\u0432 \u043E\u0433\u0440\u043E\u043C\u043D\u044B\u0439 \u043D\u043E\u0436 \u043D\u0430\u043F\u0435\u0432\u0430\u043B \u0441\u0442\u0438\u0448\u043E\u043A \u043F\u0440\u043E \u0412\u0435\u0434\u044C\u043C\u0443 \u041C\u044D\u0440\u0438 \u0438\u0437 \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E\u0433\u043E \u0444\u0438\u043B\u044C\u043C\u0430.  \u0412\u043E\u0441\u044C\u043C\u043E\u0435 \u0441\u043B\u043E\u0432\u043E \u0432 \u0441\u0442\u0438\u0448\u043A\u0435 \u0431\u044B\u043B\u043E \u0434\u0432\u0435\u0440\u0438, \u0438 \u0441\u0442\u0430\u0440\u0438\u0447\u043E\u043A \u0434\u0435\u043B\u0430\u043B \u0430\u043A\u0446\u0435\u043D\u0442 \u043D\u0430 \u043F\u0435\u0440\u0432\u043E\u0439 \u0431\u0443\u043A\u0432\u0435, \u0430 \u043D\u0430 \u0448\u0435\u0441\u0442\u043D\u0430\u0434\u0446\u0430\u0442\u043E\u043C \u0441\u043B\u043E\u0432\u0435 \u0434\u043E\u0447\u0435\u0440\u0435\u0439 \u0430\u043A\u0446\u0435\u043D\u0442 \u0434\u0435\u043B\u0430\u043B\u0441\u044F \u043D\u0430 \u043E.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0442\u0438\u0445 \u0438\u0437 \u0444\u0438\u043B\u044C\u043C\u0430 \u041C\u0435\u0440\u0442\u0432\u0430\u044F \u0442\u0438\u0448\u0438\u043D\u0430 \u043F\u0440\u043E \u0432\u0435\u0434\u044C\u043C\u0443 \u041C\u044D\u0440\u0438. 8 \u0441\u043B\u043E\u0432\u043E \u2013 1 \u0431\u0443\u043A\u0432\u0430, 16 \u0441\u043B\u043E\u0432\u043E-2 \u0431\u0443\u043A\u0432\u0430, 13 \u0441\u043B\u043E\u0432\u043E -3 \u0431\u0443\u043A\u0432\u0430 \u0438 \u0442.\u0434.
TASK_CODE_7=A3N4G5
BONUS_FIVE_MINUTES=HLW1
BONUS_TEN_MINUTES=KVS5
BONUS_FIFTEEN_MINUTES=SGS7