#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="Silent Hill"\n\n\u0422\u0440\u0438 \u0433\u043E\u0434\u0430 \u043D\u0430\u0437\u0430\u0434 \u0414\u0436\u0435\u0439\u043C\u0441 \u043F\u043E\u0442\u0435\u0440\u044F\u043B \u0441\u0432\u043E\u044E \u0436\u0435\u043D\u0443 \u041C\u044D\u0440\u0438, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0443\u043C\u0435\u0440\u043B\u0430 \u0432 \u0433\u043E\u0441\u043F\u0438\u0442\u0430\u043B\u0435 \u043E\u0442 \u043D\u0435\u0438\u0437\u043B\u0435\u0447\u0438\u043C\u043E\u0439 \u0431\u043E\u043B\u0435\u0437\u043D\u0438. \u0414\u0436\u0435\u0439\u043C\u0441 \u043E\u0447\u0435\u043D\u044C \u0441\u0438\u043B\u044C\u043D\u043E \u043F\u0435\u0440\u0435\u0436\u0438\u0432\u0430\u043B \u044D\u0442\u0443 \u043F\u043E\u0442\u0435\u0440\u044E. \u0418 \u0432\u0434\u0440\u0443\u0433 \u043E\u043D \u043F\u043E\u043B\u0443\u0447\u0430\u0435\u0442 \u043F\u0438\u0441\u044C\u043C\u043E \u043E\u0442 \u0441\u0432\u043E\u0435\u0439 \u0436\u0435\u043D\u044B, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u041C\u044D\u0440\u0438 \u043F\u0440\u043E\u0441\u0438\u0442 \u0414\u0436\u0435\u0439\u043C\u0441\u0430 22 \u0438\u044E\u043D\u044F \u0432 22:00 \u043F\u0440\u0438\u0435\u0445\u0430\u0442\u044C \u0432 \u0433\u043E\u0440\u043E\u0434\u043E\u043A \u0421\u0430\u0439\u043B\u0435\u043D\u0442 \u0425\u0438\u043B\u043B, \u043D\u0430 \u0438\u0445 \u00AB\u0437\u0430\u0432\u0435\u0442\u043D\u043E\u0435 \u043C\u0435\u0441\u0442\u043E\u00BB, \u0433\u0434\u0435 \u043E\u043D\u0438 \u0432\u043C\u0435\u0441\u0442\u0435 \u043F\u0440\u043E\u0432\u0435\u043B\u0438 \u043D\u0435\u043C\u0430\u043B\u043E \u0441\u0447\u0430\u0441\u0442\u043B\u0438\u0432\u044B\u0445 \u0434\u043D\u0435\u0439. \u041A\u0430\u043A \u0436\u0435 \u0442\u0430\u043A\u043E\u0435 \u043C\u043E\u0433\u043B\u043E \u0441\u043B\u0443\u0447\u0438\u0442\u044C\u0441\u044F? \u0412\u0435\u0434\u044C \u043C\u0435\u0440\u0442\u0432\u044B\u0435 \u043D\u0435 \u043F\u0438\u0448\u0443\u0442 \u043F\u0438\u0441\u0435\u043C... \u041A\u043E\u043D\u0435\u0447\u043D\u043E \u0436\u0435, \u0414\u0436\u0435\u0439\u043C\u0441, \u043D\u0430\u0434\u0435\u044F\u0441\u044C \u043D\u0430 \u0447\u0443\u0434\u043E, \u0443\u0441\u0442\u0440\u0435\u043C\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0430 \u0432\u0441\u0442\u0440\u0435\u0447\u0443 \u0441\u043E \u0441\u0432\u043E\u0435\u0439 \u0432\u043E\u0437\u043B\u044E\u0431\u043B\u0435\u043D\u043D\u043E\u0439. \u041D\u043E \u043A\u0430\u043A \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u043D \u043F\u0440\u0438\u0431\u044B\u0432\u0430\u0435\u0442 \u0432 \u0421\u0430\u0439\u043B\u0435\u043D\u0442 \u0425\u0438\u043B\u043B, \u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u0441\u044F \u044F\u0441\u043D\u043E, \u0447\u0442\u043E \u0434\u043E \u043C\u0435\u0447\u0442\u044B \u0442\u0430\u043A \u043F\u0440\u043E\u0441\u0442\u043E \u043D\u0435 \u0434\u043E\u0431\u0440\u0430\u0442\u044C\u0441\u044F. \u0421\u043D\u0430\u0447\u0430\u043B\u0430 \u0414\u0436\u0435\u0439\u043C\u0441 \u0434\u043E\u043B\u0436\u0435\u043D \u043F\u0440\u043E\u0439\u0442\u0438 \u0432\u0441\u0435 \u0441\u0435\u043C\u044C \u043A\u0440\u0443\u0433\u043E\u0432 \u0430\u0434\u0430.
START_CODE=sh
START_DATE=22-06-2018
START_TIME=22-00
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0414\u0436\u0435\u0439\u043C\u0441 \u0432\u044B\u0445\u043E\u0434\u0438\u0442 \u0438\u0437 \u043C\u0430\u0448\u0438\u043D\u044B, \u043E\u043D \u0432\u0438\u0434\u0438\u0442 \u0434\u043E\u0440\u043E\u0433\u0443, \u0437\u0430 \u043D\u0435\u0439 \u0432\u0438\u0434\u043D\u0435\u0435\u0442\u0441\u044F \u043A\u043B\u0430\u0434\u0431\u0438\u0449\u0435. \u0412 \u0433\u043E\u043B\u043E\u0432\u0435 \u0433\u043E\u043B\u043E\u0441 \u041C\u044D\u0440\u0438 \u0433\u043E\u0432\u043E\u0440\u0438\u0442 \u0435\u043C\u0443: \u00AB\u0412 \u043C\u043E\u0438\u0445 \u0431\u0435\u0441\u043F\u043E\u043A\u043E\u0439\u043D\u044B\u0445 \u0441\u043D\u0430\u0445 \u044F \u0432\u0441\u0451 \u0447\u0430\u0449\u0435 \u0432\u0438\u0436\u0443 \u044D\u0442\u043E\u0442 \u0433\u043E\u0440\u043E\u0434. \u0421\u0430\u0439\u043B\u0435\u043D\u0442 \u0425\u0438\u043B\u043B. \u0422\u044B \u043E\u0431\u0435\u0449\u0430\u043B \u043C\u043D\u0435, \u0447\u0442\u043E \u0441\u043D\u043E\u0432\u0430 \u0432\u043E\u0437\u044C\u043C\u0451\u0448\u044C \u043C\u0435\u043D\u044F \u0441\u044E\u0434\u0430, \u043D\u043E\u2026 \u0442\u044B \u0442\u0430\u043A \u0438 \u043D\u0435 \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u043B \u0441\u0432\u043E\u0435\u0433\u043E \u043E\u0431\u0435\u0449\u0430\u043D\u0438\u044F. \u0427\u0442\u043E \u0436, \u0442\u0435\u043F\u0435\u0440\u044C \u044F \u0437\u0434\u0435\u0441\u044C \u043E\u0434\u043D\u0430\u2026 \u0412 \u043D\u0430\u0448\u0435\u043C \u00AB\u0437\u0430\u0432\u0435\u0442\u043D\u043E\u043C \u043C\u0435\u0441\u0442\u0435\u00BB \u2026 \u0416\u0434\u0443 \u0442\u0435\u0431\u044F\u2026\u00BB\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3,2
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0417\u0434\u0435\u0441\u044C \u043D\u0435\u0442 \u0430\u0441\u0444\u0430\u043B\u044C\u0442\u0430, \u0442\u043E\u043B\u044C\u043A\u043E \u0413\u043B\u0438\u043D\u0430 \u043F\u043E\u0434 \u043D\u043E\u0433\u0430\u043C\u0438. \u0421\u0442\u0430\u0440\u0438\u043D\u043D\u044B\u0435 \u0437\u0430\u0445\u043E\u0440\u043E\u043D\u0435\u043D\u0438\u044F \u0438 \u043A\u0430\u043A\u043E\u0435-\u0442\u043E \u0441\u0442\u0440\u043E\u0435\u043D\u0438\u0435 \u0432\u043F\u0435\u0440\u0435\u0434\u0438 \u0441\u0440\u0435\u0434\u0438 \u043C\u043E\u0433\u0438\u043B. \u0413\u043E\u043B\u043E\u0441 \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0430\u0435\u0442: \u00AB\u0411\u0435\u0437 \u0436\u0438\u0437\u043D\u0438 \u0436\u0438\u0437\u043D\u044C \u043D\u0435 \u043D\u0443\u0436\u043D\u0430\u2026\u00BB \u00AB\u0413\u043E\u0441\u043F\u0438\u0442\u0430\u043B\u044C \u043C\u0435\u0440\u0442\u0432\u044B\u043C \u0443\u0436\u0435 \u043D\u0435 \u043F\u043E\u043C\u043E\u0436\u0435\u0442\u2026\u00BB.
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B. \u0413\u043B\u0438\u043D\u043A\u0438, \u0413\u043E\u0441\u043F\u0438\u0442\u0430\u043B\u044C\u043D\u043E\u0435 \u043A\u043B\u0430\u0434\u0431\u0438\u0449\u0435, \u0441\u043A\u043B\u0435\u043F 43.052223, 44.681549
TASK_CODE_1=F4L9N8
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u041F\u0440\u043E\u0445\u043E\u0434\u044F \u0447\u0435\u0440\u0435\u0437 \u043A\u043B\u0430\u0434\u0431\u0438\u0449\u0435 \u0414\u0436\u0435\u0439\u043C\u0441 \u0432\u0438\u0434\u0438\u0442 \u043E\u043A\u043E\u043B\u043E \u043E\u0434\u043D\u043E\u0439 \u0438\u0437 \u043C\u043E\u0433\u0438\u043B \u0434\u0435\u0432\u0443\u0448\u043A\u0443 \u043F\u043E \u0438\u043C\u0435\u043D\u0438 \u0410\u043D\u0434\u0436\u0435\u043B\u0430. \u041E\u043D\u0430 \u043F\u0440\u0438\u0448\u043B\u0430 \u0432 \u0421\u0430\u0439\u043B\u0435\u043D\u0442 \u0425\u0438\u043B\u043B \u0432 \u043F\u043E\u0438\u0441\u043A\u0430\u0445 \u043C\u0430\u0442\u0435\u0440\u0438. \u041D\u0430 \u043D\u0430\u0434\u0433\u0440\u043E\u0431\u0438\u0438 \u043D\u0435\u0442 \u043D\u0438 \u0438\u043C\u0435\u043D\u0438, \u043D\u0438 \u0434\u0430\u0442\u044B, \u0442\u043E\u043B\u044C\u043A\u043E \u043D\u0430\u0434\u043F\u0438\u0441\u044C: \u00AB\u0414\u0430 \u043F\u043E\u043C\u043E\u0436\u0435\u0442 \u0432\u0430\u043C \u041D\u0438\u043C\u0431 \u0421\u043E\u043B\u043D\u0446\u0430\u00BB \u0438 \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0439 \u0441\u0438\u043C\u0432\u043E\u043B \u0441 \u0440\u0443\u043D\u0430\u043C\u0438.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0410\u043D\u0434\u0436\u0435\u043B\u0430 \u0440\u0430\u0441\u0441\u043A\u0430\u0437\u0430\u043B\u0430, \u0447\u0442\u043E \u043F\u0435\u0440\u0435\u0435\u0445\u0430\u043B\u0430 \u0441\u044E\u0434\u0430 \u0438\u0437 \u0412\u0435\u043D\u0433\u0440\u0438\u0438, \u043A\u043E\u0433\u0434\u0430 \u0431\u044B\u043B\u0430 \u0435\u0449\u0435 \u0440\u0435\u0431\u0435\u043D\u043A\u043E\u043C. \u0421 \u0442\u0435\u0445 \u043F\u043E\u0440 \u0435\u0439 \u0441\u043D\u0438\u0442\u0441\u044F \u043E\u0434\u0438\u043D \u0438 \u0442\u043E\u0442 \u0436\u0435 \u043A\u043E\u0448\u043C\u0430\u0440, \u0433\u0434\u0435 \u043E\u043D\u0430 \u043E\u0434\u043D\u0430 \u0431\u0435\u0436\u0438\u0442 \u0432 \u043F\u043E\u043B\u0435, \u0430 \u043F\u043E\u0442\u043E\u043C \u0441\u0442\u0440\u0435\u043B\u044F\u0435\u0442 \u0432 \u043F\u0438\u0440\u0430\u043C\u0438\u0434\u043E\u0433\u043E\u043B\u043E\u0432\u043E\u0433\u043E \u043C\u043E\u043D\u0441\u0442\u0440\u0430 \u0438\u0437 \u043F\u0438\u0441\u0442\u043E\u043B\u0435\u0442\u0430, \u043D\u043E \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0435\u0433\u043E \u0443\u0431\u0438\u0442\u044C.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0412\u0435\u043D\u0433\u0435\u0440\u0441\u043A\u0438\u0435 \u0440\u0443\u043D\u044B (\u043A\u043B\u044E\u0447) (\u0423\u0433\u043E\u043B \u0446\u043E\u043A\u043E\u043B \u0445\u0430\u0434\u0430\u0440 \u043F\u043E\u043B\u0435)
TASK_CODE_2=f9l6n1
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n\u0414\u0436\u0435\u0439\u043C\u0441 \u0443\u0436\u0435 \u043F\u043E\u0447\u0442\u0438 \u0434\u043E\u0431\u0440\u0430\u043B\u0441\u044F \u043A \u00AB\u0437\u0430\u0432\u0435\u0442\u043D\u043E\u043C\u0443 \u043C\u0435\u0441\u0442\u0443\u00BB, \u043D\u043E \u0432\u0434\u0440\u0443\u0433 \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u0435\u0432\u043E\u0447\u043A\u0430, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0431\u0435\u0436\u0438\u0442 \u0432 \u0434\u0440\u0443\u0433\u0443\u044E \u0441\u0442\u043E\u0440\u043E\u043D\u0443. \u041E\u043D\u0430 \u043A\u0440\u0438\u0447\u0438\u0442: \u00AB\u042F \u0437\u043D\u0430\u044E \u0433\u0434\u0435 \u041C\u044D\u0440\u0438! \u041E\u043D\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442 \u0441\u0432\u0435\u0440\u0445\u0443 \u0432\u043D\u0438\u0437! \u041D\u043E \u0432 \u043A\u043E\u043D\u0446\u0435 \u043F\u0443\u0442\u0438 \u043F\u0440\u043E\u0445\u043E\u0434 \u0432 \u0434\u0440\u0443\u0433\u043E\u0439 \u043C\u0438\u0440, \u0442\u0435\u0431\u0435 \u0442\u0443\u0434\u0430 \u043D\u0435 \u043D\u0443\u0436\u043D\u043E!\u00BB. \u0414\u0436\u0435\u0439\u043C\u0441 \u0431\u0435\u0436\u0438\u0442 \u0437\u0430 \u043D\u0435\u0439 \u043F\u043E \u0434\u043E\u0440\u043E\u0433\u0435, \u043D\u0430 \u0443\u043A\u0430\u0437\u0430\u0442\u0435\u043B\u0435 \u043D\u0430\u0434\u043F\u0438\u0441\u044C \u00AB\u0434\u0432\u0435 \u043C\u0438\u043B\u0438 A301 (A161)\u00BB, \u043E\u043D \u0441\u0432\u043E\u0440\u0430\u0447\u0438\u0432\u0430\u0435\u0442 \u043D\u0430\u043F\u0440\u0430\u0432\u043E, \u043D\u0430 \u0443\u0437\u043A\u0443\u044E \u0442\u0440\u043E\u043F\u0443. \u041E\u043F\u0430\u0441\u043D\u043E\u0435 \u043C\u0435\u0441\u0442\u043E, \u043F\u043E\u0434\u0443\u043C\u0430\u043B \u0414\u0436\u0435\u0439\u043C\u0441 \u043A\u0430\u0440\u0430\u0431\u043A\u0430\u044F\u0441\u044C \u0432\u0432\u0435\u0440\u0445, \u0441\u0432\u0435\u0440\u0445\u0443 \u043E\u043D \u043D\u0430\u0434\u0435\u044F\u043B\u0441\u044F \u0443\u0432\u0438\u0434\u0435\u0442\u044C \u0433\u0434\u0435 \u043F\u0440\u044F\u0447\u0435\u0442\u0441\u044F \u0434\u0435\u0432\u043E\u0447\u043A\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u00AB\u041E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u0441\u0442\u0435\u043D\u0430\u00BB - \u0435\u0434\u0438\u043D\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0435 \u0441\u043B\u043E\u0432\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043F\u0440\u0438\u0448\u043B\u0438 \u0432 \u0433\u043E\u043B\u043E\u0432\u0443, \u043A\u043E\u0433\u0434\u0430 \u0414\u0436\u0435\u0439\u043C\u0441 \u043E\u043A\u0438\u043D\u0443\u043B \u0432\u0437\u0433\u043B\u044F\u0434\u043E\u043C \u043E\u043A\u0440\u0435\u0441\u0442\u043D\u043E\u0441\u0442\u0438 \u0434\u043E\u0440\u043E\u0433\u0438 \u041D\u0435\u0431\u0435\u0441\u043D\u043E\u0433\u043E \u0443\u0449\u0435\u043B\u044C\u044F. \u0414\u0435\u0432\u043E\u0447\u043A\u0443 \u043E\u043D \u0442\u0430\u043A \u0438 \u043D\u0435 \u0443\u0432\u0438\u0434\u0435\u043B, \u0437\u0430\u0442\u043E \u0441\u0432\u0435\u0440\u0445\u0443 \u043E\u043D \u0441\u043C\u043E\u0433 \u0443\u0432\u0438\u0434\u0435\u0442\u044C, \u0442\u043E \u0447\u0442\u043E \u0441\u043A\u0440\u044B\u0442\u043E \u043E\u0442 \u0433\u043B\u0430\u0437.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0412\u043E\u0435\u043D\u043D\u043E-\u0433\u0440\u0443\u0437\u0438\u043D\u0441\u043A\u0430\u044F \u0434\u043E\u0440\u043E\u0433\u0430 3 \u043A\u043C. \u0421\u043A\u0430\u043B\u043E\u0434\u0440\u043E\u043C
TASK_CODE_3=f8l6n2
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0421\u043D\u043E\u0432\u0430 \u0432\u044B\u0439\u0434\u044F \u043D\u0430 \u0443\u043B\u0438\u0446\u0443 \u0438 \u043F\u0440\u043E\u0439\u0434\u044F \u043D\u0435\u043C\u043D\u043E\u0433\u043E \u043F\u043E \u043F\u0435\u0440\u0435\u0443\u043B\u043A\u0443, \u0414\u0436\u0435\u0439\u043C\u0441 \u0432\u043D\u043E\u0432\u044C \u0432\u0438\u0434\u0438\u0442 \u0442\u0443 \u0434\u0435\u0432\u043E\u0447\u043A\u0443, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0441\u0438\u0434\u0438\u0442 \u043D\u0430 \u0441\u0442\u0435\u043D\u0435 \u0440\u044F\u0434\u043E\u043C \u0441 \u0431\u0430\u0440\u043E\u043C, \u0438 \u0447\u0442\u043E-\u0442\u043E \u043D\u0430\u043F\u0435\u0432\u0430\u0435\u0442.\n\u0414\u0436\u0435\u0439\u043C\u0441: \u0427\u0442\u043E \u0442\u0430\u043A\u0430\u044F \u043C\u0430\u043B\u0435\u043D\u044C\u043A\u0430\u044F \u0434\u0435\u0432\u043E\u0447\u043A\u0430 \u0434\u0435\u043B\u0430\u0435\u0442 \u0432 \u0442\u0430\u043A\u043E\u043C \u043C\u0435\u0441\u0442\u0435?\n\u0414\u0435\u0432\u043E\u0447\u043A\u0430: \u0410? \u0422\u044B \u0447\u0442\u043E \u0433\u043B\u0443\u0445\u043E\u0439 \u0438\u043B\u0438 \u043A\u0430\u043A? \u041F\u043E\u044E \u044F.\n\u0414\u0436\u0435\u0439\u043C\u0441: \u0427\u0442\u043E \u044D\u0442\u043E \u0437\u0430 \u043F\u0435\u0441\u043D\u044F?\n\u0414\u0435\u0432\u043E\u0447\u043A\u0430: \u0410 \u0442\u0435\u0431\u0435 \u043A\u0430\u043A\u043E\u0435 \u0434\u0435\u043B\u043E!? \u0422\u044B \u0432\u0441\u0451 \u0440\u0430\u0432\u043D\u043E \u043D\u0435 \u043B\u044E\u0431\u0438\u043B \u041C\u044D\u0440\u0438!\n\u0414\u0436\u0435\u0439\u043C\u0441: \u042D\u0439, \u0441\u0442\u043E\u0439! \u041E\u0442\u043A\u0443\u0434\u0430 \u0442\u044B \u0437\u043D\u0430\u0435\u0448\u044C \u041C\u044D\u0440\u0438?!\n\u041A \u0442\u043E\u043C\u0443 \u043C\u043E\u043C\u0435\u043D\u0442\u0443, \u043A\u0430\u043A \u0414\u0436\u0435\u0439\u043C\u0441 \u0437\u0430\u043A\u0430\u043D\u0447\u0438\u0432\u0430\u0435\u0442 \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0435\u043D\u0438\u0435, \u0434\u0435\u0432\u043E\u0447\u043A\u0430 \u0443\u0436\u0435 \u0441\u043A\u0440\u044B\u043B\u0430\u0441\u044C \u0438\u0437 \u0432\u0438\u0434\u0443 \u0441\u043F\u0440\u044B\u0433\u043D\u0443\u0432 \u0437\u0430 \u0441\u0442\u0435\u043D\u0443.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0414\u0436\u0435\u0439\u043C\u0441 \u0437\u0430\u043F\u043E\u043C\u043D\u0438\u043B \u0442\u043E\u043B\u044C\u043A\u043E \u043F\u0440\u0438\u043F\u0435\u0432 \u043F\u0435\u0441\u043D\u0438 \u0434\u0435\u0432\u043E\u0447\u043A\u0438, \u00AB\u0416\u0430\u043B\u044C, \u0447\u0442\u043E \u0442\u0435\u0431\u044F \u0437\u0434\u0435\u0441\u044C \u043D\u0435\u0442\u00BB ... \u041D\u0430\u043F\u0440\u043E\u0442\u0438\u0432, \u0431\u044B\u043B \u0411\u0430\u0440 \u0441 \u044F\u0440\u043A\u043E\u0439 \u0432\u044B\u0432\u0435\u0441\u043A\u043E\u0439, \u0433\u0434\u0435 \u0414\u0436\u0435\u0439\u043C\u0441 \u0438 \u041C\u044D\u0440\u0438 \u043B\u044E\u0431\u0438\u043B\u0438 \u043E\u0442\u0434\u044B\u0445\u0430\u0442\u044C. \u0420\u0430\u0441\u0441\u043C\u0430\u0442\u0440\u0438\u0432\u0430\u044F \u0433\u0440\u0430\u0444\u0444\u0438\u0442\u0438 \u043D\u0430 \u0441\u0442\u0435\u043D\u0435, \u043E\u043D \u0432\u0441\u043F\u043E\u043C\u043D\u0438\u043B \u043E\u0442\u043A\u0440\u044B\u0442\u043A\u0443, \u043A\u043E\u0442\u043E\u0440\u0443\u044E, \u043A\u043E\u0433\u0434\u0430-\u0442\u043E \u0437\u0434\u0435\u0441\u044C \u0435\u043C\u0443 \u043F\u043E\u0434\u0430\u0440\u0438\u043B \u0431\u0430\u0440\u043C\u0435\u043D.
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0411\u0430\u0440 \u00ABWish\u00BB \u041C\u0430\u044F\u043A\u043E\u0432\u0441\u043A\u043E\u0433\u043E, 22
TASK_CODE_4=f1n9l4
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0414\u0436\u0435\u0439\u043C\u0441 \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u043B \u043F\u0443\u0442\u044C \u0447\u0435\u0440\u0435\u0437 \u043B\u0435\u0441\u043E\u043F\u0430\u0440\u043A, \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0431\u044B\u043B\u043E \u043D\u0435\u0447\u0438\u0442\u0430\u0435\u043C\u043E\u0435 \u0438\u0437-\u0437\u0430 \u0440\u0436\u0430\u0432\u0447\u0438\u043D\u044B, \u0430 \u043D\u0430 \u0442\u0430\u0431\u043B\u0438\u0447\u043A\u0435 \u043E\u0441\u0442\u0430\u043B\u043E\u0441\u044C \u044D\u0442\u043E \u2014 \u0413\u0426\u041F\u0415 \u041E\u0411 \u0423\u0421\u041F\u0420\u0424 \u0423\u0411\u041D \u0414\u0415\u0401 \u041F\u0417\u0419\u0413\u0411\u042F\u0423 \u0414\u0401\u0421\u041F\u0419 \u041C\u0401\u0414\u0401\u041E\u0415 \u0415\u0421\u0401\u0413\u041E\u0401\u0414\u041F \u042E\u0420\u041F\u0422\u0411. \u041E\u0442\u0442\u0443\u0434\u0430 \u0434\u043E \u00AB\u0437\u0430\u0432\u0435\u0442\u043D\u043E\u0433\u043E \u043C\u0435\u0441\u0442\u0430\u00BB, \u0435\u0441\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u043D\u0430 \u0434\u043E\u0440\u043E\u0442\u0430, \u043F\u043E \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0439\u0442\u0438. \u0422\u043E\u043B\u044C\u043A\u043E 1 \u0434\u043E\u0440\u043E\u0433\u0430, \u043D\u0435 \u0431\u043E\u043B\u044C\u0448\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1,1
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u043E\u0434\u043D\u0438\u043C\u0430\u044F\u0441\u044C \u043F\u043E \u043B\u0435\u0441\u043D\u043E\u0439 \u0442\u0440\u043E\u043F\u0438\u043D\u043A\u0435 \u0414\u0436\u0435\u0439\u043C\u0441 \u0432\u0441\u043F\u043E\u043C\u0438\u043D\u0430\u0435\u0442, \u043A\u043E\u0433\u0434\u0430 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0438\u0439 \u0440\u0430\u0437 \u0432\u0438\u0434\u0435\u043B \u0436\u0435\u043D\u0443. \u0412\u0434\u0440\u0443\u0433 \u0432 \u0433\u043E\u043B\u043E\u0432\u0435 \u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u0441\u044F \u0441\u043B\u044B\u0448\u0435\u043D \u0433\u043E\u043B\u043E\u0441 \u041C\u044D\u0440\u0438: \u00AB\u041F\u0440\u043E\u0448\u0443, \u043F\u043E\u0442\u043E\u0440\u043E\u043F\u0438\u0441\u044C. \u0422\u044B \u0437\u0430\u0431\u043B\u0443\u0434\u0438\u043B\u0441\u044F? \u042F \u0431\u043B\u0438\u0437\u043A\u043E, \u0432\u0441\u0435\u0433\u043E \u043A\u0430\u043A\u0438\u0445-\u0442\u043E 250 \u043C\u0435\u0442\u0440\u043E\u0432.  \u042F \u043F\u043E\u0431\u043B\u0438\u0437\u043E\u0441\u0442\u0438, \u0414\u0436\u0435\u0439\u043C\u0441. \u043F\u0440\u043E\u0448\u0443. \u042F \u0445\u043E\u0447\u0443 \u0443\u0432\u0438\u0434\u0435\u0442\u044C \u0442\u0435\u0431\u044F \u041E\u0434\u0438\u043D \u0440\u0430\u0437, \u0414\u0436\u0435\u0439\u043C\u0441. \u0422\u044B \u0441\u043B\u044B\u0448\u0438\u0448\u044C \u043C\u0435\u043D\u044F? \u0414\u0436\u0435\u0439\u043C\u0441\u2026\u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0414\u0436\u0435\u0439\u043C\u0441\u2026 \u0414\u0436\u0435\u0439\u043C\u0441\u2026 \u042E\u043B\u0438\u0439\u2026\u00BB
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0412\u0425\u041E\u0414 \u041D\u0410 \u0422\u0420\u041E\u041F\u0423 \u0422\u0410\u041C, \u0413\u0414\u0415 \u041E\u0416\u0418\u0412\u0410\u042E\u0422 \u0413\u0415\u0420\u041E\u0418 \u041B\u0415\u0413\u0415\u041D\u0414 \u0414\u0420\u0415\u0412\u041D\u0415\u0413\u041E \u042D\u041F\u041E\u0421\u0410\n\u0422\u0435\u0440\u0440\u0435\u043D\u043A\u0443\u0440 250 \u043C\u0435\u0442\u0440\u043E\u0432 \u043F\u043E \u0442\u0440\u043E\u043F\u0435 \u043A \u0434\u0435\u043D\u0434\u0440\u0430\u0440\u0438\u044E
TASK_CODE_5=f12ln7
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n\u2026\u0414\u0436\u0435\u0439\u043C\u0441 \u043F\u043E\u0441\u0435\u043B\u0438\u043B\u0441\u044F \u0432 \u0442\u043E\u043C \u0436\u0435 \u043E\u0442\u0435\u043B\u0435, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C, \u043E\u043D\u0438 \u043E\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u043B\u0438\u0441\u044C \u0442\u0440\u0438 \u0433\u043E\u0434\u0430 \u043D\u0430\u0437\u0430\u0434. \u041E\u043D \u043D\u0430\u0448\u0435\u043B \u0432\u0438\u0434\u0435\u043E\u043A\u0430\u0441\u0441\u0435\u0442\u0443, \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u043E\u043D\u0438 \u0441 \u0436\u0435\u043D\u043E\u0439 \u0437\u0430\u0431\u044B\u043B\u0438 \u0442\u043E\u0433\u0434\u0430. \u0412 \u043D\u0430\u0447\u0430\u043B\u0435 \u0437\u0430\u043F\u0438\u0441\u0438 \u041C\u044D\u0440\u0438 \u0441\u0442\u043E\u0438\u0442 \u043E\u043A\u043E\u043B\u043E \u043E\u043A\u043D\u0430 \u0432 \u043D\u043E\u043C\u0435\u0440\u0435 \u0438 \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442 \u043A\u0430\u0448\u043B\u044F\u0442\u044C. \u0412\u0438\u0434\u0435\u043E \u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u0441\u044F \u0437\u0435\u0440\u043D\u0438\u0441\u0442\u044B\u043C. \u0412 \u043A\u043E\u043D\u0446\u0435 \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u043D\u0430 \u043B\u0435\u0436\u0438\u0442 \u043D\u0430 \u043A\u0440\u043E\u0432\u0430\u0442\u0438, \u043F\u043E\u0434\u0445\u043E\u0434\u0438\u0442 \u0414\u0436\u0435\u0439\u043C\u0441. \u041E\u043D \u043D\u0430\u043A\u043B\u043E\u043D\u044F\u0435\u0442\u0441\u044F \u0438 \u0442\u044F\u043D\u0435\u0442\u0441\u044F \u0437\u0430 \u043F\u043E\u0434\u0443\u0448\u043A\u043E\u0439 \u0443 \u0438\u0437\u0433\u043E\u043B\u043E\u0432\u044C\u044F. \u0412\u0438\u0434\u0435\u043E \u0441\u043D\u043E\u0432\u0430 \u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u0441\u044F \u0437\u0435\u0440\u043D\u0438\u0441\u0442\u044B\u043C, \u043D\u043E \u043F\u0440\u043E\u0441\u043C\u0430\u0442\u0440\u0438\u0432\u0430\u044E\u0442\u0441\u044F \u043A\u0430\u0434\u0440\u044B, \u043D\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043C\u043E\u0436\u043D\u043E \u0437\u0430\u043C\u0435\u0442\u0438\u0442\u044C, \u043A\u0430\u043A \u0414\u0436\u0435\u0439\u043C\u0441 \u0434\u0443\u0448\u0438\u0442 \u041C\u044D\u0440\u0438 \u043F\u043E\u0434\u0443\u0448\u043A\u043E\u0439. \u0417\u0430\u043F\u0438\u0441\u044C \u0437\u0430\u043A\u0430\u043D\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F. \u0412 \u0442\u043E\u0442 \u0434\u0435\u043D\u044C \u0414\u0436\u0435\u0439\u043C\u0441 \u0442\u043E\u043B\u044C\u043A\u043E \u0432\u0435\u0440\u043D\u0443\u043B\u0441\u044F \u0441\u043E \u0441\u043C\u0435\u043D\u044B \u0438 \u043D\u0435 \u0443\u0441\u043F\u0435\u043B \u0441\u043D\u044F\u0442\u044C \u0441\u0438\u043D\u044E\u044E \u0441\u043F\u0435\u0446\u043E\u0432\u043A\u0443. \u041D\u0430 \u043D\u0435\u0439 \u0431\u044B\u043B \u043B\u043E\u0433\u043E\u0442\u0438\u043F - \u0431\u0435\u043B\u0430\u044F \u0431\u0443\u043A\u0432\u0430 \u00AB\u0414\u00BB \u0432\u043F\u0438\u0441\u0430\u043D\u043D\u0430\u044F \u0432 \u0440\u043E\u043C\u0431.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041E\u0442\u0435\u043B\u044C \u043D\u0430\u0437\u044B\u0432\u0430\u043B\u0441\u044F \u00ABKer Men\u00BB, \u0430 \u0436\u0438\u043B\u0438 \u043E\u043D\u0438 \u0432 \u043D\u043E\u043C\u0435\u0440\u0435 12. \u0412\u0437\u0433\u043B\u044F\u0434 \u041C\u044D\u0440\u0438 \u0437\u0430\u0441\u0442\u044B\u043B \u0441\u043C\u043E\u0442\u0440\u044F \u043A\u0443\u0434\u0430-\u0442\u043E \u0432\u0434\u0430\u043B\u044C, \u043E\u043D\u0430 \u0441\u0442\u0430\u043B\u0430 \u043F\u043E\u0445\u043E\u0436\u0430 \u043D\u0430 \u043A\u0430\u043C\u0435\u043D\u043D\u0443\u044E \u0441\u0442\u0430\u0442\u0443\u044E.\n\u2026\u041D\u0430\u043A\u043E\u043D\u0435\u0446-\u0442\u043E, \u0432\u0434\u0430\u043B\u0438, \u043E\u043D \u0443\u0432\u0438\u0434\u0435\u043B \u0437\u043D\u0430\u043A\u043E\u043C\u044B\u0439 \u043F\u0435\u0439\u0437\u0430\u0436 \u0438\u0445 \u00AB\u0437\u0430\u0432\u0435\u0442\u043D\u043E\u0433\u043E \u043C\u0435\u0441\u0442\u0430\u00BB.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u0435\u0440\u043C\u0435\u043D\u0438\u0441\u0442\u043E\u0432, 12
TASK_CODE_6=f8l2n9
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\u0412\u043E\u0442 \u043E\u043D\u043E - \u00AB\u0437\u0430\u0432\u0435\u0442\u043D\u043E\u0435 \u043C\u0435\u0441\u0442\u043E\u00BB, \u043D\u043E \u043C\u044B \u043D\u0435 \u043C\u043E\u0436\u0435\u043C \u0437\u0430\u0433\u043B\u044F\u043D\u0443\u0442\u044C \u0432\u0433\u043B\u0443\u0431\u044C \u043C\u0443\u0442\u043D\u043E\u0439 \u0432\u043E\u0434\u044B \u0438 \u0443\u0437\u043D\u0430\u0442\u044C, \u0447\u0442\u043E \u0441\u043A\u0440\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u043D\u0430 \u0434\u043D\u0435, - \u0442\u0430\u043A \u0436\u0435 \u0438 \u0414\u0436\u0435\u0439\u043C\u0441, \u043D\u0430 \u0444\u043E\u043D\u0435 \u0441\u0442\u0440\u0435\u0441\u0441\u0430 \u043E\u0442 \u043F\u0435\u0440\u0435\u0436\u0438\u0442\u044B\u0445 \u0441\u043E\u0431\u044B\u0442\u0438\u0439 \u0437\u0430\u0431\u044B\u0432\u0448\u0438\u0439 \u043F\u0440\u0430\u0432\u0434\u0443 \u043E\u0431 \u0443\u0431\u0438\u0439\u0441\u0442\u0432\u0435 \u0436\u0435\u043D\u044B, \u0434\u043E \u0441\u0430\u043C\u043E\u0433\u043E \u043A\u043E\u043D\u0446\u0430 \u043D\u0435 \u043C\u043E\u0433 \u0437\u0430\u0433\u043B\u044F\u043D\u0443\u0442\u044C \u0432 \u0433\u043B\u0443\u0431\u0438\u043D\u044B \u0441\u0432\u043E\u0435\u0433\u043E \u0437\u0430\u043C\u0443\u0442\u043D\u0435\u043D\u043D\u043E\u0433\u043E \u043F\u043E\u0434\u0441\u043E\u0437\u043D\u0430\u043D\u0438\u044F, \u0447\u0442\u043E\u0431\u044B \u0432\u0437\u0433\u043B\u044F\u043D\u0443\u0442\u044C \u0432 \u0433\u043B\u0430\u0437\u0430 \u0441\u0442\u0440\u0430\u0448\u043D\u043E\u0439 \u043F\u0440\u0430\u0432\u0434\u0435 \u0438 \u0440\u0430\u0441\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u0432\u0441\u0435 \u0442\u043E\u0447\u043A\u0438. \u041E\u0442\u0434\u0435\u043B\u044C\u043D\u044B\u0435 \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u044B \u043C\u044B\u0441\u043B\u0435\u0439 \u0441\u043B\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0447\u0435\u0441\u0442\u044C, \u043D\u043E \u044D\u0442\u0430 \u0444\u043E\u0440\u043C\u0443\u043B\u0430 \u0434\u0430\u0435\u0442 \u0441\u0432\u043E\u0431\u043E\u0434\u0443 \u0440\u0430\u0437\u0443\u043C\u0443, \u043F\u043E\u0440\u044F\u0434\u043E\u043A \u043C\u044B\u0441\u043B\u044F\u043C \u0438 \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u0438\u0435 \u043F\u0443\u0442\u0438. MoEsIrH RuGdNpPu\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u043E\u0441\u043B\u0435 \u043F\u0435\u0440\u0435\u0436\u0438\u0442\u043E\u0433\u043E \u0438 \u043E\u0441\u043E\u0437\u043D\u0430\u043D\u043D\u043E\u0433\u043E \u0443\u0436\u0430\u0441\u0430 \u043F\u0440\u043E\u0438\u0437\u043E\u0448\u0435\u0434\u0448\u0435\u0433\u043E \u0414\u0436\u0435\u0439\u043C\u0441 \u0440\u0435\u0448\u0430\u0435\u0442 \u043D\u0430\u0447\u0430\u0442\u044C \u0436\u0438\u0442\u044C \u0441 \u0447\u0438\u0441\u0442\u043E\u0433\u043E \u043B\u0438\u0421\u0422\u0430 \u0438 \u043F\u043E\u0439\u0442\u0438 \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0423\u0447\u0438\u0442\u0435\u043B\u0435\u043C \u0445\u0438\u043C\u0438\u0438...  \u041F\u0435\u0440\u0438\u043E\u0434\u0438\u0447\u0435\u0441\u043A\u0443\u044E \u0441\u0438\u0441\u0442\u0435\u043C\u0443 \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u043E\u0432 \u043E\u043D \u0437\u043D\u0430\u0435\u0442 \u043D\u0430\u0438\u0437\u0443\u0441\u0442\u044C.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0422 \u0423\u0447\u0438\u0442\u0435\u043B\u044C 42.99771 44.649394\n(\u0448\u0438\u0444\u0440 \u041F\u043E\u0440\u044F\u0434\u043A\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0445\u0438\u043C.\u044D\u043B\u0435\u043C\u0435\u043D\u0442\u043E\u0432, \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0430\u0442\u044B)
TASK_CODE_7=f1l1n1
BONUS_FIVE_MINUTES=f41ln8
BONUS_TEN_MINUTES=f52ln8
BONUS_FIFTEEN_MINUTES=f63ln8