#Sun Sep 17 21:30:01 MSK 2017
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0441 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0412\u0438\u043D\u0442\u0435\u0440\u0444\u0435\u043B\u043B \u0440\u0430\u0441\u043A\u0438\u043D\u0443\u043B\u0441\u044F \u0441\u0440\u0435\u0434\u0438 \u0436\u0438\u0432\u043E\u043F\u0438\u0441\u043D\u0435\u0439\u0448\u0438\u0445 \u043B\u0435\u0441\u043E\u0432. \u0420\u043E\u0431\u0435\u0440\u0442\u0430 \u0411\u0430\u0440\u0430\u0442\u0435\u043E\u043D\u0430 \u0441\u043E\u043F\u0440\u043E\u0432\u043E\u0436\u0434\u0430\u043B \u0432\u0435\u0440\u043D\u044B\u0439 \u043F\u0430\u0436 \u041F\u043A\u0438\u043E. \u0418\u0445 \u043F\u0443\u0442\u044C \u043F\u0440\u043E\u043B\u0435\u0433\u0430\u043B \u043F\u043E \u043C\u043E\u0441\u0442\u0443, \u043D\u0430\u0434 \u0447\u0438\u0441\u0442\u0435\u0439\u0448\u0438\u043C\u0438 \u0432\u043E\u0434\u0430\u043C\u0438, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u043F\u043B\u0430\u0432\u0430\u043B\u0438 \u043F\u0440\u0435\u043A\u0440\u0430\u0441\u043D\u0435\u0439\u0448\u0438\u0435 \u043F\u0442\u0438\u0446\u044B. \u041D\u043E \u0432\u0441\u043A\u043E\u0440\u0435, \u0441\u0432\u0435\u0440\u043D\u0443\u0432 \u043D\u0435 \u0442\u0443\u0434\u0430, \u0441\u0432\u0438\u0442\u0430 \u043A\u043E\u0440\u043E\u043B\u044F \u0437\u0430\u043F\u043B\u0443\u0442\u0430\u043B\u0430. \u0418\u043C \u043F\u0440\u0438\u0448\u043B\u043E\u0441\u044C \u0441\u043F\u0440\u0430\u0448\u0438\u0432\u0430\u0442\u044C \u0434\u043E\u0440\u043E\u0433\u0443 \u0443 \u043F\u0435\u0440\u0432\u044B\u0445 \u0432\u0441\u0442\u0440\u0435\u0447\u043D\u044B\u0445. "\u041A\u0430\u043A \u043F\u0440\u043E\u0435\u0445\u0430\u0442\u044C \u0432 \u0412\u0438\u043D\u0442\u0435\u0440\u0444\u0435\u043B\u043B?" - \u0432\u043E\u0442 \u043F\u0435\u0440\u0432\u044B\u0439 \u0432\u043E\u043F\u0440\u043E\u0441, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0438\u0445 \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043E\u0432\u0430\u043B.
GAME_LEGEND=\u0418\u0433\u0440\u0430 \u043F\u0440\u0435\u0441\u0442\u043E\u043B\u043E\u0432.\n\n\u041B\u0435\u0442\u043E, \u0434\u043B\u0438\u0432\u0448\u0435\u0435\u0441\u044F \u043F\u043E\u0447\u0442\u0438 \u0434\u0435\u0441\u044F\u0442\u0438\u043B\u0435\u0442\u0438\u0435, \u043F\u043E\u0434\u0445\u043E\u0434\u0438\u0442 \u043A \u043A\u043E\u043D\u0446\u0443. \u0412\u043E\u043A\u0440\u0443\u0433 \u0416\u0435\u043B\u0435\u0437\u043D\u043E\u0433\u043E \u0442\u0440\u043E\u043D\u0430 \u0437\u0440\u0435\u0435\u0442 \u0437\u0430\u0433\u043E\u0432\u043E\u0440 \u2013 \u0443\u0431\u0438\u0432\u0430\u044E\u0442 \u0434\u0435\u0441\u043D\u0438\u0446\u0443 \u043A\u043E\u0440\u043E\u043B\u044F \u043B\u043E\u0440\u0434\u0430 \u0410\u0440\u0440\u0435\u043D\u0430. \u041A\u043E\u0440\u043E\u043B\u044C \u0420\u043E\u0431\u0435\u0440\u0442 \u0411\u0430\u0440\u0430\u0442\u0435\u043E\u043D \u0440\u0435\u0448\u0430\u0435\u0442 \u0438\u0441\u043A\u0430\u0442\u044C \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u0438 \u0443 \u0441\u0432\u043E\u0435\u0433\u043E \u043B\u0443\u0447\u0448\u0435\u0433\u043E \u0434\u0440\u0443\u0433\u0430 \u042D\u0434\u0434\u0430\u0440\u0434\u0430 \u0421\u0442\u0430\u0440\u043A\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0438\u0442\u044C \u043C\u0435\u0441\u0442\u043E \u043F\u043E\u0434\u043B\u0435 \u0441\u0435\u0431\u044F, \u0432 \u0440\u043E\u043B\u0438 \u0434\u0435\u0441\u043D\u0438\u0446\u044B. \u041A\u043E\u0440\u043E\u043B\u044C \u043F\u043E\u043A\u0438\u0434\u0430\u0435\u0442 \u0441\u0442\u043E\u043B\u0438\u0446\u0443, \u0435\u0433\u043E \u0436\u0434\u0435\u0442 \u0443\u0442\u043E\u043C\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0439 \u043F\u0443\u0442\u044C \u043D\u0430 \u0441\u0435\u0432\u0435\u0440...
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0435\u0440\u0432\u043E\u0435 \u0447\u0438\u0441\u043B\u043E \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0441\u043B\u043E\u0432\u0443, \u0432\u0442\u043E\u0440\u043E\u0435 \u2013 \u0431\u0443\u043A\u0432\u0435.
TASK_CODE_6=8AN55G
START_CODE=nb
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041A\u0435\u0439\u0442\u0438\u043B\u0438\u043D \u0441 \u0442\u0440\u0435\u0432\u043E\u0433\u043E\u0439 \u0432\u0447\u0438\u0442\u044B\u0432\u0430\u043B\u0430\u0441\u044C \u0432 \u0441\u043B\u043E\u0432\u0430, \u043E\u0441\u043E\u0431\u0435\u043D\u043D\u043E \u0435\u0435 \u043F\u0443\u0433\u0430\u043B\u043E 21 \u0441\u043B\u043E\u0432\u043E \u2013 \u041B\u0430\u043D\u043D\u0438\u0441\u0442\u0435\u0440\u044B.
TASK_CODE_4=A3N4G2
TASK_CODE_3=1A9NG5
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u0434\u0437\u0435\u043C\u043A\u0438.
TASK_CODE_2=AN18G1
TASK_CODE_1=3A3NG7
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0422\u0430\u043C \u043D\u0430 \u0441\u0442\u0435\u043D\u0435 \u043A\u0440\u0443\u0433\u043B\u043E\u0441\u0443\u0442\u043E\u0447\u043D\u0443\u044E \u0432\u0430\u0445\u0442\u0443 \u043D\u0435\u0441\u0443\u0442 \u0434\u043E\u0437\u043E\u0440\u043D\u044B\u0435. \u0413\u043E\u0442\u043E\u0432\u044B\u0435 \u043F\u043E \u043F\u0435\u0440\u0432\u043E\u043C\u0443 \u0436\u0435 \u043F\u0440\u0438\u0437\u044B\u0432\u0443 \u0441\u043E\u0440\u0432\u0430\u0442\u044C\u0441\u044F \u0438\u0437 \u0441\u0432\u043E\u0435\u0433\u043E \u043C\u0430\u043B\u043E\u043D\u0430\u0441\u0435\u043B\u0435\u043D\u043D\u043E\u0433\u043E \u043C\u0435\u0433\u0430\u043F\u043E\u043B\u0438\u0441\u0430 \u0432 \u043F\u0443\u0442\u044C. \u0427\u0435\u0440\u0435\u0437 \u043F\u043E\u0434\u0437\u0435\u043C\u0435\u043B\u044C\u0435, \u0437\u0430 \u0441\u0442\u0435\u043D\u0443.  \u0422\u0443\u0434\u0430 \u0433\u0434\u0435, \u041A\u0430\u0440\u0443\u0441\u0435\u043B\u044C \u0441\u043E\u0431\u044B\u0442\u0438\u0439 \u0437\u0430\u043A\u0440\u0443\u0442\u0438\u0442 \u0438\u0445 \u0447\u0443\u0442\u044C \u0434\u0430\u043B\u044C\u0448\u0435, \u0447\u0435\u043C \u0431\u044B \u0438\u043C \u044D\u0442\u043E\u0433\u043E \u0445\u043E\u0442\u0435\u043B\u043E\u0441\u044C.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B \u0413\u0440\u0438\u0431\u043E\u0435\u0434\u043E\u0432\u0430, \u0437\u0430 \u041A\u0438\u043C\u043C\u0435\u0440\u0438
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041C\u043E\u0436\u0435\u0442 \u0432\u0441\u043F\u044B\u0445\u043D\u0443\u0442\u044C \u043F\u0435\u0440\u0435\u0432\u043E\u0440\u043E\u0442, \u0432\u0435\u0434\u044C \u041D\u0435\u0434 \u0445\u043E\u0447\u0435\u0442 \u043F\u043E\u0441\u0430\u0434\u0438\u0442\u044C \u043D\u0430 \u0442\u0440\u043E\u043D \u0421\u0442\u0430\u043D\u0438\u0441\u0430. \u041E\u0434\u043D\u0430\u043A\u043E \u0417\u0410 \u0411\u0420\u0410\u0422\u042C\u042F\u041C\u0418 \u0433\u043E\u0440\u043E\u0434\u0441\u043A\u0430\u044F \u0441\u0442\u0440\u0430\u0436\u0430, \u0438 \u041D\u0435\u0434\u0443 \u043E\u0441\u0442\u0430\u0435\u0442\u0441\u044F \u0441\u043C\u0435\u0440\u0438\u0442\u044C\u0441\u044F \u0441 \u0442\u0435\u043C, \u0447\u0442\u043E \u0437\u0430\u0432\u0435\u0449\u0430\u043D\u0438\u0435 \u0433\u0440\u0438\u0431\u043E\u0435\u0434\u0430 \u043E\u0441\u0442\u0430\u043D\u0435\u0442\u0441\u044F \u043D\u0435 \u0438\u0441\u043F\u043E\u043B\u043D\u0435\u043D\u043D\u044B\u043C.
START_TIME=22-00
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0430\u0440\u043A \u043A\u0443\u043B\u044C\u0442\u0443\u0440\u044B \u0438 \u043E\u0442\u0434\u044B\u0445\u0430. \u041E\u043A\u043E\u043B\u043E \u043F\u0440\u0443\u0434\u0430.
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0430\u0439\u0442\u0438 \u043D\u0443\u0436\u043D\u043E\u0433\u043E \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430, \u043E\u043A\u0430\u0437\u0430\u043B\u043E\u0441\u044C \u0441\u043B\u043E\u0436\u043D\u043E. \u041E\u0434\u043D\u0430\u043A\u043E \u043B\u0435\u0431\u0435\u0434\u0438 \u0443\u043A\u0430\u0437\u0430\u043B\u0438 \u0438\u043C \u043F\u0443\u0442\u044C. \u0413\u043B\u0430\u0432\u043D\u043E\u0435 \u043D\u0435 \u0437\u0430\u0431\u044B\u0442\u044C \u043D\u0443\u0436\u043D\u044B\u0439 \u0432\u043E\u043F\u0440\u043E\u0441.
TASK_CODE_5=A76N1G
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B. \u0413\u043B\u0438\u043D\u043A\u0438.
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u042D\u0434 \u0440\u0435\u0448\u0430\u0435\u0442, \u0447\u0442\u043E \u0435\u0433\u043E \u0434\u0435\u043B\u043E \u043F\u043E\u043C\u043E\u0433\u0430\u0442\u044C \u043A\u043E\u0440\u043E\u043B\u044E, \u043A\u0430\u043A \u0444\u0443\u0442\u0431\u043E\u043B\u0438\u0441\u0442\u043E\u0432 \u2013 \u0438\u0433\u0440\u0430\u0442\u044C, \u0430 \u043C\u0435\u0442\u0430\u043B\u043B\u0443\u0440\u0433\u043E\u0432 \u2013 \u043F\u043E\u043B\u0443\u0447\u0430\u0442\u044C \u043C\u0435\u0442\u0430\u043B\u043B. \u0412 \u0433\u043E\u043B\u043E\u0432\u0435 \u0443 \u043D\u0435\u0433\u043E \u043F\u043E\u0441\u0442\u043E\u044F\u043D\u043D\u043E \u043A\u0440\u0443\u0442\u0438\u0442\u0441\u044F \u043C\u044B\u0441\u043B\u044C, \u0432\u044B\u0441\u043A\u0430\u0437\u0430\u043D\u043D\u0430\u044F \u0436\u0435\u043D\u043E\u0439. \u0418\u043D\u0442\u0435\u0440\u0435\u0441\u043D\u043E, \u0443 \u043A\u043E\u0433\u043E \u043E\u043D\u0430 \u0435\u0435 \u0443\u0441\u043B\u044B\u0448\u0430\u043B\u0430.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u043F\u043E\u0432\u0430
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0421\u0440\u0435\u0434\u0438 \u043F\u0440\u0438\u0433\u043B\u0430\u0448\u0435\u043D\u043D\u044B\u0445, \u0431\u043E\u043B\u044C\u0448\u043E\u0435 \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0431\u0443\u0434\u0435\u0442 \u0437\u0430 \u043F\u043E\u043F\u0430\u043C\u0438, \u043D\u0430 \u0447\u0442\u043E \u043D\u0430\u0434\u043E \u043E\u0431\u0440\u0430\u0442\u0438\u0442\u044C \u043F\u0440\u0438\u0441\u0442\u0430\u043B\u044C\u043D\u043E\u0435 \u0432\u043D\u0438\u043C\u0430\u043D\u0438\u0435. \u0418 \u043A\u043E\u043D\u0435\u0447\u043D\u043E, \u0432 \u0441\u0432\u044F\u0437\u0438 \u0441 \u044D\u0442\u0438\u043C \u0432 \u0433\u043E\u0440\u043E\u0434 \u0441\u0442\u0430\u043B\u043E \u0441\u0442\u0435\u043A\u0430\u0442\u044C\u0441\u044F \u0431\u043E\u043B\u044C\u0448\u043E\u0435 \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0440\u044B\u0446\u0430\u0440\u0435\u0439. \u0412\u0435\u0434\u044C \u043A\u0442\u043E \u043D\u0435 \u0445\u043E\u0447\u0435\u0442 \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u041E\u0440\u0434\u0435\u043D \u0434\u0440\u0443\u0436\u0431\u044B.
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n\u0412\u0441\u043A\u043E\u0440\u0435 \u043F\u043E\u0441\u043B\u0435 \u0442\u0443\u0440\u043D\u0438\u0440\u0430, \u043D\u0430 \u043E\u0445\u043E\u0442\u0435 \u043F\u043E\u0433\u0438\u0431\u0430\u0435\u0442 \u0420\u043E\u0431\u0435\u0440\u0442. \u0421\u043C\u0435\u0440\u0442\u044C \u043E\u0447\u0435\u043D\u044C \u0441\u0442\u0440\u0430\u043D\u043D\u0430\u044F. \u0422\u043E\u043B\u0438 \u043E\u043D \u0431\u044B\u043B \u043D\u0435 \u0432\u043D\u0438\u043C\u0430\u0442\u0435\u043B\u0435\u043D, \u0432\u0435\u0434\u044C \u043D\u0430 \u043E\u0445\u043E\u0442\u0435 \u043D\u0435 \u0441\u043B\u0435\u0434\u0443\u0435\u0442 \u0435\u0441\u0442\u044C \u0433\u0440\u0438\u0431\u044B, \u0442\u043E\u043B\u0438 \u043A \u044D\u0442\u043E\u043C\u0443 \u043F\u0440\u0438\u043B\u043E\u0436\u0438\u043B\u0438 \u0440\u0443\u043A\u0443 \u041B\u0430\u043D\u043D\u0438\u0441\u0442\u0435\u0440\u044B. \u0412 \u0438\u0442\u043E\u0433\u0435 \u043D\u0430 \u043F\u0440\u0435\u0441\u0442\u043E\u043B, \u0441\u043B\u0435\u0434\u043E\u043C \u0437\u0430 \u0420\u043E\u0431\u0435\u0440\u0442\u043E\u043C \u0432\u043E\u0441\u0445\u043E\u0434\u0438\u0442 \u043E\u0434\u0438\u043D \u0438\u0437 \u0431\u0440\u0430\u0442\u044C\u0435\u0432 \u0438\u0437 \u0441\u044B\u043D\u043E\u0432\u0435\u0439 \u0421\u0435\u0440\u0441\u0435\u0438. \u0418 \u0442\u0435\u043F\u0435\u0440\u044C \u0435\u043C\u0443 \u043F\u0440\u0435\u0434\u0441\u0442\u043E\u0438\u0442 \u0441\u0442\u0440\u043E\u0438\u0442\u044C \u0433\u043E\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u043E. \u041F\u0440\u0438\u0441\u044F\u0433\u0443 \u043E\u043D \u043F\u0440\u0438\u043D\u044F\u043B \u0437\u0430 \u0410\u043A\u043A\u043E\u0301\u0437\u0441\u043A\u0438\u043C \u0432\u0430\u043B\u043E\u043C.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+
START_DATE=11-11-2017
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165 (\u0441\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u042D\u0434\u0434\u0430\u0440\u0434 \u043F\u0440\u0438\u0441\u043E\u0435\u0434\u0438\u043D\u044F\u0435\u0442\u0441\u044F \u043A \u041C\u0430\u043B\u043E\u043C\u0443 \u0421\u043E\u0432\u0435\u0442\u0443, \u0441\u043E\u0441\u0442\u043E\u044F\u0449\u0435\u043C\u0443 \u0438\u0437 \u0431\u0440\u0430\u0442\u0430 \u043A\u043E\u0440\u043E\u043B\u044F, \u043B\u043E\u0440\u0434\u0430 \u0420\u0435\u043D\u043B\u0438, \u0435\u0432\u043D\u0443\u0445\u0430 \u043B\u043E\u0440\u0434\u0430 \u0412\u0430\u0440\u0438\u0441\u0430, \u0432\u0435\u043B\u0438\u043A\u043E\u0433\u043E \u043C\u0435\u0439\u0441\u0442\u0435\u0440\u0430 \u041F\u0438\u0446\u0435\u043B\u044F  \u0438 \u043C\u0430\u0441\u0442\u0435\u0440\u0430 \u043D\u0430\u0434 \u043C\u043E\u043D\u0435\u0442\u043E\u0439 \u043B\u043E\u0440\u0434\u0430 \u041F\u0435\u0442\u0438\u0440\u0430 "\u041C\u0438\u0437\u0438\u043D\u0446\u0430" \u0411\u0435\u0439\u043B\u0438\u0448\u0430. \u0420\u0435\u043D\u043B\u0438 \u043E\u0431\u044A\u044F\u0432\u043B\u044F\u0435\u0442, \u0447\u0442\u043E \u0420\u043E\u0431\u0435\u0440\u0442 \u043F\u043B\u0430\u043D\u0438\u0440\u0443\u0435\u0442 \u043F\u0440\u043E\u0432\u0435\u0441\u0442\u0438 \u0431\u043E\u043B\u044C\u0448\u043E\u0439 \u0442\u0443\u0440\u043D\u0438\u0440 \u0432 \u0447\u0435\u0441\u0442\u044C \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u042D\u0434\u0434\u0430\u0440\u0434\u0430 \u043D\u0430 \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u044C \u0414\u0435\u0441\u043D\u0438\u0446\u044B \u043A\u043E\u0440\u043E\u043B\u044F. \u042D\u0434\u0434\u0430\u0440\u0434 \u0443\u0437\u043D\u0430\u0451\u0442, \u0447\u0442\u043E \u043A\u043E\u0440\u043E\u043D\u0430 \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432 \u043A\u0440\u0443\u043F\u043D\u043E\u0439 \u0437\u0430\u0434\u043E\u043B\u0436\u0435\u043D\u043D\u043E\u0441\u0442\u0438, \u0432 \u043F\u0435\u0440\u0432\u0443\u044E \u043E\u0447\u0435\u0440\u0435\u0434\u044C \u0443 \u043E\u0442\u0446\u0430 \u043A\u043E\u0440\u043E\u043B\u0435\u0432\u044B, \u043B\u043E\u0440\u0434\u0430 \u0422\u0430\u0439\u0432\u0438\u043D\u0430 \u041B\u0430\u043D\u043D\u0438\u0441\u0442\u0435\u0440\u0430. \u0418 \u043F\u0440\u043E\u0442\u0438\u0432 \u044D\u0442\u043E\u0439 \u0440\u0430\u0441\u0442\u0440\u0430\u0442\u044B.  \u041D\u043E \u0420\u0435\u043D\u043B\u0438 \u0443\u0436\u0435 \u0432\u0441\u0435 \u0440\u0435\u0448\u0438\u043B \u2013 \u0441\u043E\u0431\u044B\u0442\u0438\u0435 \u043F\u0440\u043E\u0439\u0434\u0435\u0442 \u0437\u0430 \u043C\u0435\u0441\u0442\u043D\u044B\u043C \u0430\u043B\u044C\u043C\u0430-\u043C\u0430\u0442\u0435\u0440\u043E\u043C.  \u0418 \u043F\u043E\u0431\u0435\u0434\u0438\u0442\u0435\u043B\u044E \u0432\u0440\u0443\u0447\u0430\u0442 \u041E\u0440\u0434\u0435\u043D \u0434\u0440\u0443\u0436\u0431\u044B \u043D\u0430\u0440\u043E\u0434\u043E\u0432 \u0421\u0435\u043C\u0438 \u043A\u043E\u0440\u043E\u043B\u0435\u0432\u0441\u0442\u0432.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3 \u0438 2+
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n\u0414\u0436\u043E\u043D \u0421\u043D\u043E\u0443 \u0435\u0434\u0435\u0442 \u043D\u0430 \u0441\u0442\u0435\u043D\u0443. \u0417\u0434\u0435\u0441\u044C \u043B\u0438\u0445\u043E \u0437\u0430\u043A\u0440\u0443\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0441\u044E\u0436\u0435\u0442. \u0417\u0430\u043C\u043E\u043A \u041D\u043E\u0447\u043D\u043E\u0433\u043E \u0434\u043E\u0437\u043E\u0440\u0430 \u0435\u0449\u0435 \u0442\u043E \u043C\u0435\u0441\u0442\u043E.  \u0417\u0434\u0435\u0441\u044C \u043B\u044E\u0434\u0435\u0439 \u043D\u0430 \u0440\u0430\u0437-\u0434\u0432\u0430, \u0430 \u0443\u043C\u0435\u0441\u0442\u0438\u043B\u0441\u044F \u0431\u044B \u0446\u0435\u043B\u044B\u0439 \u043C\u0435\u0433\u0430\u043F\u043E\u043B\u0438\u0441 \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u043F\u043E\u0434\u0437\u0435\u043C\u043A\u0430\u043C\u0438. \u0417\u0434\u0435\u0441\u044C \u043A\u0430\u0436\u0435\u0442\u0441\u044F \u0432\u0440\u0435\u043C\u044F \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432 \u0441\u043F\u044F\u0447\u043A\u0435.  \u0418 \u043D\u0438\u0447\u0435\u0433\u043E \u043D\u0435 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442. \u0418\u043C\u0435\u043D\u043D\u043E \u043F\u043E \u044D\u0442\u043E\u043C\u0443 \u0421\u043D\u043E\u0443 \u043D\u0430\u043F\u0440\u0430\u0448\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0437\u0430 \u0441\u0442\u0435\u043D\u0443.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n\u042D\u0434 \u0421\u0442\u0430\u0440\u043A \u043D\u0430 \u0440\u0430\u0441\u043F\u0443\u0442\u044C\u0435, \u0438 \u043F\u0435\u0440\u0435\u0434 \u043D\u0438\u043C \u0441\u0442\u043E\u0438\u0442 \u043D\u0435\u043B\u0435\u0433\u043A\u0438\u0439 \u0432\u044B\u0431\u043E\u0440. \u0412\u0435\u0434\u044C \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u0439 \u0432\u044B\u0431\u043E\u0440 \u0441\u0443\u043B\u0438\u0442 \u0435\u043C\u0443 \u043D\u0435\u043F\u0440\u0438\u044F\u0442\u043D\u043E\u0441\u0442\u0438.  \u0421\u0438\u0434\u044F \u043D\u0430 \u0431\u0430\u043B\u0443 \u0432 \u0447\u0435\u0441\u0442\u044C \u043F\u0440\u0438\u0435\u0437\u0434\u0430 \u043A\u043E\u0440\u043E\u043B\u044F, \u043E\u043D \u0441\u043B\u0443\u0448\u0430\u0435\u0442 \u043C\u0443\u0437\u044B\u043A\u0430\u043D\u0442\u043E\u0432 \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u0436\u0435\u043D\u043E\u0439. \u0412\u043E\u0441\u0445\u0438\u0449\u0435\u043D\u043D\u0430\u044F, \u0438\u0445 \u0438\u0433\u0440\u043E\u0439, \u041A\u0435\u0439\u0442\u0438\u043B\u0438\u043D \u0433\u043E\u0432\u043E\u0440\u0438\u0442: \u00AB \u0414\u0435\u043B\u043E \u0433\u0430\u0440\u043C\u043E\u043D\u0438\u0438 \u0434\u043E\u0440\u0438\u0441\u043E\u0432\u044B\u0432\u0430\u0442\u044C \u0442\u0435 \u0447\u0435\u0440\u0442\u044B, \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043D\u0435\u0442 \u0438 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0432 \u043C\u0435\u043B\u043E\u0434\u0438\u0438\u00BB.  \u041F\u043E\u0441\u043B\u0435 \u044D\u0442\u043E\u0433\u043E \u042D\u0434 \u0441\u0434\u0435\u043B\u0430\u043B \u0441\u0432\u043E\u0439 \u0432\u044B\u0431\u043E\u0440.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u0425\u043E\u043B\u043E\u0434\u043D\u043E\u0439 \u043D\u043E\u0447\u044C\u044E \u041A\u0435\u0439\u0442\u0438\u043B\u0438\u043D \u043F\u043E\u043B\u0443\u0447\u0430\u0435\u0442 \u0442\u0440\u0435\u0432\u043E\u0436\u043D\u043E\u0435 \u043F\u0438\u0441\u044C\u043C\u043E \u043E\u0442 \u0441\u0432\u043E\u0435\u0439 \u0441\u0435\u0441\u0442\u0440\u044B, \u0432\u0434\u043E\u0432\u044B \u043B\u043E\u0440\u0434\u0430 \u0410\u0440\u0440\u0435\u043D\u0430. \u041E\u043D\u0430 \u043F\u043E\u0434\u043E\u0437\u0440\u0435\u0432\u0430\u0435\u0442, \u0447\u0442\u043E \u0435\u0451 \u043C\u0443\u0436\u0430 \u0414\u0436\u043E\u043D\u0430 \u0443\u0431\u0438\u043B\u0438 \u043C\u043E\u0433\u0443\u0449\u0435\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0435 \u041B\u0430\u043D\u043D\u0438\u0441\u0442\u0435\u0440\u044B.  \u0415\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043D\u043D\u043E \u043E\u043D\u043E \u0437\u0430\u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u043E, \u0447\u0442\u043E\u0431\u044B \u043D\u0438\u043A\u0442\u043E \u043D\u0435 \u0441\u043C\u043E\u0433 \u043F\u0440\u043E\u0447\u0438\u0442\u0430\u0442\u044C \u0435\u0433\u043E: 6-5,20-13,4-1,23-3,1-1,18-3,6-2,8-3,2-1,19-3,11-1,24-4,30-1,30-2,30-3,1-6,18-5,8-1,20-6,8-2,30-1,11-3,23-2,18-3,6-5,\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\u0422\u0435\u043F\u0435\u0440\u044C \u041D\u0435\u0434\u0430 \u0431\u0443\u0434\u0443\u0442 \u0441\u0443\u0434\u0438\u0442\u044C \u043F\u0435\u0440\u0435\u0434 \u0431\u043E\u0433\u0430\u043C\u0438. \u041D\u0430 \u0441\u0443\u0434 \u0435\u0433\u043E \u0432\u0435\u0434\u0443\u0442 \u043F\u043E \u043C\u043E\u0441\u0442\u0443 \u041A\u043B\u0430\u0434\u043A\u0438, \u043A\u043E\u0433\u0434\u0430 \u0442\u043E \u0431\u044B\u0432\u0448\u0435\u043C  \u0432\u0435\u043D\u0446\u043E\u043C \u0442\u0432\u043E\u0440\u0435\u043D\u0438\u044F \u0438\u043D\u0436\u0435\u043D\u0435\u0440\u043E\u0432.  \u0421\u0430\u043D\u0441\u0430 \u0438 \u0421\u0435\u0440\u0441\u0435\u044F \u043F\u0440\u0438\u0437\u044B\u0432\u0430\u044E\u0442 \u043F\u043E\u0449\u0430\u0434\u0438\u0442\u044C \u0435\u0433\u043E, \u043E\u0434\u043D\u0430\u043A\u043E \u0414\u0436\u043E\u0444\u0444\u0440\u0438 \u043D\u0435 \u0441\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u043E\u0431\u0435\u0449\u0430\u043D\u0438\u044F. \u0418 \u041D\u0435\u0434\u0443 \u043E\u0442\u0440\u0443\u0431\u0430\u044E\u0442 \u0433\u043E\u043B\u043E\u0432\u0443.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0413\u043E\u0440\u044C\u043A\u043E\u0433\u043E \u043E\u0441\u0430\u0434\u043A\u0430 \u043D\u0435 \u0438\u0437\u0431\u0435\u0436\u0430\u0442\u044C, \u0432\u0435\u0434\u044C \u0410\u0440\u044C\u044F \u0432\u0438\u0434\u0435\u043B\u0430 \u0441\u043C\u0435\u0440\u0442\u044C \u043E\u0442\u0446\u0430. \u041E\u043D\u0430 \u0441\u043F\u0435\u0448\u043D\u043E \u043F\u043E\u043A\u0438\u0434\u0430\u0435\u0442 \u043A\u043E\u0440\u043E\u043B\u0435\u0432\u0441\u043A\u0443\u044E \u0433\u0430\u0432\u0430\u043D\u044C \u043F\u043E \u0441\u0430\u043C\u043E\u043C\u0443 \u0441\u0442\u0430\u0440\u043E\u043C\u0443 \u043C\u043E\u0441\u0442\u0443 \u0432 \u0433\u043E\u0440\u043E\u0434\u0435.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0414\u0438\u043D\u0430\u043C\u043E\u0432\u0441\u043A\u0438\u0439 \u043C\u043E\u0441\u0442.
TASK_CODE_7=A9N8G1
BONUS_FIVE_MINUTES=HLAQGW1
BONUS_TEN_MINUTES=KWVGS5Y
BONUS_FIFTEEN_MINUTES=SXVGS7U