#Sun Sep 17 21:30:01 MSK 2017
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(c \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u041D\u0430 \u0442\u0435\u043C\u043D\u044B\u0445 \u0443\u043B\u0438\u0446\u0430\u0445 \u0433\u043E\u0440\u043E\u0434\u0430 \u0442\u0432\u043E\u0440\u0438\u0442\u0441\u044F, \u0447\u0442\u043E \u0442\u043E \u0441\u0442\u0440\u0430\u043D\u043D\u043E\u0435. \u0410 \u043F\u043E\u043A\u0430, \u0443\u0441\u0442\u0440\u0430\u043D\u044F\u044F \u043D\u0430 \u0445\u043E\u0434\u0443 \u0431\u0430\u043D\u0434\u0438\u0442\u043E\u0432, \u0441\u044B\u0449\u0438\u043A \u0438 \u0435\u0433\u043E \u0434\u0440\u0443\u0433 \u0438\u0434\u0443\u0442 \u043F\u043E \u0441\u043B\u0435\u0434\u0443. \u0420\u043E\u043A\u043E\u0442 \u0432\u044B\u0441\u0442\u0440\u0435\u043B\u043E\u0432 \u0440\u0430\u0437\u0434\u0430\u0435\u0442\u0441\u044F \u043F\u043E \u043F\u0440\u043E\u0443\u043B\u043A\u0430\u043C. \u0422\u0435\u043F\u0435\u0440\u044C \u0432\u0441\u0435 \u0440\u0435\u0448\u0430\u0435\u0442 \u0432\u0440\u0435\u043C\u044F, \u0435\u0449\u0435 \u0441\u0435\u043A\u0443\u043D\u0434\u0430 \u0438 \u0434\u0435\u0432\u0443\u0448\u043A\u0430 \u0431\u0443\u0434\u0435\u0442 \u043C\u0435\u0440\u0442\u0432\u0430. \u041E\u0434\u043D\u0430\u043A\u043E \u0432\u0435\u043B\u0438\u043A\u0438\u0439 \u0441\u044B\u0449\u0438\u043A \u0438 \u0435\u0433\u043E \u0432\u0435\u0440\u043D\u044B\u0439 \u0442\u043E\u0432\u0430\u0440\u0438\u0449 \u043F\u043E\u0434\u043E\u0441\u043F\u0435\u043B\u0438 \u0432\u043E\u0432\u0440\u0435\u043C\u044F. \u041D\u0435 \u0432\u0435\u0440\u044F \u0441\u0432\u043E\u0438\u043C \u0433\u043B\u0430\u0437\u0430\u043C,  \u0412\u0430\u0442\u0441\u043E\u043D \u043F\u0440\u0438\u0441\u043C\u043E\u0442\u0440\u0435\u043B\u0441\u044F \u0438 \u043F\u0435\u0440\u0432\u044B\u0435 \u0435\u0433\u043E \u043D\u0430\u0431\u043B\u044E\u0434\u0435\u043D\u0438\u044F \u043E\u043A\u0430\u0437\u0430\u043B\u0438\u0441\u044C \u0432\u0435\u0440\u043D\u044B: \u041B\u043E\u0440\u0434 \u0411\u043B\u0435\u043A\u0432\u0443\u0434?! \u041B\u0435\u0441\u0442\u0440\u0435\u0439\u0434 \u0443\u0432\u0438\u0434\u0438\u0442\u0435 \u043C\u0435\u0440\u0437\u0430\u0432\u0446\u0430, \u0441 \u0433\u043B\u0430\u0437 \u0434\u043E\u043B\u043E\u0439, \u0430 \u043C\u044B \u0441 \u0428\u0435\u0440\u043B\u043E\u043A\u043E\u043C, \u043F\u0440\u043E\u0439\u0434\u0435\u043C\u0441\u044F \u0432\u043E\u0437\u0434\u0443\u0445 \u043D\u044B\u043D\u0447\u0435 \u0442\u0430\u043A\u043E\u0439 \u0441\u0432\u0435\u0436\u0438\u0439 \u0438 \u0447\u0438\u0441\u0442\u044B\u0439, \u043F\u0440\u043E\u0441\u0442\u043E \u043E\u0442\u043C\u0435\u043D\u043D\u044B\u0439. \u0412\u044B \u0441\u043B\u044B\u0448\u0430\u043B\u0438 \u0425\u043E\u043B\u043C\u0441 \u043E \u043D\u043E\u0432\u043E\u0439 \u0438\u0433\u0440\u0435, \u0447\u0442\u043E \u043F\u0440\u0438\u0434\u0443\u043C\u0430\u043B\u0438 \u0432 \u041D\u043E\u0432\u043E\u043C \u0421\u0432\u0435\u0442\u0435, \u043E\u043D\u0438 \u043A\u0438\u0434\u0430\u044E\u0442 \u0447\u0435\u043C-\u0442\u043E \u0432 \u043A\u043E\u0440\u0437\u0438\u043D\u044B! \u041E\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0432\u0448\u0438\u0441\u044C \u0425\u043E\u043B\u043C\u0441 \u0438\u0437\u0440\u0435\u043A: \u0412\u043E\u043E\u0431\u0449\u0435-\u0442\u043E, \u043D\u0435\u0437\u043D\u0430\u0447\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0434\u0435\u0442\u0430\u043B\u0438, \u043E\u0431\u044B\u0447\u043D\u043E, \u0432\u0430\u0436\u043D\u0435\u0435 \u0432\u0441\u0435\u0433\u043E, \u043C\u043E\u0439 \u0434\u043E\u0440\u043E\u0433\u043E\u0439 \u0412\u0430\u0442\u0441\u043E\u043D! \u0414\u0430\u0439\u0442\u0435 \u043C\u043D\u0435 \u0434\u0435\u0442\u0430\u043B\u0438!
GAME_LEGEND="\u0428\u0435\u0440\u043B\u043E\u043A \u0425\u043E\u043B\u043C\u0441" \u0413\u0430\u044F \u0420\u0438\u0447\u0438\n\n\u0414\u0435\u0439\u0441\u0442\u0432\u0438\u0435 \u0444\u0438\u043B\u044C\u043C\u0430 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442 \u0432 1890 \u0433\u043E\u0434\u0443. \u0412\u0435\u043B\u0438\u0447\u0430\u0439\u0448\u0438\u0439 \u0434\u0435\u0442\u0435\u043A\u0442\u0438\u0432 \u0428\u0435\u0440\u043B\u043E\u043A \u0425\u043E\u043B\u043C\u0441 \u0438 \u0435\u0433\u043E \u043F\u043E\u043C\u043E\u0449\u043D\u0438\u043A \u0434\u043E\u043A\u0442\u043E\u0440 \u0412\u0430\u0442\u0441\u043E\u043D \u043F\u0440\u0435\u0434\u043E\u0442\u0432\u0440\u0430\u0449\u0430\u044E\u0442 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0435 \u0438\u0437 \u0448\u0435\u0441\u0442\u0438 \u0440\u0438\u0442\u0443\u0430\u043B\u044C\u043D\u044B\u0445 \u0436\u0435\u0440\u0442\u0432\u043E\u043F\u0440\u0438\u043D\u043E\u0448\u0435\u043D\u0438\u0439. \u0412\u0438\u043D\u043E\u0432\u043D\u0438\u043A\u0430 \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043B\u0435\u043D\u0438\u0439, \u0442\u0430\u0438\u043D\u0441\u0442\u0432\u0435\u043D\u043D\u043E\u0433\u043E \u043B\u043E\u0440\u0434\u0430 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430, \u043F\u0440\u0438\u0433\u043E\u0432\u0430\u0440\u0438\u0432\u0430\u044E\u0442 \u043A \u0441\u043C\u0435\u0440\u0442\u043D\u043E\u0439 \u043A\u0430\u0437\u043D\u0438. \u0421\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0442\u0440\u0438 \u043C\u0435\u0441\u044F\u0446\u0430 \u0425\u043E\u043B\u043C\u0441 \u0441\u043A\u0443\u0447\u0430\u0435\u0442 \u2014 \u043E\u043D \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u043D\u0430\u0439\u0442\u0438 \u0434\u043B\u044F \u0441\u0435\u0431\u044F \u0441\u0442\u043E\u044F\u0449\u0435\u0435 \u0434\u0435\u043B\u043E, \u043A \u0442\u043E\u043C\u0443 \u0436\u0435 \u043F\u043E\u043C\u043E\u043B\u0432\u043A\u0430 \u0438 \u043F\u0435\u0440\u0435\u0435\u0437\u0434 \u0434\u0440\u0443\u0433\u0430 \u0442\u043E\u043B\u044C\u043A\u043E \u043F\u043E\u0434\u043B\u0438\u0432\u0430\u044E\u0442 \u043C\u0430\u0441\u043B\u0430 \u0432 \u043E\u0433\u043E\u043D\u044C. \u0412\u0441\u0451 \u0436\u0435 \u0414\u0436\u043E\u043D\u0443 \u0443\u0434\u0430\u0451\u0442\u0441\u044F \u0443\u0433\u043E\u0432\u043E\u0440\u0438\u0442\u044C \u0428\u0435\u0440\u043B\u043E\u043A\u0430 \u043F\u043E\u0439\u0442\u0438 \u043D\u0430 \u0443\u0436\u0438\u043D \u0438 \u043F\u043E\u0437\u043D\u0430\u043A\u043E\u043C\u0438\u0442\u044C\u0441\u044F \u0441 \u0435\u0433\u043E \u043D\u0435\u0432\u0435\u0441\u0442\u043E\u0439 \u041C\u044D\u0440\u0438 \u041C\u043E\u0440\u0441\u0442\u0435\u043D, \u043D\u043E \u0432\u0435\u0447\u0435\u0440 \u0437\u0430\u043A\u0430\u043D\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0441\u043A\u0430\u043D\u0434\u0430\u043B\u043E\u043C.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B. \u0413\u0440\u043E\u0437\u043D\u0435\u043D\u0441\u043A\u0430\u044F, \u0448\u043B\u0430\u0433\u0431\u0430\u0443\u043C. \u0412\u0441\u0435 \u0432\u0440\u0435\u043C\u044F \u0436\u0435 \u043F\u0438\u0441\u0430\u043B \u0413\u0420\u041E\u0417\u041D\u042B\u0415.
TASK_CODE_6=FLN777
START_CODE=sh
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0411\u0440\u043E\u0441\u0438\u0432 \u0441\u043D\u0430\u0447\u0430\u043B\u0430 \u0433\u0440\u043E\u0437\u043D\u044B\u0439 \u0432\u0437\u0433\u043B\u044F\u0434, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043F\u043E\u0442\u043E\u043C \u0441\u043C\u0435\u043D\u0438\u043B\u0441\u044F \u0441\u043E\u0436\u0430\u043B\u0435\u043D\u0438\u0435\u043C, \u0414\u0436\u043E\u043D \u0432 \u0441\u043F\u0435\u0448\u043A\u0435, \u0443\u0434\u0430\u043B\u0438\u043B\u0441\u044F \u0432\u0441\u043B\u0435\u0434 \u0441\u0432\u043E\u0435\u0439 \u0434\u0430\u043C\u044B. \u0428\u0435\u0440\u043B\u043E\u043A \u0433\u0440\u0443\u0441\u0442\u043D\u043E \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u043B \u0432\u0441\u043B\u0435\u0434 \u0434\u0440\u0443\u0433\u0443, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0441\u0432\u0435\u0440\u043D\u0443\u043B \u0437\u0430 \u0443\u0433\u043E\u043B \u0438 \u043F\u0440\u043E\u0438\u0437\u043D\u0435\u0441: \u041B\u0435\u0433\u0447\u0435 \u0441\u043E\u043A\u0440\u0443\u0448\u0438\u0442\u044C \u043F\u0440\u043E\u0442\u0438\u0432\u043D\u0438\u043A\u0430, \u0447\u0435\u043C \u0441\u043B\u043E\u043C\u0430\u0442\u044C \u0441\u043E\u043F\u0440\u043E\u0442\u0438\u0432\u043B\u0435\u043D\u0438\u0435 \u0441\u0432\u043E\u0438\u0445 \u043E\u0444\u0438\u0446\u0435\u0440\u043E\u0432. \u0413\u0440\u043E\u0437\u043D\u0430\u044F \u0434\u0430\u043C\u043E\u0447\u043A\u0430\u2026
TASK_CODE_4=F34L1N
TASK_CODE_3=F7L5N8
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423 \u041B\u0418\u0426\u0410 \u041A\u043E\u043C\u0441\u043E\u043C\u043E\u043B\u044C\u0441\u043A\u0430\u044F, \u0432\u044A\u0435\u0437\u0434 \u0432 \u0441\u0430\u0434\u043E\u0432\u043E\u0434\u0447\u0435\u0441\u043A\u043E\u0435 \u0445\u043E\u0437\u044F\u0439\u0441\u0442\u0432\u043E, \u041A\u043E\u043C\u0438\u0442\u0435\u0442 \u0441\u043E\u0442\u0432\u043E\u0440\u0435\u043D\u043D\u043E\u0439 \u043C\u043E\u043B\u0438\u0442\u0432\u044B)))))
TASK_CODE_2=F4L3N4
TASK_CODE_1=F5L9N1
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0423 \u043B\u0438\u0446\u0430 \u0428\u0435\u0440\u043B\u043E\u043A\u0430 \u0432 \u043A\u043E\u043D\u0446\u0435 \u043A\u043E\u043D\u0446\u043E\u0432 \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F  \u0440\u0443\u043A\u043E\u0432\u043E\u0434\u0441\u0442\u0432\u043E \u043E\u0440\u0434\u0435\u043D\u0430 \u041A\u043E\u043C\u0421\u043E\u041C\u043E\u043B\u0430 \u2014 \u0432\u0435\u0440\u0445\u043E\u0432\u043D\u044B\u0439 \u0441\u0443\u0434\u044C\u044F \u0441\u044D\u0440 \u0422\u043E\u043C\u0430\u0441 \u0420\u043E\u0442\u0435\u0440\u0430\u043C, \u043C\u0438\u043D\u0438\u0441\u0442\u0440 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0438\u0445 \u0434\u0435\u043B \u0413\u043E\u0432\u0430\u0440\u0434 \u0438 \u043F\u043E\u0441\u043E\u043B \u0412\u0435\u043B\u0438\u043A\u043E\u0431\u0440\u0438\u0442\u0430\u043D\u0438\u0438 \u0432 \u0421\u0428\u0410 \u0414\u0436\u043E\u043D \u0421\u0442\u044D\u043D\u0434\u0438\u0448 \u2014 \u043F\u0440\u043E\u0441\u044F\u0442 \u0428\u0435\u0440\u043B\u043E\u043A\u0430 \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430. \u041F\u043E \u0438\u0445 \u0441\u043B\u043E\u0432\u0430\u043C, \u0431\u044B\u0432\u0448\u0438\u0439 \u0447\u043B\u0435\u043D \u043E\u0440\u0434\u0435\u043D\u0430 \u0432 \u043A\u043E\u043D\u0435\u0446 \u043E\u0431\u0435\u0437\u0443\u043C\u0435\u043B \u0438 \u0441\u043E\u0431\u0438\u0440\u0430\u0435\u0442\u0441\u044F \u043F\u0440\u0438\u0437\u0432\u0430\u0442\u044C \u0442\u0430\u0438\u043D\u0441\u0442\u0432\u0435\u043D\u043D\u0443\u044E \u0441\u0438\u043B\u0443, \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u043E\u043D \u0438\u0437\u043C\u0435\u043D\u0438\u0442 \u043C\u0438\u0440. \u0412 \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440\u0435 \u0425\u043E\u043B\u043C\u0441 \u0434\u043E\u0433\u0430\u0434\u044B\u0432\u0430\u0435\u0442\u0441\u044F, \u0447\u0442\u043E \u0441\u044D\u0440 \u0422\u043E\u043C\u0430\u0441, \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0442\u0446\u043E\u043C \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430, \u0438 \u043F\u0440\u0435\u0434\u0443\u043F\u0440\u0435\u0436\u0434\u0430\u0435\u0442 \u0435\u0433\u043E, \u0447\u0442\u043E, \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u043E\u043D \u2014 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0430\u044F \u0436\u0435\u0440\u0442\u0432\u0430, \u0442\u0430\u043A \u043A\u0430\u043A \u0432\u0441\u044F \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u0430\u044F \u0441\u0435\u043C\u044C\u044F \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430 \u0443\u0436\u0435 \u043C\u0435\u0440\u0442\u0432\u0430.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0424\u0435\u0442\u0445\u0443\u0437, \u043F\u043E\u0436\u0430\u0440\u0441\u043A\u043E\u0433\u043E 44\u0430, \u0443\u0447\u0438\u043C\u0441\u044F \u041A\u0443\u0431-\u0440\u0430\u0439(\u0448\u0430\u0440-\u0430\u0434\u0430))) \u0440\u0430\u0437\u0433\u0430\u0434\u044B\u0432\u0430\u0442\u044C \u0442\u043E\u0432\u0430\u0440\u0438\u0449\u0438.
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0417\u0430\u0432\u044F\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0431\u043E\u0440\u044C\u0431\u0430, \u043D\u0430 \u0432\u044B\u0441\u043E\u0442\u0435, \u043D\u0430 \u0444\u043E\u043D\u0435 \u043F\u043E\u0436\u0430\u0440\u0430. \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u0441\u0442\u0430\u043B\u043A\u0438\u0432\u0430\u0435\u0442 \u0418\u0440\u0435\u043D, \u043D\u0430 \u043E\u043D\u0430 \u0432\u044B\u0436\u0438\u0432\u0430\u0435\u0442, \u0443\u043F\u0430\u0432 \u043D\u0430 \u043F\u0435\u0440\u0435\u043A\u043B\u0430\u0434\u0438\u043D\u0443. \u0418 \u0432\u043E\u0442 \u043A\u0443\u043B\u044C\u043C\u0438\u043D\u0430\u0446\u0438\u044F \u043E\u0441\u0442\u0430\u043B\u0438\u0441\u044C \u043B\u0438\u0448\u044C \u043E\u043D \u0438 \u0428\u0435\u0440\u043B\u043E\u043A. \u0428\u0435\u0440\u043B\u043E\u043A \u0441\u043E\u0431\u0438\u0440\u0430\u044F\u0441\u044C \u0441 \u043C\u044B\u0441\u043B\u044F\u043C\u0438 \u0441\u043C\u043E\u0442\u0440\u0438\u0442 \u0432\u043D\u0438\u0437, \u0433\u0434\u0435 \u043A\u0430\u043A \u043D\u0430 \u043B\u0430\u0434\u043E\u043D\u0438 \u0441\u0442\u043E\u0438\u0442 \u00AB\u0422\u043E\u043B\u0441\u0442\u0430\u044F \u0432\u043F\u0430\u0434\u0438\u043D\u0430\u00BB, \u043E\u0441\u0442\u0430\u043B\u0430\u0441\u044C \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u044F\u044F \u0448\u0430\u0440\u0430\u0434\u0430 \u043D\u0430\u043E\u0431\u043E\u0440\u043E\u0442. \u0418\u043D\u0442\u0435\u0440\u0435\u0441\u043D\u043E, \u043F\u043E\u0447\u0435\u043C\u0443 \u0445\u043E\u0437\u044F\u0438\u043D \u0442\u0440\u0430\u043A\u0442\u0438\u0440\u0430 \u0440\u0435\u0448\u0438\u043B \u043D\u0430\u043F\u0438\u0441\u0430\u0442\u044C \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043D\u0430 \u043C\u0435\u0441\u0442\u043D\u043E\u043C \u0434\u0438\u0430\u043B\u0435\u043A\u0442\u0435. \u0418 \u0432\u0435\u0441\u044C \u044D\u0442\u043E\u0442 \u0443\u0436\u0430\u0441 \u0437\u0430\u043A\u043E\u043D\u0447\u0438\u0442\u0441\u044F.
START_TIME=22-00
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0430\u0440\u043A \u041D\u0430\u0440\u0442\u043E\u043D, \u0438\u0449\u0438\u0442\u0435 \u0430\u0433\u0435\u043D\u0442\u0430 \u043D\u0430 \u0430\u043B\u043B\u0435\u0435, \u0432 \u0440\u0430\u0439\u043E\u043D\u0435 \u0431\u0430\u0441\u043A\u0435\u0442\u0431\u043E\u043B\u044C\u043D\u043E\u0439 \u043F\u043B\u0430\u0449\u0430\u0434\u043A\u0435, \u043D\u0435 \u0437\u0430\u0431\u0443\u0434\u044C\u0442\u0435 \u0432\u043E\u043F\u0440\u043E\u0441!
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u043E\u0447\u044C. \u0410\u043D\u0442\u0440\u0430\u0446\u0438\u0442\u043E\u0432\u043E\u0433\u043E \u0446\u0432\u0435\u0442\u0430 \u0434\u043E\u0440\u043E\u0436\u043A\u0430 \u0443\u0432\u043E\u0434\u0438\u043B\u0430 \u0434\u0440\u0443\u0437\u0435\u0439 \u0432\u0441\u0435 \u0434\u0430\u043B\u044C\u0448\u0435. \u0420\u0430\u0437\u0440\u0435\u0437\u0430\u044F \u0432\u043E\u0437\u0434\u0443\u0445,\u043B\u043E\u0432\u043A\u043E \u043C\u0430\u043D\u0435\u0432\u0440\u0438\u0440\u0443\u044F, \u0441\u0440\u0435\u0434\u0438 \u043B\u0430\u0432\u043E\u0447\u0435\u043A \u0438 \u0441\u0442\u0430\u0442\u0443\u0439, \u0434\u0440\u0443\u0437\u044C\u044F \u0432\u044B\u0448\u043B\u0438 \u043A \u043F\u043B\u043E\u0449\u0430\u0434\u043A\u0435 \u0438 \u0443\u0442\u043E\u043C\u0438\u0432\u0448\u0438\u0441\u044C, \u0434\u043E\u043A\u0442\u043E\u0440 \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0438\u043B \u043F\u0440\u0438\u0441\u0435\u0441\u0442\u044C. \u0422\u043E\u043B\u044C\u043A\u043E \u0432\u0435\u043B\u0438\u043A\u0438\u0439 \u0441\u044B\u0449\u0438\u043A \u0438\u043C\u0435\u043B \u0434\u0440\u0443\u0433\u0438\u0435 \u043F\u043B\u0430\u043D\u044B. \u041E\u043D \u0440\u0435\u0448\u0438\u043B \u0445\u043E\u0440\u043E\u0448\u0435\u043D\u044C\u043A\u043E \u0440\u0430\u0441\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u044D\u0442\u043E\u0442 \u0440\u0430\u0439\u043E\u043D, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0442\u0430\u043A \u0441\u043B\u0430\u0432\u0438\u043B\u0441\u044F \u043C\u0435\u0441\u0442\u043D\u044B\u043C \u043A\u043E\u043B\u043E\u0440\u0438\u0442\u043E\u043C \u0438 \u044D\u0442\u043D\u043E\u0441\u043E\u043C. \u041D\u0435 \u0436\u0435\u043B\u0430\u044F \u0443\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u0432\u0440\u0435\u043C\u044F, \u0428\u0435\u0440\u043B\u043E\u043A \u0432\u0437\u0433\u043B\u044F\u043D\u0443\u043B \u043D\u0430 \u0442\u0430\u0431\u043B\u0438\u0447\u043A\u0443 - \u0410\u043B\u043B\u0435\u044F \u041D\u0435\u0439\u0441\u043C\u0438\u0442\u0430. \u0412\u0430\u0442\u0441\u043E\u043D \u0440\u0430\u0437\u043C\u044B\u0448\u043B\u044F\u043B, \u043F\u043E\u0447\u0435\u043C\u0443 \u0436\u0435 \u0428\u0435\u0440\u043B\u043E\u043A \u043E\u0442\u0432\u0435\u0447\u0430\u0435\u0442 \u0432\u0441\u0435\u0433\u0434\u0430 \u0432 \u0442\u0430\u043A\u043E\u0439 \u043D\u0430\u0434\u043C\u0435\u043D\u043D\u043E\u0439 \u043C\u0430\u043D\u0435\u0440\u0435, \u0447\u0442\u043E \u043D\u0435 \u0441\u0447\u0438\u0442\u0430\u044F \u0441\u0435\u0431\u044F \u0433\u043B\u0443\u043F\u0435\u0435 \u043E\u043A\u0440\u0443\u0436\u0430\u044E\u0449\u0438\u0445, \u0432 \u043E\u0431\u0449\u0435\u0441\u0442\u0432\u0435 \u0441 \u0425\u043E\u043B\u043C\u0441\u043E\u043C, \u043F\u043E\u0441\u0442\u043E\u044F\u043D\u043D\u043E \u043F\u0440\u0435\u0441\u043B\u0435\u0434\u0443\u0435\u0442 \u043E\u0449\u0443\u0449\u0435\u043D\u0438\u0435 \u0441\u043E\u0431\u0441\u0442\u0432\u0435\u043D\u043D\u043E\u0439 \u0442\u0443\u043F\u043E\u0441\u0442\u0438. \u0414\u0440\u0443\u0437\u044C\u044F \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0438\u043B\u0438 \u0441\u0432\u043E\u044E \u043F\u0440\u043E\u0433\u0443\u043B\u043A\u0443, \u043F\u0440\u0435\u0434\u0443\u0441\u043C\u0430\u0442\u0440\u0438\u0432\u0430\u044E\u0449\u0443\u044E \u0434\u043E\u0437\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0435 \u0444\u0438\u0437\u0438\u0447\u0435\u0441\u043A\u0438\u0435 \u043D\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u043F\u043E \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0451\u043D\u043D\u044B\u043C, \u0440\u0430\u0437\u043C\u0435\u0447\u0435\u043D\u043D\u044B\u043C \u043C\u0430\u0440\u0448\u0440\u0443\u0442\u0430\u043C.
TASK_CODE_5=F6L56N
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u0433\u043E\u043B \u0425\u0430\u0434\u0430\u0440\u0446\u0435\u0432\u0430 \u0438 \u0426\u043E\u043A\u043E\u043B\u0430\u0435\u0432\u0430, \u0433\u0440\u0443\u043D\u0442\u043E\u0432\u0430\u044F \u0434\u043E\u0440\u043E\u0433\u0430! \u041D\u0435 \u0443\u043C\u0435\u0435\u0442\u0435 \u0440\u0435\u0448\u0430\u0442\u044C \u043B\u0438\u0442\u043E\u0440\u0435\u0438 \u0447\u0442\u043E \u043B\u0438?!
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0420\u0430\u0437\u0433\u0430\u0434\u0430\u0442\u044C \u0442\u0430\u043A\u043E\u0435 \u0428\u0435\u0440\u043B\u043E\u043A\u0443 \u0440\u0430\u0437 \u043F\u043B\u044E\u043D\u0443\u0442\u044C, \u0445\u043E\u0442\u044C \u043D\u0430 \u0442\u0430\u0440\u0430\u0431\u0430\u0440\u0441\u043A\u043E\u043C \u044F\u0437\u044B\u043A\u0435,  \u044D\u0442\u043E \u0432\u0441\u0435 \u0440\u0430\u0432\u043D\u043E \u0447\u0442\u043E \u0437\u043D\u0430\u0442\u044C \u043A\u0430\u043A\u043E\u0439 \u043D\u043E\u043C\u0435\u0440 \u0441\u0447\u0430\u0441\u0442\u043B\u0438\u0432\u043E\u0439 \u043B\u0438\u0442\u043E\u0440\u0435\u0438 \u0432\u044B\u0442\u0430\u0449\u0438\u0442\u044C. \u0428\u0435\u0440\u043B\u043E\u043A \u0437\u0430\u0434\u0443\u043C\u0430\u043B\u0441\u044F \u043E \u0411\u043B\u0435\u043A\u0432\u0443\u0434\u0435, \u0432\u0435\u0434\u044C \u043E\u043D \u043E\u0441\u0442\u0430\u0432\u0430\u043B\u0441\u044F \u0433\u043B\u0430\u0441\u043D\u044B\u043C \u0432 \u043F\u0430\u0440\u043B\u0430\u043C\u0435\u043D\u0442\u0435, \u0430 \u0441\u043E\u0433\u043B\u0430\u0441\u043D\u044B\u0435 \u0441 \u0442\u0430\u043A\u0438\u043C \u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u043C\u0435\u043D\u044F\u043B\u0438\u0441\u044C!
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u0434 \u041A\u0438\u0442\u0430\u0439\u0441\u043A\u0438\u043C \u043C\u043E\u0441\u0442\u043E\u043C, \u0441\u043E \u0441\u0442\u043E\u0440\u043E\u043D\u044B \u0417\u043E\u043B\u043E\u0442\u043E\u0439 \u043A\u043E\u0440\u043E\u043D\u044B(\u0448\u0438\u043D\u0443\u0430\u0437\u0440\u0438 \u044D\u0442\u043E \u041A\u0438\u0442\u0430\u0439\u0449\u0438\u043D\u0430)
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u043E \u043D\u043E\u0432\u044B\u043C \u0441\u043B\u0435\u0434\u0430\u043C \u0425\u043E\u043B\u043C\u0441 \u0438 \u0412\u0430\u0442\u0441\u043E\u043D \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u043D\u0430 \u0444\u0430\u0431\u0440\u0438\u043A\u0443, \u0433\u0434\u0435 \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u044E\u0442 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430. \u041D\u043E \u043E\u043D\u0438 \u0443\u043F\u0443\u0441\u043A\u0430\u044E\u0442 \u0435\u0433\u043E \u0438\u0437-\u0437\u0430 \u0418\u0440\u044D\u043D, \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0441\u043F\u0430\u0441\u0430\u0442\u044C \u043E\u0442 \u043B\u0435\u043D\u0442\u043E\u0447\u043D\u043E\u0439 \u043F\u0438\u043B\u044B \u0434\u043B\u044F \u0440\u0430\u0437\u0434\u0435\u043B\u043A\u0438 \u0441\u0432\u0438\u043D\u044B\u0445 \u0442\u0443\u0448. \u041A \u0442\u043E\u043C\u0443 \u0436\u0435 \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0432\u0437\u0440\u044B\u0432\u043D\u043E\u0435 \u0443\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u043E, \u0438\u0437-\u0437\u0430 \u0447\u0435\u0433\u043E \u0444\u0430\u0431\u0440\u0438\u043A\u0430 \u0432\u0437\u043B\u0435\u0442\u0430\u0435\u0442 \u0432 \u0432\u043E\u0437\u0434\u0443\u0445. \u041F\u0440\u0438\u0434\u044F \u0432 \u0441\u0435\u0431\u044F \u043F\u043E\u0441\u043B\u0435 \u0432\u0437\u0440\u044B\u0432\u0430, \u0425\u043E\u043B\u043C\u0441 \u043E\u0431\u043D\u0430\u0440\u0443\u0436\u0438\u0432\u0430\u0435\u0442, \u0447\u0442\u043E \u0413\u043E\u0432\u0430\u0440\u0434 \u0432\u044B\u043F\u0438\u0441\u0430\u043B \u043E\u0440\u0434\u0435\u0440 \u043D\u0430 \u0435\u0433\u043E \u0430\u0440\u0435\u0441\u0442. \u0423\u0434\u043E\u0441\u0442\u043E\u0432\u0435\u0440\u0438\u0432\u0448\u0438\u0441\u044C, \u0447\u0442\u043E \u0412\u0430\u0442\u0441\u043E\u043D \u0436\u0438\u0432, \u0425\u043E\u043B\u043C\u0441 \u0443\u0445\u043E\u0434\u0438\u0442 \u0432 \u043F\u043E\u0434\u043F\u043E\u043B\u044C\u0435, \u043D\u044B\u0440\u044F\u044F \u043F\u043E\u0434 \u043C\u043E\u0441\u0442. \u0418 \u0432 \u043E\u0434\u0435\u0436\u0434\u0435 \u0432 \u0441\u0442\u0438\u043B\u0435 \u0448\u0438\u043D\u0443\u0430\u0437\u0440\u0438, \u043D\u0430 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0435 \u0443\u0442\u0440\u043E \u043E\u043D \u0440\u0430\u0441\u0441\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442 \u0414\u0436\u043E\u043D\u0443 \u0438 \u0418\u0440\u044D\u043D \u043E \u0441\u0432\u043E\u0435\u0439 \u0432\u0435\u0440\u0441\u0438\u0438: \u043F\u044F\u0442\u044C \u0443\u0431\u0438\u0442\u044B\u0445 \u0434\u0435\u0432\u0443\u0448\u0435\u043A \u0441\u0438\u043C\u0432\u043E\u043B\u0438\u0437\u0438\u0440\u043E\u0432\u0430\u043B\u0438 \u043F\u044F\u0442\u044C \u043A\u043E\u043D\u0446\u043E\u0432 \u043F\u0435\u043D\u0442\u0430\u0433\u0440\u0430\u043C\u043C\u044B, \u0430 \u043C\u0435\u0441\u0442\u0430 \u0443\u0431\u0438\u0439\u0441\u0442\u0432 \u0442\u0440\u0451\u0445 \u043C\u0443\u0436\u0447\u0438\u043D \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0442 \u0441\u043E\u0431\u043E\u0439 \u0442\u0440\u0438 \u0438\u0437 \u0447\u0435\u0442\u044B\u0440\u0451\u0445 \u043A\u043E\u043D\u0446\u043E\u0432 \u043A\u0440\u0435\u0441\u0442\u0430, \u0430 \u0441\u0430\u043C\u0438 \u0443\u0431\u0438\u0442\u044B\u0435 \u043E\u0437\u043D\u0430\u0447\u0430\u044E\u0442 \u0447\u0430\u0441\u0442\u0438 \u0434\u0440\u0430\u043A\u043E\u043D\u0430. \u0425\u043E\u043B\u043C\u0441 \u0432\u044B\u0447\u0438\u0441\u043B\u044F\u0435\u0442, \u0447\u0442\u043E \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u044F\u044F \u0442\u043E\u0447\u043A\u0430 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430\u2014 \u044D\u0442\u043E \u0422\u0430\u0443\u0435\u0440\u0441\u043A\u0438\u0439 \u043C\u043E\u0441\u0442. \u0418\u043C\u0435\u043D\u043D\u043E \u0442\u0430\u043C \u043E\u043D \u043D\u0430\u043D\u0435\u0441\u0451\u0442 \u0441\u0432\u043E\u0439 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0438\u0439 \u0443\u0434\u0430\u0440, \u0438 \u043D\u0430\u043A\u043E\u043D\u0435\u0446 \u0441\u043C\u043E\u0436\u0435\u0442 \u043E\u0434\u0435\u0442\u044C \u043D\u0430 \u0433\u043E\u043B\u043E\u0432\u0443 \u0417\u043E\u043B\u043E\u0442\u0443\u044E \u043A\u043E\u0440\u043E\u043D\u0443.
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n\u0420\u0430\u0437\u0433\u043E\u0432\u043E\u0440 \u043F\u0440\u0435\u0440\u044B\u0432\u0430\u044E\u0442 \u0432\u043D\u0435\u0437\u0430\u043F\u043D\u043E \u0432\u043E\u0440\u0432\u0430\u0432\u0448\u0438\u0435\u0441\u044F \u043F\u043E\u043B\u0438\u0446\u0435\u0439\u0441\u043A\u0438\u0435. \u0412\u0430\u0442\u0441\u043E\u043D\u0443 \u0438 \u0418\u0440\u044D\u043D \u0443\u0434\u0430\u0451\u0442\u0441\u044F \u0441\u0431\u0435\u0436\u0430\u0442\u044C, \u0430 \u0425\u043E\u043B\u043C\u0441 \u0441\u043E\u0437\u043D\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u0441\u0434\u0430\u0451\u0442\u0441\u044F, \u0435\u0433\u043E \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u044E\u0442 \u043A \u0413\u043E\u0432\u0430\u0440\u0434\u0443, \u043A\u043E\u0442\u043E\u0440\u044B\u0439, \u043A\u0430\u043A \u043E\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F, \u0431\u044B\u043B \u0441\u043E\u043E\u0431\u0449\u043D\u0438\u043A\u043E\u043C \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430 \u0441 \u0441\u0430\u043C\u043E\u0433\u043E \u043D\u0430\u0447\u0430\u043B\u0430. \u041C\u0438\u043D\u0438\u0441\u0442\u0440 \u0440\u0430\u0441\u043A\u0440\u044B\u0432\u0430\u0435\u0442 \u0434\u0435\u0442\u0435\u043A\u0442\u0438\u0432\u0443 \u043F\u043B\u0430\u043D \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430 \u2014 \u0443\u0431\u0438\u0442\u044C \u0432\u0441\u0435\u0445 \u0447\u043B\u0435\u043D\u043E\u0432 \u043F\u0430\u0440\u043B\u0430\u043C\u0435\u043D\u0442\u0430, \u043A\u0440\u043E\u043C\u0435 \u043F\u0440\u0438\u0431\u043B\u0438\u0436\u0451\u043D\u043D\u044B\u0445, \u0434\u0430\u0431\u044B \u043F\u043E\u0442\u043E\u043C \u0443\u0437\u0443\u0440\u043F\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0432\u043B\u0430\u0441\u0442\u044C \u0432 \u0438\u043C\u043F\u0435\u0440\u0438\u0438. \u0412\u044B\u044F\u0441\u043D\u0438\u0432 \u0432\u0441\u0435, \u0425\u043E\u043B\u043C\u0441 \u0441\u0431\u0435\u0433\u0430\u0435\u0442. \u041F\u0440\u0438\u0441\u043E\u0435\u0434\u0438\u043D\u0438\u0432\u0448\u0438\u0441\u044C \u043A \u0414\u0436\u043E\u043D\u0443 \u0438 \u0418\u0440\u044D\u043D, \u043E\u043D\u0438 \u0441\u043F\u0443\u0441\u043A\u0430\u044E\u0442\u0441\u044F \u0432 \u043A\u0430\u043D\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044E \u043E\u043A\u043E\u043B\u043E \u0442\u0430\u0432\u0435\u0440\u043D\u044B \u00AB\u0422\u043E\u043B\u0441\u0442\u0430\u044F \u0432\u043F\u0430\u0434\u0438\u043D\u0430\u00BB. \u0413\u0434\u0435 \u043E\u0431\u043D\u0430\u0440\u0443\u0436\u0438\u0432\u0430\u044E\u0442 \u0445\u0438\u043C\u0438\u0447\u0435\u0441\u043A\u043E\u0435 \u0443\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u043E, \u043F\u043E \u0444\u043E\u0440\u043C\u0435 \u043F\u043E\u0445\u043E\u0436\u0435\u0435 \u043D\u0430 \u043A\u0443\u0431. \u0420\u0430\u0439 \u0438\u043B\u0438 \u0430\u0434 \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D, \u0441\u0442\u043E\u0438\u0442 \u043D\u0430\u0436\u0430\u0442\u044C \u043A\u043D\u043E\u043F\u043A\u0443 \u043D\u0430 \u043F\u0435\u0440\u0435\u0434\u0430\u0442\u0447\u0438\u043A\u0435, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043D\u0430\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0432 \u0440\u0443\u043A\u0430\u0445 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430, \u043A\u0430\u043A \u0432\u0435\u0441\u044C \u043F\u0430\u0440\u043B\u0430\u043C\u0435\u043D\u0442 \u0437\u0430\u043F\u043E\u043B\u043D\u0438\u0442\u0441\u044F \u0441\u0433\u043E\u0440\u0438\u0442. \u041F\u043E\u043A\u0430 \u0412\u0430\u0442\u0441\u043E\u043D \u0438 \u0425\u043E\u043B\u043C\u0441 \u0441\u0440\u0430\u0436\u0430\u044E\u0442\u0441\u044F \u0441 \u043E\u0445\u0440\u0430\u043D\u043D\u0438\u043A\u0430\u043C\u0438, \u0418\u0440\u044D\u043D \u0443\u0434\u0430\u0451\u0442\u0441\u044F \u0432\u044B\u0431\u0438\u0442\u044C \u0446\u0438\u043B\u0438\u043D\u0434\u0440\u044B \u0441 \u043E\u0442\u0440\u0430\u0432\u043B\u044F\u044E\u0449\u0438\u043C \u0432\u0435\u0449\u0435\u0441\u0442\u0432\u043E\u043C \u0438\u0437 \u0443\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u0430, \u043D\u043E \u043E\u043D\u0430 \u0442\u0443\u0442 \u0436\u0435 \u0441\u0431\u0435\u0433\u0430\u0435\u0442 \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u043D\u0438\u043C\u0438. \u0425\u043E\u043B\u043C\u0441 \u0434\u043E\u0433\u043E\u043D\u044F\u0435\u0442 \u0435\u0451 \u043D\u0430 \u0441\u0430\u043C\u043E\u043C \u0432\u0435\u0440\u0445\u0443 \u0441\u0442\u0440\u043E\u044F\u0449\u0435\u0433\u043E\u0441\u044F \u0422\u0430\u0443\u044D\u0440\u0441\u043A\u043E\u0433\u043E \u043C\u043E\u0441\u0442\u0430, \u0433\u0434\u0435 \u0432\u043D\u0435\u0437\u0430\u043F\u043D\u043E \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u2014 \u0435\u0433\u043E \u043F\u043B\u0430\u043D \u043F\u0440\u043E\u0432\u0430\u043B\u0438\u043B\u0441\u044F \u0438 \u0442\u0435\u043F\u0435\u0440\u044C \u043E\u043D \u0436\u0430\u0436\u0434\u0435\u0442 \u043C\u0435\u0441\u0442\u0438.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
START_DATE=24-03-2018
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u041F\u043E\u043D\u044F\u0432, \u0447\u0442\u043E \u043B\u044E\u0434\u0438 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430 \u00AB\u0437\u0430\u043C\u0435\u0442\u0430\u044E\u0442 \u0441\u043B\u0435\u0434\u044B\u00BB, \u0425\u043E\u043B\u043C\u0441 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043A \u0418\u0440\u044D\u043D, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u0435\u0434\u0443\u043F\u0440\u0435\u0434\u0438\u0442\u044C \u0435\u0451 \u043E\u0431 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438. \u041A\u043E\u0433\u0434\u0430 \u0428\u0435\u0440\u043B\u043E\u043A \u043E\u0442\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0443\u0435\u0445\u0430\u0442\u044C \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u043D\u0435\u0439, \u0418\u0440\u044D\u043D \u043E\u043F\u0430\u0438\u0432\u0430\u0435\u0442 \u0435\u0433\u043E \u0432\u0438\u043D\u043E\u043C \u0441\u043E \u0441\u043D\u043E\u0442\u0432\u043E\u0440\u043D\u044B\u043C \u0438 \u0441\u0431\u0435\u0433\u0430\u0435\u0442. \u041E\u0447\u043D\u0443\u0432\u0448\u0438\u0441\u044C, \u0425\u043E\u043B\u043C\u0441 \u0443\u0437\u043D\u0430\u0451\u0442, \u0447\u0442\u043E \u0441\u044D\u0440 \u0422\u043E\u043C\u0430\u0441 \u0431\u044B\u043B \u0443\u0431\u0438\u0442 \u0432 \u0441\u0432\u043E\u0451\u043C \u0434\u043E\u043C\u0435 \u044D\u0442\u0438\u043C \u0436\u0435 \u0432\u0435\u0447\u0435\u0440\u043E\u043C. \u0422\u0430\u043C \u043E\u043D \u043D\u0430\u0445\u043E\u0434\u0438\u0442 \u043F\u043E\u0442\u0430\u0439\u043D\u0443\u044E \u043A\u043E\u043C\u043D\u0430\u0442\u0443 \u0441 \u0438\u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u0435\u043C \u0434\u0440\u0430\u043A\u043E\u043D\u0430. \u041D\u0430 \u0442\u0430\u0439\u043D\u043E\u043C \u0441\u043E\u0431\u0440\u0430\u043D\u0438\u0438 \u0447\u043B\u0435\u043D\u043E\u0432 \u0425\u0440\u0430\u043C\u0430 \u0413\u043E\u0432\u0430\u0440\u0434 \u043E\u0431\u044A\u044F\u0432\u043B\u044F\u0435\u0442 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430 \u043D\u043E\u0432\u044B\u043C \u0433\u043B\u0430\u0432\u043E\u0439. \u0421\u0442\u0435\u043D\u0434\u0438\u0448 \u0432\u044B\u0441\u0442\u0443\u043F\u0430\u0435\u0442 \u043F\u0440\u043E\u0442\u0438\u0432 \u044D\u0442\u043E\u0439 \u0437\u0430\u0442\u0435\u0438, \u0433\u043E\u0432\u043E\u0440\u044F, \u0447\u0442\u043E \u00AB\u0441\u0438\u043B\u044B\u00BB, \u043A \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u043E\u0431\u0440\u0430\u0442\u0438\u043B\u0441\u044F \u0411\u043B\u044D\u043A\u0432\u0443\u0434, \u043D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u0438\u0440\u043E\u0432\u0430\u0442\u044C. \u0411\u043B\u0435\u043A\u0432\u0443\u0434 \u0432\u0437\u0438\u0440\u0430\u044F \u0441 \u0442\u0440\u0438\u0431\u0443\u043D\u044B, \u0440\u0430\u0441\u0441\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442 \u043E \u0441\u0432\u043E\u0435\u0439 \u0434\u0440\u0443\u0436\u0431\u0435 \u0441 \u043F\u0443\u0441\u0442\u0435\u043B\u044C\u0433\u043E\u0439, \u0438 \u0447\u0442\u043E \u043E\u043D \u043C\u043E\u0436\u0435\u0442 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043B\u044E\u0431\u044B\u0435 \u0441\u0438\u043B\u044B. \u041F\u0440\u0438\u0448\u0435\u0434\u0448\u0438\u0439 \u043D\u0430 \u0432\u0441\u0442\u0440\u0435\u0447\u0443 \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u043E\u0442\u043A\u0440\u044B\u0442\u043E \u0433\u043E\u0432\u043E\u0440\u0438\u0442 \u043F\u043E\u0441\u043B\u0443 \u0421\u0428\u0410, \u0447\u0442\u043E \u00AB\u0431\u044B\u0432\u0448\u0430\u044F \u043A\u043E\u043B\u043E\u043D\u0438\u044F\u00BB \u0432\u043D\u043E\u0432\u044C \u0432\u0435\u0440\u043D\u0435\u0442\u0441\u044F \u0432 \u043B\u043E\u043D\u043E \u0411\u0440\u0438\u0442\u0430\u043D\u0441\u043A\u043E\u0439 \u0438\u043C\u043F\u0435\u0440\u0438\u0438 \u0441 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u043E\u043C \u0432\u043E \u0433\u043B\u0430\u0432\u0435. \u0421\u0442\u0435\u043D\u0434\u0438\u0448 \u0441\u0442\u0440\u0435\u043B\u044F\u0435\u0442 \u0432 \u043D\u0435\u0433\u043E, \u043D\u043E \u0441\u0430\u043C \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442 \u0433\u043E\u0440\u0435\u0442\u044C \u0438 \u0432 \u043F\u0430\u043D\u0438\u043A\u0435 \u0431\u0440\u043E\u0441\u0430\u0435\u0442\u0441\u044F \u0438\u0437 \u043E\u043A\u043D\u0430. \u0423\u0432\u0435\u0440\u043E\u0432\u0430\u0432\u0448\u0438\u0435, \u0432 \u0441\u0438\u043B\u0443 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430, \u0447\u043B\u0435\u043D\u044B \u0425\u0440\u0430\u043C\u0430 \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u044E\u0442 \u043E\u0442 \u0440\u0443\u043A \u0413\u043E\u0432\u0430\u0440\u0434\u0430 \u0437\u043E\u043B\u043E\u0442\u0443\u044E \u0447\u0430\u0448\u0443 \u0438 \u0432 \u0437\u043D\u0430\u043A \u0432\u0435\u0440\u043D\u043E\u0441\u0442\u0438 \u043F\u044C\u044E\u0442 \u0438\u0437 \u043D\u0435\u0451. \u0410 \u0441\u0430\u043C \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u0432\u043E\u0437\u043B\u0430\u0433\u0430\u0435\u0442 \u043D\u0430 \u0433\u043E\u043B\u043E\u0432\u0443 \u0432\u0435\u043D\u0435\u0446.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164 (\u0441\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0412\u0435\u0440\u043D\u0443\u0432\u0448\u0438\u0441\u044C \u0434\u043E\u043C\u043E\u0439, \u0425\u043E\u043B\u043C\u0441 \u0438 \u0412\u0430\u0442\u0441\u043E\u043D \u043F\u043E\u043B\u0443\u0447\u0430\u044E\u0442 \u043D\u0435\u043F\u0440\u0438\u044F\u0442\u043D\u044B\u0435 \u0438\u0437\u0432\u0435\u0441\u0442\u0438\u044F \u2014 \u043B\u043E\u0440\u0434 \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u00AB\u0432\u043E\u0441\u0441\u0442\u0430\u043B \u0438\u0437 \u043C\u0435\u0440\u0442\u0432\u044B\u0445\u00BB: \u0435\u0433\u043E \u043C\u043E\u0433\u0438\u043B\u044C\u043D\u0443\u044E \u043F\u043B\u0438\u0442\u0443 \u0432\u044B\u0431\u0438\u043B\u0438 \u0438\u0437\u043D\u0443\u0442\u0440\u0438, \u0430 \u0432 \u0433\u0440\u043E\u0431\u0443 \u2014 \u0442\u0435\u043B\u043E \u043A\u0430\u0440\u043B\u0438\u043A\u0430, \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0438\u0441\u043A\u0430\u043B\u0430 \u0418\u0440\u044D\u043D. \u0422\u0435\u043F\u0435\u0440\u044C \u043D\u0430 \u043A\u043E\u043D\u0443 \u0441\u0442\u043E\u0438\u0442 \u0440\u0435\u043F\u0443\u0442\u0430\u0446\u0438\u044F \u0412\u0430\u0442\u0441\u043E\u043D\u0430 \u043A\u0430\u043A \u0432\u0440\u0430\u0447\u0430, \u0438\u0431\u043E \u043E\u043D \u043A\u043E\u043D\u0441\u0442\u0430\u0442\u0438\u0440\u043E\u0432\u0430\u043B \u0441\u043C\u0435\u0440\u0442\u044C \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430 \u043D\u0430 \u043A\u0430\u0437\u043D\u0438. \u041F\u043E\u0441\u0435\u0442\u0438\u0432 \u0434\u043E\u043C \u0420\u0438\u0435\u0440\u0434\u0435\u043D\u0430, \u0425\u043E\u043B\u043C\u0441 \u0438 \u0412\u0430\u0442\u0441\u043E\u043D \u0443\u0437\u043D\u0430\u044E\u0442, \u0447\u0442\u043E \u043E\u043D \u043E\u0431\u0449\u0430\u043B\u0441\u044F \u0441 \u00AB\u043F\u043E\u043A\u043E\u0439\u043D\u044B\u043C\u00BB \u043B\u043E\u0440\u0434\u043E\u043C. \u041E\u043D\u0438 \u043C\u043E\u0433\u043B\u0438 \u0431\u044B \u0443\u0437\u043D\u0430\u0442\u044C \u0431\u043E\u043B\u044C\u0448\u0435, \u043D\u043E \u0432 \u0434\u043E\u043C \u0432\u0440\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u043B\u044E\u0434\u0438 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u0443\u043D\u0438\u0447\u0442\u043E\u0436\u0438\u0442\u044C \u0441\u043B\u0435\u0434\u044B \u0442\u0430\u0438\u043D\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0445 \u044D\u043A\u0441\u043F\u0435\u0440\u0438\u043C\u0435\u043D\u0442\u043E\u0432 \u0436\u0435\u0440\u0442\u0432\u044B. \u041D\u0430\u0447\u0438\u043D\u0430\u0435\u0442\u0441\u044F \u043F\u043E\u0442\u0430\u0441\u043E\u0432\u043A\u0430, \u0434\u0432\u0430 \u043F\u043E\u0434\u0440\u0443\u0447\u043D\u044B\u0445 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430 \u043E\u0431\u0435\u0437\u0432\u0440\u0435\u0436\u0435\u043D\u044B, \u043D\u043E \u0438\u0445 \u0441\u043E\u043E\u0431\u0449\u043D\u0438\u043A, \u0433\u0440\u043E\u043C\u0438\u043B\u0430 \u0414\u0440\u0435\u0434\u0436\u0435\u0440 \u0432 \u0445\u043E\u0434\u0435 \u043F\u043E\u0442\u0430\u0441\u043E\u0432\u043A\u0438, \u043F\u043E\u0441\u0442\u0435\u043F\u0435\u043D\u043D\u043E \u043F\u0435\u0440\u0435\u0448\u0435\u0434\u0448\u0435\u0439 \u043D\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043E\u0440\u0438\u044E \u0432\u0435\u0440\u0444\u0438, \u0440\u0430\u0437\u0440\u0443\u0448\u0430\u0435\u0442 \u043F\u043E\u0434\u043F\u043E\u0440\u043A\u0438 \u0441\u0442\u0440\u043E\u044F\u0449\u0435\u0433\u043E\u0441\u044F \u043A\u043E\u0440\u0430\u0431\u043B\u044F. \u0417\u0430 \u043D\u0430\u043D\u0435\u0441\u0435\u043D\u0438\u0435 \u0443\u0449\u0435\u0440\u0431\u0430 \u0447\u0443\u0436\u043E\u043C\u0443 \u0438\u043C\u0443\u0449\u0435\u0441\u0442\u0432\u0443 \u0425\u043E\u043B\u043C\u0441\u0430 \u0438 \u0412\u0430\u0442\u0441\u043E\u043D\u0430 \u0431\u0435\u0440\u0443\u0442 \u043F\u043E\u0434 \u0441\u0442\u0440\u0430\u0436\u0443. \u0412\u0441\u043A\u043E\u0440\u0435 \u0412\u0430\u0442\u0441\u043E\u043D\u0430 \u0432\u044B\u043F\u0443\u0441\u043A\u0430\u044E\u0442 \u043F\u043E\u0434 \u0437\u0430\u043B\u043E\u0433, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0432\u043D\u0435\u0441\u043B\u0430 \u041C\u044D\u0440\u0438. \u0417\u0430 \u0425\u043E\u043B\u043C\u0441\u0430 \u0432 \u043A\u043E\u043D\u0446\u0435 \u043A\u043E\u043D\u0446\u043E\u0432 \u0442\u0430\u043A\u0436\u0435 \u0432\u043D\u043E\u0441\u044F\u0442 \u0437\u0430\u043B\u043E\u0433 \u0438 \u0437\u0430\u0431\u0438\u0440\u0430\u044E\u0442 \u0432 \u0441\u0435\u043A\u0440\u0435\u0442\u043D\u043E\u0435 \u043E\u043A\u043A\u0443\u043B\u044C\u0442\u043D\u043E\u0435 \u043E\u0431\u0449\u0435\u0441\u0442\u0432\u043E \u2014 \u041A\u043E\u043C\u0438\u0442\u0435\u0442 \u0421\u043E\u0442\u0432\u043E\u0440\u0435\u043D\u043D\u043E\u0439 \u041C\u043E\u043B\u0438\u0442\u0432\u044B.\n\u041C\u0410\u041A\u0421\u0418\u041C\u0410\u041B\u042C\u041D\u0410\u042F \u0422\u0418\u0428\u0418\u041D\u0410 \u041D\u0410 \u0423\u0420\u041E\u0412\u041D\u0415\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,2
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163 (\u0441\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0422\u0435\u043C \u0432\u0440\u0435\u043C\u0435\u043D\u0435\u043C \u041B\u043E\u0440\u0434 \u0411\u043B\u044D\u043A\u0432\u0443\u0434, \u043F\u0440\u0438\u0433\u043E\u0432\u043E\u0440\u0435\u043D\u043D\u044B\u0439 \u043A \u0441\u043C\u0435\u0440\u0442\u0438 \u0447\u0435\u0440\u0435\u0437 \u043F\u043E\u0432\u0435\u0448\u0435\u043D\u0438\u0435, \u0433\u043B\u0443\u043C\u0438\u0442\u0441\u044F \u043D\u0430\u0434 \u0441\u043E\u043A\u0430\u043C\u0435\u0440\u043D\u0438\u043A\u0430\u043C\u0438 \u0438 \u043E\u0445\u0440\u0430\u043D\u043D\u0438\u043A\u0430\u043C\u0438. \u0412\u0441\u044F \u0442\u044E\u0440\u044C\u043C\u0430 \u0432 \u043F\u0430\u043D\u0438\u043A\u0435, \u0438 \u0432\u0435\u0441\u044C \u041B\u043E\u043D\u0434\u043E\u043D \u0436\u0434\u0435\u0442 \u0441\u043C\u0435\u0440\u0442\u0438 \u0447\u0435\u0440\u043D\u043E\u043A\u043D\u0438\u0436\u043D\u0438\u043A\u0430. \u0412\u0438\u0441\u0435\u043B\u0438\u0446\u0430 \u0432\u043E\u0437\u0432\u0435\u0434\u0435\u043D\u0430, \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0435 \u0436\u0435\u043B\u0430\u043D\u0438\u0435 \u0411\u043B\u044D\u043A\u0432\u0443\u0434\u0430 \u2014 \u0441\u0432\u0438\u0434\u0430\u043D\u0438\u0435 \u0441 \u0428\u0435\u0440\u043B\u043E\u043A\u043E\u043C \u0425\u043E\u043B\u043C\u0441\u043E\u043C, \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u043E\u043C, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0435\u0433\u043E \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u043B. \u0421\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u043C \u0443\u0442\u0440\u043E\u043C \u0428\u0435\u0440\u043B\u043E\u043A\u0430 \u043F\u043E\u0441\u0435\u0449\u0430\u0435\u0442 \u0435\u0433\u043E \u0434\u0430\u0432\u043D\u044F\u044F \u0437\u043D\u0430\u043A\u043E\u043C\u0430\u044F \u2014 \u0432\u0441\u0435\u043C\u0438\u0440\u043D\u043E \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u0430\u044F \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043D\u0438\u0446\u0430 \u0418\u0440\u044D\u043D \u0410\u0434\u043B\u0435\u0440, \u0441 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0435\u0433\u043E \u0441\u0432\u044F\u0437\u044B\u0432\u0430\u044E\u0442 \u0441\u043B\u043E\u0436\u043D\u044B\u0435 \u0447\u0443\u0432\u0441\u0442\u0432\u0430. \u041E\u043D\u0430 \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u0442 \u0435\u043C\u0443 \u0434\u0435\u043D\u044C\u0433\u0438 \u0437\u0430 \u0442\u043E, \u0447\u0442\u043E\u0431\u044B \u043E\u043D \u043D\u0430\u0448\u0451\u043B \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u2014 \u0440\u044B\u0436\u0435\u0433\u043E \u043A\u0430\u0440\u043B\u0438\u043A\u0430 \u043F\u043E \u0438\u043C\u0435\u043D\u0438 \u041B\u044E\u043A \u0420\u0438\u0435\u0440\u0434\u0435\u043D. \u0428\u0435\u0440\u043B\u043E\u043A \u043D\u0435 \u0433\u043B\u0430\u0441\u043D\u043E \u043E\u0442\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F, \u0445\u043E\u0442\u044F \u043F\u043E\u0442\u043E\u043C \u0442\u0430\u0439\u043D\u043E \u043F\u0440\u0435\u0441\u043B\u0435\u0434\u0443\u0435\u0442 \u0435\u0451, \u0447\u0442\u043E\u0431\u044B \u0443\u0437\u043D\u0430\u0442\u044C, \u043A\u0442\u043E \u0435\u0451 \u0437\u0430\u043A\u0430\u0437\u0447\u0438\u043A. \u0412 \u043F\u043E\u0433\u043E\u043D\u0435 \u0437\u0430 \u043D\u0435\u0439 \u0448\u0435\u0440\u043B\u043E\u043A \u043D\u0430\u0442\u044B\u043A\u0430\u0435\u0442\u0441\u044F \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0435 \u043D\u0430\u0434\u043F\u0438\u0441\u0438, \u043F\u0440\u043E\u0441\u0442\u043E \u0442\u0430\u0440\u0430\u0431\u0430\u0440\u0449\u0438\u043D\u0443: \u0417\u0410\u0422\u0410\u0412\u041A \u0418 \u041A\u041E\u0426\u041E\u041B\u042C \u0420\u0413\u0414\u0412\u0415\u0414\u0418\u0427\u0418\u0413\u042C \u0429\u0410 \u0423\u0421\u0427\u0423 \u0411\u041E\u041C\u0427\u0418 \u0420 \u0411\u041E\u0427\u0415 \u0423\u0420\u0418\u0422\u0410\u0420 \u0422\u041E\u0428 \u0412\u0415\u041C\u0418\u0427\u0418 \u0411\u0412\u041E\u041F\u0427\u0415\u0428\u0423\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1,2
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u0421\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0442\u0440\u0438 \u043C\u0435\u0441\u044F\u0446\u0430 \u0425\u043E\u043B\u043C\u0441 \u0441\u043A\u0443\u0447\u0430\u0435\u0442 \u2014 \u043E\u043D \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u043D\u0430\u0439\u0442\u0438 \u0434\u043B\u044F \u0441\u0435\u0431\u044F \u0441\u0442\u043E\u044F\u0449\u0435\u0435 \u0434\u0435\u043B\u043E, \u043A \u0442\u043E\u043C\u0443 \u0436\u0435 \u043F\u043E\u043C\u043E\u043B\u0432\u043A\u0430 \u0438 \u043F\u0435\u0440\u0435\u0435\u0437\u0434 \u0434\u0440\u0443\u0433\u0430 \u0442\u043E\u043B\u044C\u043A\u043E \u043F\u043E\u0434\u043B\u0438\u0432\u0430\u044E\u0442 \u043C\u0430\u0441\u043B\u0430 \u0432 \u043E\u0433\u043E\u043D\u044C. \u0412\u0441\u0451 \u0436\u0435 \u0414\u0436\u043E\u043D\u0443 \u0443\u0434\u0430\u0451\u0442\u0441\u044F \u0443\u0433\u043E\u0432\u043E\u0440\u0438\u0442\u044C \u0428\u0435\u0440\u043B\u043E\u043A\u0430 \u043F\u043E\u0439\u0442\u0438 \u043D\u0430 \u0443\u0436\u0438\u043D \u0438 \u043F\u043E\u0437\u043D\u0430\u043A\u043E\u043C\u0438\u0442\u044C\u0441\u044F \u0441 \u0435\u0433\u043E \u043D\u0435\u0432\u0435\u0441\u0442\u043E\u0439 \u041C\u044D\u0440\u0438 \u041C\u043E\u0440\u0441\u0442\u0435\u043D, \u043D\u043E \u0432\u0435\u0447\u0435\u0440 \u0437\u0430\u043A\u0430\u043D\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0441\u043A\u0430\u043D\u0434\u0430\u043B\u043E\u043C.  - \u041A\u043E\u043B\u044C\u0446\u0430 \u043D\u0435\u0442, \u043D\u043E \u0441\u0432\u0435\u0442\u043B\u043E\u0435 \u043C\u0435\u0441\u0442\u043E \u043D\u0430 \u043F\u0430\u043B\u044C\u0446\u0435 \u0433\u043E\u0432\u043E\u0440\u0438\u0442, \u0447\u0442\u043E \u0437\u0430 \u0433\u0440\u0430\u043D\u0438\u0446\u0435\u0439... \u0433\u0434\u0435 \u0412\u044B \u0431\u044B\u043B\u0438 \u043A\u0430\u043A\u043E\u0435-\u0442\u043E \u0432\u0440\u0435\u043C\u044F \u0438 \u0441 \u0433\u043E\u0440\u0434\u043E\u0441\u0442\u044C\u044E \u0435\u0433\u043E \u043D\u043E\u0441\u0438\u043B\u0438, \u043F\u043E\u043A\u0430...\u043D\u0435 \u0443\u0437\u043D\u0430\u043B\u0438 \u0435\u0433\u043E \u0441\u043A\u0440\u043E\u043C\u043D\u0443\u044E \u0446\u0435\u043D\u0443. \u0422\u043E\u0433\u0434\u0430 \u0412\u044B \u0440\u0430\u0437\u043E\u0440\u0432\u0430\u043B\u0438 \u043F\u043E\u043C\u043E\u043B\u0432\u043A\u0443, \u0432\u0435\u0440\u043D\u0443\u043B\u0438\u0441\u044C \u0432 \u0410\u043D\u0433\u043B\u0438\u044E \u0438 \u0441\u0442\u0430\u043B\u0438 \u0438\u0441\u043A\u0430\u0442\u044C \u0431\u043E\u043B\u0435\u0435 \u0432\u044B\u0433\u043E\u0434\u043D\u0443\u044E \u043F\u0430\u0440\u0442\u0438\u044E. \u0418 \u043D\u0430\u0448\u043B\u0438 \u0434\u043E\u043A\u0442\u043E\u0440\u0430... \u0412\u044B \u043F\u0440\u0430\u0432\u044B \u043F\u043E \u0432\u0441\u0435\u043C \u043F\u0443\u043D\u043A\u0442\u0430\u043C \u043C\u0438\u0441\u0442\u0435\u0440 \u0425\u043E\u043B\u043C\u0441, \u043A\u0440\u043E\u043C\u0435 \u043E\u0434\u043D\u043E\u0433\u043E. \u042F \u043D\u0435 \u0440\u0430\u0437\u0440\u044B\u0432\u0430\u043B\u0430 \u0441 \u0436\u0435\u043D\u0438\u0445\u043E\u043C \u043F\u043E\u043C\u043E\u043B\u0432\u043A\u0443. \u041E\u043D \u0443\u043C\u0435\u0440. \u0412\u0437\u0433\u043B\u044F\u043D\u0443\u0432, \u0433\u0440\u043E\u0437\u043D\u0435\u043D\u044C\u043A\u043E \u043D\u0430 \u0428\u0435\u0440\u043B\u043E\u043A\u0430, \u041C\u044D\u0440\u0438 \u0440\u0435\u0437\u043A\u043E \u0432\u0441\u0442\u0430\u043B\u0430 \u0438\u0437 \u0437\u0430 \u0441\u0442\u043E\u043B\u0430, \u0442\u0430\u043A \u0436\u0435 \u0440\u0435\u0437\u043A\u043E \u0437\u0430\u0434\u0432\u0438\u043D\u0443\u043B\u0430 \u0441\u0442\u0443\u043B. \u0424\u0443\u0440\u043D\u0438\u0442\u0443\u0440\u0430 \u043A \u0447\u0435\u0441\u0442\u0438 \u0432\u044B\u0434\u0435\u0440\u0436\u0430\u043B\u0430 \u043D\u0430\u043F\u043E\u0440 \u043B\u0438\u0448\u044C \u0433\u0440\u043E\u0437\u043D\u043E \u0437\u0430\u0441\u043A\u0440\u0438\u043F\u0435\u0432. \u2013 \u041F\u0440\u043E\u0449\u0430\u0439\u0442\u0435 \u043C\u0438\u0441\u0442\u0435\u0440 \u0425\u043E\u043B\u043C\u0441.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n(\u0441 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0425\u043E\u043B\u043C\u0441 \u0438 \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u0441\u0445\u043E\u0434\u044F\u0442\u0441\u044F \u0432 \u0441\u0445\u0432\u0430\u0442\u043A\u0435, \u0438 \u0441\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0437\u0430\u043A\u0430\u043D\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u043F\u043E\u0431\u0435\u0434\u043E\u0439 \u0428\u0435\u0440\u043B\u043E\u043A\u0430. \u041F\u043E\u043A\u0430 \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u0432\u0438\u0441\u0438\u0442 \u043D\u0430 \u0440\u0443\u043A\u0430\u0445 \u043D\u0430\u0434 \u0422\u0435\u043C\u0437\u043E\u0439, \u0425\u043E\u043B\u043C\u0441 \u0440\u0430\u0441\u0441\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442 \u0435\u043C\u0443 \u043E \u0442\u043E\u043C, \u0447\u0442\u043E \u0431\u044B\u043B\u043E \u0432 \u0441\u0430\u043C\u043E\u043C \u043D\u0430\u0447\u0430\u043B\u0435. \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u0432 \u044F\u0440\u043E\u0441\u0442\u0438 \u0432\u043E\u0435\u0442, \u043E\u043D \u0434\u0438\u043A \u0438 \u0437\u043B\u043E\u0431\u0435\u043D. \u041E\u043D \u043F\u043E \u043F\u0440\u0435\u0436\u043D\u0435\u043C\u0443, \u0440\u0430\u0441\u043A\u0430\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u043C\u0435\u0436\u0434\u0443 \u0443\u0432\u0435\u0441\u0438\u0441\u0442\u044B\u0445 \u0433\u0440\u043E\u043C\u0430\u0434\u0438\u043D \u0438 \u0431\u0443\u0440\u0435 \u0435\u0433\u043E \u043F\u043B\u0430\u0447 \u043F\u043E\u0434\u043E\u0431\u0435\u043D, \u043E\u043D \u0437\u0430\u0445\u043B\u0435\u0431\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0441\u0432\u043E\u0435\u0439 \u043D\u0435\u043D\u0430\u0432\u0438\u0441\u0442\u044C\u044E. \u0421\u043B\u044E\u043D\u0438 \u0431\u0440\u044B\u0437\u0433\u0430\u043C\u0438 \u043B\u0435\u0442\u044F\u0442.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0412\u0441\u0451 \u0436\u0435 \u043E\u043D \u0441\u043F\u0430\u0441\u0430\u0435\u0442 \u043B\u043E\u0440\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u0442\u043E\u0442 \u043E\u0442\u0432\u0435\u0442\u0438\u043B \u0437\u0430 \u0441\u0432\u043E\u0438 \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043B\u0435\u043D\u0438\u044F \u043F\u0435\u0440\u0435\u0434 \u0441\u0443\u0434\u043E\u043C. \u041E\u0434\u043D\u0430\u043A\u043E \u043A\u0430\u043A \u0432 \u0442\u0440\u0430\u0433\u0438\u0447\u0435\u0441\u043A\u043E\u0439 \u043F\u043E\u044D\u043C\u0435, \u0432\u043D\u0435\u0437\u0430\u043F\u043D\u043E \u0443\u043F\u0430\u0432\u0448\u0430\u044F \u0431\u0430\u043B\u043A\u0430 \u0442\u044F\u043D\u0435\u0442 \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043D\u0438\u043A\u0430 \u0437\u0430 \u0441\u043E\u0431\u043E\u0439, \u0438 \u0411\u043B\u044D\u043A\u0432\u0443\u0434 \u0433\u0438\u0431\u043D\u0435\u0442 \u043E\u0442 \u0443\u0434\u0443\u0448\u0435\u043D\u0438\u044F \u0446\u0435\u043F\u044C\u044E. \u0425\u043E\u043B\u043C\u0441 \u0441\u0438\u0434\u0438\u0442 \u043D\u0430 \u0431\u0430\u043B\u043A\u0435 \u0438 \u0441\u043C\u043E\u0442\u0440\u0438\u0442 \u043D\u0430 \u0440\u0435\u043A\u0443 \u0441 \u043C\u043E\u0441\u0442\u0430. \u041C\u043E\u0436\u0435\u0442 \u043D\u0430\u043F\u0438\u0441\u0430\u0442\u044C \u0441\u0442\u0438\u0445?
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0427\u043A\u0430\u043B\u043E\u0432\u0441\u043A\u0438\u0439 \u043C\u043E\u0441\u0442, \u041B\u0435\u0440\u043C\u043E\u043D\u0442\u043E\u0432 \u041A\u043B\u0430\u0441\u0441\u0438\u043A\u0430 \u043D\u0435 \u0437\u043D\u0430\u0435\u0442\u0435?))))
TASK_CODE_7=F2L9N5
BONUS_FIVE_MINUTES=ARS4
BONUS_TEN_MINUTES=TNT9
BONUS_FIFTEEN_MINUTES=Z2Z2