#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="\u0413\u0430\u0440\u0440\u0438 \u041F\u043E\u0442\u0442\u0435\u0440 \u0438 \u0422\u0430\u0439\u043D\u0430\u044F \u043A\u043E\u043C\u043D\u0430\u0442\u0430"\n\n\u041D\u0430 \u043E\u0434\u0438\u043D\u043D\u0430\u0434\u0446\u0430\u0442\u044B\u0439 \u0434\u0435\u043D\u044C \u0440\u043E\u0436\u0434\u0435\u043D\u0438\u044F \u0413\u0430\u0440\u0440\u0438 \u0443\u0437\u043D\u0430\u0451\u0442, \u0447\u0442\u043E \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u0438\u043A\u043E\u043C \u0438 \u0435\u043C\u0443 \u0443\u0433\u043E\u0442\u043E\u0432\u0430\u043D\u043E \u043C\u0435\u0441\u0442\u043E \u0432 \u0448\u043A\u043E\u043B\u0435 \u0447\u0430\u0440\u043E\u0434\u0435\u0439\u0441\u0442\u0432\u0430 \u0438 \u0432\u043E\u043B\u0448\u0435\u0431\u0441\u0442\u0432\u0430 \u00AB\u0425\u043E\u0433\u0432\u0430\u0440\u0442\u0441\u00BB, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u043E\u043D \u0431\u0443\u0434\u0435\u0442 \u043F\u0440\u0430\u043A\u0442\u0438\u043A\u043E\u0432\u0430\u0442\u044C \u043C\u0430\u0433\u0438\u044E. \u0422\u0430\u043A\u0436\u0435 \u0413\u0430\u0440\u0440\u0438 \u043E\u0431\u043D\u0430\u0440\u0443\u0436\u0438\u0432\u0430\u0435\u0442, \u0447\u0442\u043E \u043E\u043D \u0443\u0436\u0435 \u0438\u0437\u0432\u0435\u0441\u0442\u0435\u043D \u0432\u043E \u0432\u0441\u0451\u043C \u043C\u0430\u0433\u0438\u0447\u0435\u0441\u043A\u043E\u043C \u043C\u0438\u0440\u0435 \u0438 \u0435\u0433\u043E \u0441\u0443\u0434\u044C\u0431\u0430 \u0441\u0432\u044F\u0437\u0430\u043D\u0430 \u0441 \u0441\u0443\u0434\u044C\u0431\u043E\u0439 \u0412\u043E\u043B\u0430\u043D-\u0434\u0435-\u041C\u043E\u0440\u0442\u0430 - \u043E\u043F\u0430\u0441\u043D\u043E\u0433\u043E \u0442\u0451\u043C\u043D\u043E\u0433\u043E \u043C\u0430\u0433\u0430, \u0443\u0431\u0438\u0432\u0448\u0435\u0433\u043E \u0441\u0440\u0435\u0434\u0438 \u043F\u0440\u043E\u0447\u0438\u0445 \u0438 \u0435\u0433\u043E \u0440\u043E\u0434\u0438\u0442\u0435\u043B\u0435\u0439. \u0413\u0430\u0440\u0440\u0438 \u041F\u043E\u0442\u0442\u0435\u0440 \u043F\u0435\u0440\u0435\u0445\u043E\u0434\u0438\u0442 \u043D\u0430 \u0432\u0442\u043E\u0440\u043E\u0439 \u043A\u0443\u0440\u0441 \u0428\u043A\u043E\u043B\u044B \u0447\u0430\u0440\u043E\u0434\u0435\u0439\u0441\u0442\u0432\u0430 \u0438 \u0432\u043E\u043B\u0448\u0435\u0431\u0441\u0442\u0432\u0430 \u0425\u043E\u0433\u0432\u0430\u0440\u0442\u0441. \u042D\u043B\u044C\u0444 \u0414\u043E\u0431\u0431\u0438 \u043F\u0440\u0435\u0434\u0443\u043F\u0440\u0435\u0436\u0434\u0430\u0435\u0442 \u0413\u0430\u0440\u0440\u0438 \u043E\u0431 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u043F\u043E\u0434\u0436\u0438\u0434\u0430\u0435\u0442 \u0435\u0433\u043E \u0442\u0430\u043C, \u0438 \u043F\u0440\u043E\u0441\u0438\u0442 \u0431\u043E\u043B\u044C\u0448\u0435 \u043D\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0442\u044C\u0441\u044F \u0432 \u0448\u043A\u043E\u043B\u0443.\n\n\u0421\u043F\u0438\u0441\u043E\u043A \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u044B\u0445 \u043A \u0448\u043A\u043E\u043B\u0435 \u0443\u0447\u0435\u0431\u043D\u0438\u043A\u043E\u0432 \u0438 \u0432\u0435\u0449\u0435\u0439 \u0434\u043B\u044F \u0432\u0442\u043E\u0440\u043E\u043A\u0443\u0440\u0441\u043D\u0438\u043A\u043E\u0432:\n-\u0424\u043E\u043D\u0430\u0440\u0438\u043A "\u041B\u044E\u043C\u043E\u0441" (\u043D\u0435\u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u043D\u043E\u0435 \u043A\u043E\u043B-\u0432\u043E)\n-\u0421\u0430\u043F\u043E\u0433\u0438(\u0438\u0437 \u043A\u043E\u0436\u0438 \u0434\u0440\u0430\u043A\u043E\u043D\u0430 \u0438\u043B\u0438 \u0430\u043D\u0430\u043B\u043E\u0433\u0438\u0447\u043D\u043E\u0433\u043E \u043F\u043E \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430\u043C \u043C\u0430\u0442\u0435\u0440\u0438\u0430\u043B\u0430)\n-\u0422\u0435\u043B\u0435\u0444\u043E\u043D \u0441 \u0442\u0435\u043B\u0435\u0433\u0440\u0430\u043C\u043E\u043C(\u043C\u0430\u0433\u043B\u043E\u0432\u0441\u043A\u043E\u0435 \u0438\u0437\u043E\u0431\u0440\u0435\u0442\u0435\u043D\u0438\u0435)\n-1 \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u0430\u044F \u043F\u0430\u043B\u043E\u0447\u043A\u0430\n-\u0420\u0435\u043A\u0432\u0438\u0437\u0438\u0442 \u0434\u043B\u044F \u0441\u043F\u0430\u0441\u0435\u043D\u0438\u044F \u0414\u043E\u0431\u0431\u0438\n-1 \u0443\u0444-\u0444\u043E\u043D\u0430\u0440\u044C (\u044F\u0440\u043A\u0438\u0439,\u0440\u0430\u0437\u043C\u0435\u0440 \u21163)
START_CODE=sc
START_DATE=28-04-2018
START_TIME=22-00
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0413\u0430\u0440\u0440\u0438 \u0447\u0443\u0442\u044C \u043D\u0435 \u0430\u0445\u043D\u0443\u043B \u043E\u0442 \u0443\u0434\u0438\u0432\u043B\u0435\u043D\u0438\u044F, \u043D\u043E \u0443\u0434\u0435\u0440\u0436\u0430\u043B\u0441\u044F. \u041D\u0430 \u043A\u0440\u043E\u0432\u0430\u0442\u0438 \u0441\u0438\u0434\u0435\u043B \u043C\u0430\u043B\u0435\u043D\u044C\u043A\u0438\u0439 \u0447\u0435\u043B\u043E\u0432\u0435\u0447\u0435\u043A, \u0443\u0448\u0430\u043C\u0438 \u043D\u0430\u043F\u043E\u043C\u0438\u043D\u0430\u0432\u0448\u0438\u0439 \u043B\u0435\u0442\u0443\u0447\u0443\u044E \u043C\u044B\u0448\u044C, \u0438 \u0442\u0430\u0440\u0430\u0449\u0438\u043B \u043D\u0430 \u043D\u0435\u0433\u043E \u0432\u044B\u043F\u0443\u0447\u0435\u043D\u043D\u044B\u0435 \u0437\u0435\u043B\u0435\u043D\u044B\u0435 \u0433\u043B\u0430\u0437\u0430 \u0432\u0435\u043B\u0438\u0447\u0438\u043D\u043E\u0439 \u0441 \u0442\u0435\u043D\u043D\u0438\u0441\u043D\u044B\u0439 \u043C\u044F\u0447.\n\u2014 \u041F-\u043F\u0440\u0438\u0432\u0435\u0442, \u2014 \u043F\u043E\u043F\u0435\u0440\u0445\u043D\u0443\u043B\u0441\u044F \u0413\u0430\u0440\u0440\u0438.\n\u2014 \u0413\u0430\u0440\u0440\u0438 \u041F\u043E\u0442\u0433\u0435\u0440! \u2014 \u043F\u0440\u043E\u043D\u0437\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u043C \u0433\u043E\u043B\u043E\u0441\u043E\u043C \u0432\u043E\u0441\u043A\u043B\u0438\u043A\u043D\u0443\u043B \u043D\u0435\u0436\u0434\u0430\u043D\u043D\u044B\u0439 \u0433\u043E\u0441\u0442\u044C. \u2014 \u0414\u043E\u0431\u0431\u0438 \u0442\u0430\u043A \u0434\u0430\u0432\u043D\u043E \u043C\u0435\u0447\u0442\u0430\u043B \u0441 \u0432\u0430\u043C\u0438 \u043F\u043E\u0437\u043D\u0430\u043A\u043E\u043C\u0438\u0442\u044C\u0441\u044F, \u0441\u044D\u0440\u2026 \u042D\u0442\u043E \u0442\u0430\u043A\u0430\u044F \u0447\u0435\u0441\u0442\u044C\u2026\n\u2014 \u0411-\u0431\u043B\u0430\u0433\u043E\u0434\u0430\u0440\u044E \u0432\u0430\u0441, \u2014 \u043A\u0438\u0432\u043D\u0443\u043B \u0413\u0430\u0440\u0440\u0438.\n\u0414\u0432\u0438\u0433\u0430\u044F\u0441\u044C \u0432\u0434\u043E\u043B\u044C \u0441\u0442\u0435\u043D\u043A\u0438, \u043E\u043D \u0434\u043E\u0441\u0442\u0438\u0433 \u043F\u0438\u0441\u044C\u043C\u0435\u043D\u043D\u043E\u0433\u043E \u0441\u0442\u043E\u043B\u0430 \u0438 \u043E\u043F\u0443\u0441\u0442\u0438\u043B\u0441\u044F \u043D\u0430 \u0441\u0442\u0443\u043B \u0440\u044F\u0434\u043E\u043C \u0441 \u043F\u0440\u043E\u0441\u0442\u043E\u0440\u043D\u043E\u0439 \u043A\u043B\u0435\u0442\u043A\u043E\u0439, \u0433\u0434\u0435 \u0441\u043F\u0430\u043B\u0430 \u0441\u0435\u0439\u0447\u0430\u0441 \u0441\u043E\u0432\u0430 \u0411\u0443\u043A\u043B\u044F. \u0413\u0430\u0440\u0440\u0438 \u0445\u043E\u0442\u0435\u043B \u0431\u044B\u043B\u043E \u0441\u043F\u0440\u043E\u0441\u0438\u0442\u044C \u043D\u0435\u0437\u043D\u0430\u043A\u043E\u043C\u0446\u0430 \u043A\u0442\u043E \u043E\u043D, \u043D\u043E, \u043F\u043E\u0434\u0443\u043C\u0430\u0432, \u0447\u0442\u043E \u044D\u0442\u043E \u043D\u0435\u0443\u0447\u0442\u0438\u0432\u043E, \u0441\u043F\u0440\u043E\u0441\u0438\u043B \u0442\u043E\u043B\u044C\u043A\u043E \u0435\u0433\u043E \u0438\u043C\u044F.\n\u2014 \u0414\u043E\u0431\u0431\u0438, \u0441\u044D\u0440, \u2014 \u043E\u0442\u0432\u0435\u0442\u0438\u043B \u0447\u0435\u043B\u043E\u0432\u0435\u0447\u0435\u043A \u2014 \u041F\u0440\u043E\u0441\u0442\u043E \u0414\u043E\u0431\u0431\u0438. \u0414\u043E\u0431\u0431\u0438-\u0434\u043E\u043C\u043E\u0432\u0438\u043A, \u0435\u0441\u043B\u0438 \u0443\u0433\u043E\u0434\u043D\u043E, \u0434\u043E\u043C\u043E\u0432\u043E\u0439 \u044D\u043B\u044C\u0444.\n(\u041D\u0430\u0439\u0434\u0438\u0442\u0435 \u0434\u043E\u043C\u043E\u0432\u0438\u043A\u0430 \u0438 "\u043E\u0441\u0432\u043E\u0431\u043E\u0434\u0438\u0442\u0435" \u0435\u0433\u043E)\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0413\u0430\u0440\u0440\u0438 \u0432\u0437\u044F\u043B \u043F\u0438\u0441\u044C\u043C\u043E. \u041F\u043E\u0437\u0434\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F \u0441 \u0434\u043D\u0435\u043C \u0440\u043E\u0436\u0434\u0435\u043D\u0438\u044F \u0432 \u043D\u0435\u043C \u043D\u0435 \u0431\u044B\u043B\u043E. \u0412\u043E\u0442 \u0447\u0442\u043E \u043E\u043D \u043F\u0440\u043E\u0447\u0438\u0442\u0430\u043B: \u00AB\u0414\u043E\u0440\u043E\u0433\u043E\u0439 \u043C\u0438\u0441\u0442\u0435\u0440 \u041F\u043E\u0442\u0442\u0435\u0440! \u041C\u044B \u043F\u043E\u043B\u0443\u0447\u0438\u043B\u0438 \u0434\u043E\u043D\u0435\u0441\u0435\u043D\u0438\u0435, \u0447\u0442\u043E \u0432 \u043C\u0435\u0441\u0442\u0435 \u0412\u0430\u0448\u0435\u0433\u043E \u043F\u0440\u043E\u0436\u0438\u0432\u0430\u043D\u0438\u044F \u043C\u0435\u0436\u0434\u0443 3-\u0445 \u0443\u043B\u0438\u0446 \u0431\u044B\u043B\u043E \u043F\u0440\u0438\u043C\u0435\u043D\u0435\u043D\u043E \u0437\u0430\u043A\u043B\u0438\u043D\u0430\u043D\u0438\u0435 \u041B\u0435\u0432\u0438\u0442\u0430\u0446\u0438\u0438. \u041A\u0430\u043A \u0412\u0430\u043C \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E, \u043D\u0435\u0441\u043E\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E\u043B\u0435\u0442\u043D\u0438\u043C \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u0438\u043A\u0430\u043C \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u043E \u0432\u043D\u0435 \u0448\u043A\u043E\u043B\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043F\u0440\u0438\u0435\u043C\u044B \u0447\u0430\u0440\u043E\u0434\u0435\u0439\u0441\u0442\u0432\u0430. \u0415\u0449\u0435 \u043E\u0434\u043D\u0430 \u0442\u0430\u043A\u0430\u044F \u043F\u0440\u043E\u0432\u0438\u043D\u043D\u043E\u0441\u0442\u044C, \u0438 \u0412\u0430\u0441 \u0438\u0441\u043A\u043B\u044E\u0447\u0430\u0442 \u0438\u0437 \u0432\u044B\u0448\u0435\u0443\u043F\u043E\u043C\u044F\u043D\u0443\u0442\u043E\u0439 \u0448\u043A\u043E\u043B\u044B \u0441\u043E\u0433\u043B\u0430\u0441\u043D\u043E \u0423\u043A\u0430\u0437\u0443, \u043F\u0440\u0435\u0434\u0443\u0441\u043C\u0430\u0442\u0440\u0438\u0432\u0430\u044E\u0449\u0435\u043C\u0443 \u0440\u0430\u0437\u0443\u043C\u043D\u043E\u0435 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0432\u043E\u043B\u0448\u0435\u0431\u0441\u0442\u0432\u0430 \u043D\u0435\u0441\u043E\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E\u043B\u0435\u0442\u043D\u0438\u0445 (1979-1989\u0433., \u043F\u0430\u0440\u0430\u0433\u0440\u0430\u0444 \u0421). \u0421\u0447\u0430\u0441\u0442\u043B\u0438\u0432\u044B\u0445 \u043A\u0430\u043D\u0438\u043A\u0443\u043B! \u0418\u0441\u043A\u0440\u0435\u043D\u043D\u0435 \u0412\u0430\u0448, \u0425\u0430\u0444\u0438\u0437\u0443\u043B\u043B\u0430 \u0410\u043C\u0438\u043D. \u041E\u0442\u0434\u0435\u043B \u0437\u043B\u043E\u0443\u043F\u043E\u0442\u0440\u0435\u0431\u043B\u0435\u043D\u0438\u044F \u043C\u0430\u0433\u0438\u0435\u0439. \u041C\u0438\u043D\u0438\u0441\u0442\u0435\u0440\u0441\u0442\u0432\u043E \u043C\u0430\u0433\u0438\u0438\u00BB.
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041C\u0435\u043C\u043E\u0440\u0438\u0430\u043B\u044C\u043D\u044B\u0439 \u043F\u0430\u0440\u043A \u0412\u043E\u0438\u043D\u0430\u043C-\u0430\u0444\u0433\u0430\u043D\u0446\u0430\u043C.
TASK_CODE_1=F7L7N7
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u0413\u0430\u0440\u0440\u0438 \u043C\u0447\u0430\u043B\u0441\u044F \u043F\u043E \u043A\u043E\u0440\u0438\u0434\u043E\u0440\u0443. \u0420\u043E\u043D \u0441 \u0413\u0435\u0440\u043C\u0438\u043E\u043D\u043E\u0439, \u0442\u044F\u0436\u0435\u043B\u043E \u0434\u044B\u0448\u0430, \u043D\u0435 \u043E\u0442\u0441\u0442\u0430\u0432\u0430\u043B\u0438. \u0413\u0435\u0440\u043C\u0438\u043E\u043D\u0430 \u0432\u0434\u0440\u0443\u0433 \u0432\u0441\u043A\u0440\u0438\u043A\u043D\u0443\u043B\u0430 - \u0432\u043F\u0435\u0440\u0435\u0434\u0438 \u0447\u0442\u043E-\u0442\u043E \u0441\u0438\u044F\u043B\u043E. \u041D\u0430 \u0441\u0442\u0435\u043D\u0435 \u043C\u0435\u0436\u0434\u0443 \u0434\u0432\u0443\u0445 \u043E\u043A\u043E\u043D \u043E\u0433\u0440\u043E\u043C\u043D\u044B\u043C\u0438 \u0431\u0443\u043A\u0432\u0430\u043C\u0438 \u0431\u044B\u043B\u0438 \u043D\u0430\u0447\u0435\u0440\u0442\u0430\u043D\u044B \u0441\u043B\u043E\u0432\u0430: "Sssseytha Ssseyaa Ssaah Hasseey Esseytha sheaaya Ethaa Haa"\n\u2014 \u0410 \u044D\u0442\u043E \u0447\u0442\u043E \u0442\u0430\u043A\u043E\u0435\u2026 \u0447\u0442\u043E \u044D\u0442\u043E \u0432\u0438\u0441\u0438\u0442 \u043F\u043E\u0434 \u043D\u0430\u0434\u043F\u0438\u0441\u044C\u044E? \u2014 \u0441\u043F\u0440\u043E\u0441\u0438\u043B \u0420\u043E\u043D \u0434\u0440\u043E\u0433\u043D\u0443\u0432\u0448\u0438\u043C \u0433\u043E\u043B\u043E\u0441\u043E\u043C.\n\u041E\u043F\u0430\u0441\u043B\u0438\u0432\u043E \u043F\u043E\u0434\u043E\u0448\u043B\u0438 \u0431\u043B\u0438\u0436\u0435. \u0413\u0430\u0440\u0440\u0438 \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u0437\u043D\u0443\u043B\u0441\u044F - \u043D\u0430 \u043F\u043E\u043B \u043E\u0442\u043A\u0443\u0434\u0430-\u0442\u043E \u043D\u0430\u0442\u0435\u043A\u043B\u0430 \u0431\u043E\u043B\u044C\u0448\u0430\u044F \u043B\u0443\u0436\u0430 \u0432\u043E\u0434\u044B. \u0420\u043E\u043D \u0438 \u0413\u0435\u0440\u043C\u0438\u043E\u043D\u0430 \u043F\u043E\u0434\u0445\u0432\u0430\u0442\u0438\u043B\u0438 \u0435\u0433\u043E, \u043D\u0435 \u0434\u0430\u0432 \u0443\u043F\u0430\u0441\u0442\u044C. \u0412\u0437\u0433\u043B\u044F\u043D\u0443\u043B\u0438 \u043D\u0430 \u0432\u0438\u0441\u0435\u0432\u0448\u0438\u0439 \u043F\u043E\u0434 \u0437\u043B\u043E\u0432\u0435\u0449\u0438\u043C\u0438 \u0441\u043B\u043E\u0432\u0430\u043C\u0438 \u043F\u0440\u0435\u0434\u043C\u0435\u0442 \u041F\u0430\u0440\u0441\u0435\u043B, \u043C\u0435\u0436\u0434\u0443 \u0410\u0442\u043B\u043E\u043D\u043E\u043C \u0438 \u0411\u0430\u043B\u043B\u0438\u043C\u0430\u0445\u043E\u043D\u043E\u043C, \u0438 \u043E\u0431\u043E\u043C\u043B\u0435\u043B\u0438 - \u044D\u0442\u043E \u0431\u044B\u043B\u0430 \u041C\u0438\u0441\u0441\u0438\u0441 \u041D\u043E\u0440\u0440\u0438\u0441, \u043A\u043E\u0448\u043A\u0430 \u0448\u043A\u043E\u043B\u044C\u043D\u043E\u0433\u043E \u0437\u0430\u0432\u0445\u043E\u0437\u0430, \u043E\u043D\u0438 \u0441\u0440\u0430\u0437\u0443 \u0443\u0437\u043D\u0430\u043B\u0438 \u0435\u0435. \u0412\u0441\u0435 \u0442\u0440\u043E\u0435 \u043C\u0435\u0442\u043D\u0443\u043B\u0438\u0441\u044C \u043D\u0430\u0437\u0430\u0434, \u0440\u0430\u0437\u0431\u0440\u044B\u0437\u0433\u0438\u0432\u0430\u044F \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E \u043E\u0442\u043A\u0443\u0434\u0430 \u0432\u0437\u044F\u0432\u0448\u0443\u044E\u0441\u044F \u0432\u043E\u0434\u0443.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u2014 \u0422\u0430\u043A \u0442\u044B, \u0437\u043D\u0430\u0447\u0438\u0442, \u0437\u043C\u0435\u0435\u0443\u0441\u0442, \u2014 \u0441\u043A\u0430\u0437\u0430\u043B \u0420\u043E\u043D.\n\u2014 \u041A\u0442\u043E-\u043A\u0442\u043E? \u2014 \u043D\u0435 \u043F\u043E\u043D\u044F\u043B \u0413\u0430\u0440\u0440\u0438.\n\u2014 \u0417\u043C\u0435\u0435\u0443\u0441\u0442. \u041F\u0430\u0440\u0441\u0435\u043B\u0442\u0430\u043D\u0433. \u0422\u043E \u0435\u0441\u0442\u044C \u0443\u043C\u0435\u0435\u0448\u044C \u0433\u043E\u0432\u043E\u0440\u0438\u0442\u044C \u0441\u043E \u0437\u043C\u0435\u044F\u043C\u0438. \u041F\u043E\u0447\u0435\u043C\u0443 \u0442\u044B \u043D\u0430\u043C \u044D\u0442\u043E\u0433\u043E \u043D\u0435 \u0441\u043A\u0430\u0437\u0430\u043B?\n\u2014 \u042F \u0433\u043E\u0432\u043E\u0440\u0438\u043B \u0441 \u043D\u0438\u043C\u0438 \u0432\u0441\u0435\u0433\u043E \u0434\u0432\u0430 \u0440\u0430\u0437\u0430. \u041F\u0435\u0440\u0432\u044B\u0439 \u0440\u0430\u0437 \u0432 \u0437\u043E\u043E\u043F\u0430\u0440\u043A\u0435. \u041D\u0430\u043F\u0443\u0441\u0442\u0438\u043B \u0443\u0434\u0430\u0432\u0430 \u043D\u0430 \u0414\u0430\u0434\u043B\u0438. \u0423\u0434\u0430\u0432 \u043C\u043D\u0435 \u0441\u043A\u0430\u0437\u0430\u043B, \u0447\u0442\u043E \u043D\u0438\u043A\u043E\u0433\u0434\u0430 \u043D\u0435 \u0431\u044B\u043B \u0432 \u0440\u043E\u0434\u043D\u043E\u0439 \u0411\u0440\u0430\u0437\u0438\u043B\u0438\u0438. \u0418 \u044F, \u043D\u0435\u043F\u043E\u043D\u044F\u0442\u043D\u043E \u043A\u0430\u043A, \u0432\u044B\u043F\u0443\u0441\u0442\u0438\u043B \u0435\u0433\u043E \u043D\u0430 \u0432\u043E\u043B\u044E. \u042F \u0442\u043E\u0433\u0434\u0430 \u0435\u0449\u0435 \u043D\u0435 \u0437\u043D\u0430\u043B, \u0447\u0442\u043E \u044F \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u0438\u043A.\n\u2014 \u0423\u0434\u0430\u0432 \u0442\u0435\u0431\u0435 \u0441\u043A\u0430\u0437\u0430\u043B, \u0447\u0442\u043E \u043D\u0438\u043A\u043E\u0433\u0434\u0430 \u043D\u0435 \u0431\u044B\u043B \u0432 \u0411\u0440\u0430\u0437\u0438\u043B\u0438\u0438? \u2014 \u0432\u044B\u0442\u0430\u0440\u0430\u0449\u0438\u043B \u0433\u043B\u0430\u0437\u0430 \u0420\u043E\u043D. \u2014 \u0418 \u0442\u044B \u0435\u0433\u043E \u043F\u043E\u043D\u044F\u043B?\n\u2014 \u0410 \u0447\u0442\u043E \u0442\u0443\u0442 \u0442\u0430\u043A\u043E\u0433\u043E? \u041A\u0430\u0436\u0434\u044B\u0439 \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u0438\u043A \u043F\u043E\u043D\u044F\u043B \u0431\u044B.\n\u2014 \u041D\u0438\u0447\u0435\u0433\u043E \u043D\u0435 \u043A\u0430\u0436\u0434\u044B\u0439. \u041F\u043E\u043D\u0438\u043C\u0430\u0442\u044C \u0437\u043C\u0435\u0439 - \u043E\u0447\u0435\u043D\u044C \u043F\u043B\u043E\u0445\u043E.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421.\u0442. \u0414\u0440\u0443\u0436\u0431\u0430
TASK_CODE_2=F9LN31
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u041B\u043E\u043A\u043E\u043D\u0441 \u0432\u0437\u043C\u0430\u0445\u043D\u0443\u043B \u0440\u0443\u043A\u043E\u0439, \u0442\u0440\u0435\u0431\u0443\u044F \u0442\u0438\u0448\u0438\u043D\u044B.\n\u2014 \u041F\u043E\u0434\u043E\u0439\u0434\u0438\u0442\u0435 \u043F\u043E\u0431\u043B\u0438\u0436\u0435! \u041F\u0440\u043E\u0444\u0435\u0441\u0441\u043E\u0440 \u0414\u0430\u043C\u0431\u043B\u0434\u043E\u0440 \u043E\u0434\u043E\u0431\u0440\u0438\u043B \u043C\u043E\u0435 \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0432 \u0448\u043A\u043E\u043B\u0435 \u0414\u0443\u044D\u043B\u044C\u043D\u044B\u0439 \u043A\u043B\u0443\u0431. \u041F\u043E\u0441\u0435\u0449\u0430\u044F \u043A\u043B\u0443\u0431, \u0432\u044B \u043D\u0430\u0443\u0447\u0438\u0442\u0435\u0441\u044C \u0437\u0430\u0449\u0438\u0449\u0430\u0442\u044C \u0441\u0435\u0431\u044F. \u041E\u0431\u043C\u0435\u043D\u044F\u0439\u0442\u0435\u0441\u044C \u043F\u0440\u0438\u0432\u0435\u0442\u0441\u0442\u0432\u0438\u044F\u043C\u0438! \u2014 \u0441\u043A\u043E\u043C\u0430\u043D\u0434\u043E\u0432\u0430\u043B \u0441 \u043F\u043E\u0434\u043C\u043E\u0441\u0442\u043A\u043E\u0432 \u041B\u043E\u043A\u043E\u043D\u0441.\n\u0413\u0430\u0440\u0440\u0438 \u0438 \u041C\u0430\u043B\u0444\u043E\u0439, \u043D\u0435 \u0441\u0432\u043E\u0434\u044F \u0434\u0440\u0443\u0433 \u0441 \u0434\u0440\u0443\u0433\u0430 \u0433\u043B\u0430\u0437, \u043A\u0438\u0432\u043D\u0443\u043B\u0438.\n\u2014 \u041F\u0430\u043B\u043E\u0447\u043A\u0438 \u043D\u0430 \u0438\u0437\u0433\u043E\u0442\u043E\u0432\u043A\u0443! \u041D\u0430 \u0441\u0447\u0435\u0442 \u00AB\u0442\u0440\u0438\u00BB \u043F\u043E\u043F\u044B\u0442\u0430\u0439\u0442\u0435\u0441\u044C \u0440\u0430\u0437\u043E\u0440\u0443\u0436\u0438\u0442\u044C \u043F\u0440\u043E\u0442\u0438\u0432\u043D\u0438\u043A\u0430. \u0422\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0437\u043E\u0440\u0443\u0436\u0438\u0442\u044C, \u043D\u0438\u043A\u0430\u043A\u043E\u0433\u043E \u043D\u0430\u0441\u0438\u043B\u0438\u044F. \u0420\u0430\u0437\u2026 \u0434\u0432\u0430\u2026 \u0442\u0440\u0438!\n\u0413\u0430\u0440\u0440\u0438 \u0437\u0430\u043D\u0435\u0441 \u043F\u0430\u043B\u043E\u0447\u043A\u0443, \u043D\u043E \u041C\u0430\u043B\u0444\u043E\u0439 \u043E\u043F\u0435\u0440\u0435\u0434\u0438\u043B \u0435\u0433\u043E, \u043D\u0430\u0447\u0430\u0432 \u0431\u043E\u0439 \u043D\u0430 \u0441\u0447\u0435\u0442 \u00AB\u0434\u0432\u0430\u00BB. \u0413\u0430\u0440\u0440\u0438 \u043E\u0442\u043B\u0435\u0442\u0435\u043B \u043A \u0441\u0442\u0435\u043D\u0435. \u041E\u043D \u043F\u043E\u0448\u0430\u0442\u043D\u0443\u043B\u0441\u044F, \u043D\u043E \u0443\u0441\u0442\u043E\u044F\u043B \u043D\u0430 \u043D\u043E\u0433\u0430\u0445 \u0438, \u043D\u0430\u043F\u0440\u0430\u0432\u0438\u0432 \u043F\u0430\u043B\u043E\u0447\u043A\u0443 \u043D\u0430 \u041C\u0430\u043B\u0444\u043E\u044F, \u043A\u0440\u0438\u043A\u043D\u0443\u043B:\n\u2014 \u0420\u0435\u043A\u0442\u0443\u0441\u0435\u043C\u043F\u0440\u0430! \u041B\u0443\u0447 \u0441\u0432\u0435\u0442\u0430 \u043F\u043E\u0440\u0430\u0437\u0438\u043B \u041C\u0430\u043B\u0444\u043E\u044F \u0432 \u0436\u0438\u0432\u043E\u0442, \u043E\u043D \u0433\u0440\u043E\u043C\u043A\u043E \u0438\u043A\u043D\u0443\u043B \u0438 \u0441\u043A\u0440\u044E\u0447\u0438\u043B\u0441\u044F.\n\u2014 \u042F \u0441\u043A\u0430\u0437\u0430\u043B, \u043D\u0438\u043A\u0430\u043A\u043E\u0433\u043E \u043D\u0430\u0441\u0438\u043B\u0438\u044F! \u2014 \u0438\u0441\u043F\u0443\u0433\u0430\u043D\u043D\u043E \u0437\u0430\u0432\u043E\u043F\u0438\u043B \u041B\u043E\u043A\u043E\u043D\u0441, \u0443\u0432\u0438\u0434\u0435\u0432 \u043F\u043E\u0432\u0435\u0440\u0445 \u0433\u043E\u043B\u043E\u0432, \u043A\u0430\u043A \u041C\u0430\u043B\u0444\u043E\u0439 \u043E\u0441\u0435\u043B \u043D\u0430 \u043F\u043E\u043B. (\u041D\u0430\u0439\u0434\u0438\u0442\u0435 \u0430\u0433\u0435\u043D\u0442\u0430 \u0438 \u0440\u0430\u0437\u043E\u0440\u0443\u0436\u0438\u0442\u0435 \u0435\u0433\u043E \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043C\u0430\u0433\u0438\u0438 :))\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0423\u0440\u043E\u043A\u0438 \u0437\u0435\u043B\u044C\u0435\u0432\u0430\u0440\u0435\u043D\u0438\u044F \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u043B\u0438 \u043D\u0430 \u0431\u043E\u043B\u044C\u0448\u043E\u043C \u0441\u0442\u0430\u0434\u0438\u043E\u043D\u0435. \u0421\u0435\u0433\u043E\u0434\u043D\u044F\u0448\u043D\u0438\u0439 \u043D\u0438\u0447\u0435\u043C \u043D\u0435 \u043E\u0442\u043B\u0438\u0447\u0430\u043B\u0441\u044F \u043E\u0442 \u043F\u0440\u0435\u0434\u044B\u0434\u0443\u0449\u0438\u0445. \u0421\u043D\u044D\u0433\u0433 \u0434\u0430\u043B \u0437\u0430\u0434\u0430\u043D\u0438\u0435 \u043F\u0440\u0438\u0433\u043E\u0442\u043E\u0432\u0438\u0442\u044C \u0428\u043C\u0443\u043B\u0435\u0432\u043E\u0439 \u0440\u0430\u0441\u0442\u0432\u043E\u0440. \u041D\u0430 \u0441\u0442\u043E\u043B\u0430\u0445 \u043F\u043E\u0431\u043B\u0435\u0441\u043A\u0438\u0432\u0430\u044E\u0442 \u043B\u0430\u0442\u0443\u043D\u043D\u044B\u0435 \u0432\u0435\u0441\u044B \u0438 \u0431\u0430\u043D\u043A\u0438 \u0441\u043E \u0432\u0441\u044F\u043A\u043E\u0439 \u0433\u0430\u0434\u043E\u0441\u0442\u044C\u044E, \u043C\u0435\u0436\u0434\u0443 \u0441\u0442\u043E\u043B\u0430\u043C\u0438 \u043F\u0430\u0440\u044F\u0442 \u043A\u043E\u0442\u043B\u044B-\u0441\u0430\u043C\u043E\u0432\u0430\u0440\u043A\u0438. \u0421\u043D\u044D\u0433\u0433 \u0440\u044B\u0449\u0435\u0442 \u043F\u043E \u043A\u043B\u0430\u0441\u0441\u0443, \u043E\u0442\u043F\u0443\u0441\u043A\u0430\u044F \u043A\u043E\u043B\u043A\u0438\u0435 \u0437\u0430\u043C\u0435\u0447\u0430\u043D\u0438\u044F \u0432 \u0430\u0434\u0440\u0435\u0441 \u0433\u0440\u0438\u0444\u0444\u0438\u043D\u0434\u043E\u0440\u0446\u0435\u0432, \u0441\u043B\u0438\u0437\u0435\u0440\u0438\u043D\u0446\u044B \u043E\u0434\u043E\u0431\u0440\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u0445\u0438\u0445\u0438\u043A\u0430\u044E\u0442. \u041B\u044E\u0431\u0438\u043C\u0447\u0438\u043A \u0421\u043D\u044D\u0433\u0433\u0430 \u0414\u0440\u0430\u043A\u043E \u041C\u0430\u043B\u0444\u043E\u0439 \u0438\u0441\u043F\u043E\u0434\u0442\u0438\u0448\u043A\u0430 \u0448\u0432\u044B\u0440\u044F\u0435\u0442\u0441\u044F \u0432 \u0413\u0430\u0440\u0440\u0438 \u0438 \u0420\u043E\u043D\u0430 \u0441\u0443\u0448\u0435\u043D\u044B\u043C\u0438 \u0440\u044B\u0431\u044C\u0438\u043C\u0438 \u0433\u043B\u0430\u0437\u0430\u043C\u0438, \u0430 \u0420\u043E\u043D \u0441 \u0413\u0430\u0440\u0440\u0438 \u0437\u043D\u0430\u044E\u0442: \u0435\u0441\u043B\u0438 \u043E\u043D\u0438 \u043E\u0442\u0432\u0435\u0442\u044F\u0442 \u0442\u0435\u043C \u0436\u0435, \u043D\u0430\u043A\u0430\u0437\u0430\u043D\u0438\u0435 \u0438\u043C \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D\u043E. \u0413\u0430\u0440\u0440\u0438 \u043D\u0430\u043F\u0435\u0432\u0430\u043B \u043F\u0435\u0441\u0435\u043D\u043A\u0443: \u00AB\u0428\u0443\u0442\u0438 \u0438 \u043F\u043E\u0439, \u0447\u0442\u043E\u0431 \u0443\u043B\u044B\u0431\u043A\u0438 \u0446\u0432\u0435\u043B\u0438. \u041C\u044B \u043F\u043E\u043A\u043E\u0440\u044F\u0435\u043C \u043F\u0440\u043E\u0441\u0442\u0440\u0430\u043D\u0441\u0442\u0432\u043E \u0438 \u0432\u0440\u0435\u043C\u044F, \u041C\u044B \u043C\u043E\u043B\u043E\u0434\u044B\u0435 \u0445\u043E\u0437\u044F\u0435\u0432\u0430 \u0437\u0435\u043C\u043B\u0438\u00BB. \u041D\u043E \u043D\u0438\u043A\u0430\u043A \u043D\u0435 \u043C\u043E\u0433 \u0432\u0441\u043F\u043E\u043C\u043D\u0438\u0442\u044C \u043F\u0435\u0440\u0432\u0443\u044E \u0441\u0442\u0440\u043E\u0447\u043A\u0443.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u043E\u043C\u0441\u043E\u043C\u043E\u043B\u044C\u0441\u043A\u0438\u0439 \u043F\u0430\u0440\u043A.
TASK_CODE_3=F7L2N7
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0414\u0440\u0443\u0437\u044C\u044F \u0432 \u0441\u043E\u043F\u0440\u043E\u0432\u043E\u0436\u0434\u0435\u043D\u0438\u0438 \u041A\u043B\u044B\u043A\u0430 \u0432\u0441\u0442\u0443\u043F\u0438\u043B\u0438 \u0432 \u043B\u0435\u0441. \u041F\u0440\u0438 \u0441\u0432\u0435\u0442\u0435 \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u043E\u0439 \u043F\u0430\u043B\u043E\u0447\u043A\u0438 \u043D\u0435 \u0441\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u043B\u043E \u0442\u0440\u0443\u0434\u0430 \u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u044C \u0437\u0430 \u0446\u0435\u043F\u043E\u0447\u043A\u043E\u0439 \u043F\u0430\u0443\u043A\u043E\u0432, \u0431\u0435\u0433\u0443\u0449\u0438\u0445 \u043F\u043E \u0442\u0440\u043E\u043F\u0435 \u0432 \u0433\u043B\u0443\u0431\u044C \u043B\u0435\u0441\u0430. \u041C\u043E\u0436\u0435\u0442 \u041E\u0440\u0438\u043E\u043D \u0431\u043B\u044D\u043A \u0432\u0435\u043B \u0441\u0432\u043E\u0435\u0433\u043E \u0441\u044B\u043D\u0430 \u0421\u0438\u0440\u0438\u0443\u0441\u0430. \u0412\u043E\u043A\u0440\u0443\u0433 \u0441\u0438\u0434\u0435\u043B\u0438 \u0441\u043E\u0431\u0440\u0430\u0442\u044C\u044F \u0422\u043E\u0431\u0438\u0430\u0441\u0430, \u0436\u0430\u0431\u044B, \u0447\u0442\u043E \u043F\u043E\u0434\u0430\u0440\u0438\u043B\u0438 \u043E\u0434\u043D\u043E\u043C\u0443 \u0438\u0437 \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u043E\u0432 \u043F\u0435\u0440\u0435\u0434 \u043F\u043E\u0441\u0442\u0443\u043F\u043B\u0435\u043D\u0438\u0435\u043C. \u0422\u0430\u043A \u043E\u043D\u0438 \u0448\u043B\u0438 \u043C\u0438\u043D\u0443\u0442 \u0432\u043E\u0441\u0435\u043C\u044C, \u043D\u0435 \u0433\u043E\u0432\u043E\u0440\u044F \u043D\u0438 \u0441\u043B\u043E\u0432\u0430 \u0438 \u043F\u0440\u0438\u0441\u043B\u0443\u0448\u0438\u0432\u0430\u044F\u0441\u044C \u043A \u0437\u0432\u0443\u043A\u0430\u043C, \u043E\u0442\u043B\u0438\u0447\u0430\u044E\u0449\u0438\u043C\u0441\u044F \u043E\u0442 \u0448\u0435\u043B\u0435\u0441\u0442\u0430 \u043B\u0438\u0441\u0442\u044C\u0435\u0432 \u0438 \u0445\u0440\u0443\u0441\u0442\u0430 \u043F\u043E\u0434 \u043D\u043E\u0433\u0430\u043C\u0438. \u0414\u0440\u0443\u0437\u044C\u044F \u0437\u0430\u043C\u0435\u0442\u0438\u043B\u0438, \u0447\u0442\u043E \u0438\u0445 \u0432\u043E\u0441\u044C\u043C\u0438\u043D\u043E\u0433\u0438\u0435 \u043F\u0440\u043E\u0432\u043E\u0434\u043D\u0438\u043A\u0438 \u0441\u0432\u043E\u0440\u0430\u0447\u0438\u0432\u0430\u044E\u0442 \u0441 \u0442\u0440\u043E\u043F\u044B. \u041E\u043D\u0438 \u043F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u043B\u0438 \u0437\u0430 \u043C\u0435\u0447\u0443\u0449\u0438\u043C\u0438\u0441\u044F \u0442\u0435\u043D\u044F\u043C\u0438 \u043F\u0430\u0443\u043A\u043E\u0432, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0448\u043B\u0438 \u0442\u0435\u043F\u0435\u0440\u044C, \u043F\u0435\u0442\u043B\u044F\u044F \u043C\u0435\u0436\u0434\u0443 \u0434\u0435\u0440\u0435\u0432\u044C\u044F\u043C\u0438. \u0423\u0432\u0438\u0434\u044C \u0438\u0445, \u0410\u043B\u044C\u0431\u0443\u0441 \u0431\u044B \u0431\u044B\u043B \u043E\u0447\u0435\u043D\u044C \u0437\u043E\u043B. \u0418\u0434\u0442\u0438 \u0431\u044B\u043B\u043E \u0442\u0440\u0443\u0434\u043D\u043E \u2014 \u043F\u043E\u0434 \u043D\u043E\u0433\u0438 \u043F\u043E\u043F\u0430\u0434\u0430\u043B\u0438\u0441\u044C \u043F\u043D\u0438 \u0438 \u043A\u043E\u0440\u043D\u0438, \u043F\u043E\u0447\u0442\u0438 \u043D\u0435 \u0432\u0438\u0434\u043D\u044B\u0435 \u0432 \u0442\u0435\u043C\u043D\u043E\u0442\u0435. \u041D\u043E \u0440\u0443\u043A\u0430 \u0413\u0430\u0440\u0440\u0438 \u0447\u0443\u0432\u0441\u0442\u0432\u043E\u0432\u0430\u043B\u0430 \u043E\u0431\u043E\u0434\u0440\u044F\u044E\u0449\u0435\u0435 \u0433\u043E\u0440\u044F\u0447\u0435\u0435 \u0434\u044B\u0445\u0430\u043D\u0438\u0435 \u043F\u0441\u0430. \u041F\u0440\u0438\u0445\u043E\u0434\u0438\u043B\u043E\u0441\u044C \u043D\u0435 \u0440\u0430\u0437 \u043E\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u0442\u044C\u0441\u044F, \u0447\u0442\u043E\u0431\u044B \u043E\u0442\u0434\u043E\u0445\u043D\u0443\u0442\u044C \u0438 \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C \u0437\u0434\u043E\u0440\u043E\u0432\u044C\u0435.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,3
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041F\u0430\u0443\u043A\u0438! \u041D\u043E \u043D\u0435 \u0442\u0435 \u043C\u0430\u043B\u044E\u0442\u043A\u0438, \u0447\u0442\u043E \u043D\u0435\u043F\u0440\u0435\u0440\u044B\u0432\u043D\u044B\u043C \u043F\u043E\u0442\u043E\u043A\u043E\u043C \u0441\u0431\u0435\u0433\u0430\u043B\u0438\u0441\u044C, \u0447\u0442\u043E\u0431 \u0432\u043E\u0441\u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u044C \u0437\u0434\u043E\u0440\u043E\u0432\u044C\u0435. \u041F\u0430\u0443\u043A\u0438 - \u0440\u0430\u0437\u043C\u0435\u0440\u043E\u043C \u0441 \u0434\u043E\u043C \u043E\u0442\u0434\u044B\u0445\u0430, \u0432\u043E\u0441\u0435\u043C\u0438\u0433\u043B\u0430\u0437\u044B\u0435, \u0447\u0435\u0440\u043D\u044B\u0435, \u043C\u043E\u0445\u043D\u0430\u0442\u044B\u0435, \u0433\u0438\u0433\u0430\u043D\u0442\u0441\u043A\u0438\u0435! \u0413\u0440\u043E\u043C\u0438\u043B\u0430, \u0447\u0442\u043E \u043D\u0435\u0441 \u0413\u0430\u0440\u0440\u0438, \u0441\u043F\u0443\u0441\u0442\u0438\u043B\u0441\u044F \u0432\u043D\u0438\u0437 \u043F\u043E \u0432\u043B\u0430\u0436\u043D\u043E\u043C\u0443 \u043E\u0442 \u0440\u043E\u0441\u044B \u0441\u043A\u043B\u043E\u043D\u0443 \u0438 \u0437\u0430\u0448\u0430\u0433\u0430\u043B \u043A \u043F\u0440\u0438\u0437\u0440\u0430\u0447\u043D\u043E-\u0441\u0435\u0440\u0435\u0431\u0440\u0438\u0441\u0442\u043E\u043C\u0443 \u043A\u0443\u043F\u043E\u043B\u0443, \u0441\u043F\u043B\u0435\u0442\u0435\u043D\u043D\u043E\u043C\u0443 \u0438\u0437 \u043F\u0430\u0443\u0442\u0438\u043D\u044B \u0432 \u0441\u0430\u043C\u043E\u043C \u0446\u0435\u043D\u0442\u0440\u0435. \u0415\u0433\u043E \u0441\u043E\u043F\u0440\u043E\u0432\u043E\u0436\u0434\u0430\u043B\u0438 \u043C\u043E\u0445\u043D\u043E\u043D\u043E\u0433\u0438\u0435 \u0441\u043E\u0440\u043E\u0434\u0438\u0447\u0438, \u0432\u043E\u0437\u0431\u0443\u0436\u0434\u0435\u043D\u043D\u043E \u0449\u0435\u043B\u043A\u0430\u044F \u0436\u0432\u0430\u043B\u0430\u043C\u0438 \u043F\u0440\u0438 \u0432\u0438\u0434\u0435 \u0434\u043E\u0431\u044B\u0447\u0438. \u041F\u0430\u0443\u043A \u0432\u044B\u043F\u0443\u0441\u0442\u0438\u043B \u0413\u0430\u0440\u0440\u0438, \u0438 \u0442\u043E\u0442 \u043F\u043B\u044E\u0445\u043D\u0443\u043B\u0441\u044F \u043D\u0430 \u0437\u0435\u043C\u043B\u044E \u043D\u0430 \u0447\u0435\u0442\u0432\u0435\u0440\u0435\u043D\u044C\u043A\u0438. \u0420\u043E\u043D \u0432\u044B\u0433\u043B\u044F\u0434\u0435\u043B \u0442\u043E\u0447\u043D\u043E \u0442\u0430\u043A \u0436\u0435, \u043A\u0430\u043A \u0413\u0430\u0440\u0440\u0438 - \u0440\u043E\u0442 \u0440\u0430\u0437\u0438\u043D\u0443\u0442 \u0432 \u043D\u0435\u043C\u043E\u043C \u043A\u0440\u0438\u043A\u0435, \u0433\u043B\u0430\u0437\u0430 \u0432\u044B\u043B\u0435\u0437\u043B\u0438 \u0438\u0437 \u043E\u0440\u0431\u0438\u0442. \u041F\u043E\u0441\u043B\u0435 \u0442\u0430\u043A\u043E\u0439 \u043F\u0440\u043E\u0433\u0443\u043B\u043A\u0438 \u043D\u0430\u0434\u043E \u0431\u044B \u0432 \u0441\u0430\u043D\u0430\u0442\u043E\u0440\u0438\u0439.
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u043F\u0440.\u041A\u043E\u0441\u0442\u0430 8, \u0437\u0430\u0431\u0440\u043E\u0448\u0435\u043D\u043D\u044B\u0439 \u0441\u0430\u043D\u0430\u0442\u043E\u0440\u0438\u0439.
TASK_CODE_4=F41L5N
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n\u042D\u0442\u043E \u0431\u044B\u043B\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430, \u0432\u044B\u0440\u0432\u0430\u043D\u043D\u0430\u044F \u0438\u0437 \u043A\u0430\u043A\u043E\u0439-\u0442\u043E \u043E\u0447\u0435\u043D\u044C \u0441\u0442\u0430\u0440\u043E\u0439 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u0447\u043D\u043E\u0439 \u043A\u043D\u0438\u0433\u0438. \u00AB\u2026\u0438\u0437 \u043C\u043D\u043E\u0433\u0438\u0445 \u0447\u0443\u0434\u0438\u0449, \u043A\u043E\u0438\u0445 \u0432 \u043D\u0430\u0448\u0438\u0445 \u0432\u043E\u0434\u0430\u0445 \u0438 \u0437\u0435\u043C\u043B\u044F\u0445 \u0432\u0441\u0442\u0440\u0435\u0442\u0438\u0442\u044C \u043C\u043E\u0436\u043D\u043E, \u043D\u0435 \u0441\u044B\u0441\u043A\u0430\u0442\u044C \u0441\u043C\u0435\u0440\u0442\u043E\u043D\u043E\u0441\u043D\u0435\u0439 \u0412\u0430\u0441\u0438\u043B\u0438\u0441\u043A\u0430, \u0442\u0430\u043A\u0436\u0435 \u0435\u0449\u0435 \u0438\u043C\u0435\u043D\u0443\u0435\u043C\u043E\u0433\u043E \u041A\u043E\u0440\u043E\u043B\u044C \u0417\u043C\u0435\u0439. \u0421\u0435\u0439 \u0433\u0430\u0434 \u043C\u043E\u0436\u0435\u0442 \u0434\u043E\u0441\u0442\u0438\u0433\u0430\u0442\u044C \u0440\u0430\u0437\u043C\u0435\u0440\u043E\u0432 \u0432\u043E\u0438\u0441\u0442\u0438\u043D\u0443 \u0433\u0438\u0433\u0430\u043D\u0442\u0441\u043A\u0438\u0445, \u0430 \u0441\u0440\u043E\u043A \u0436\u0438\u0437\u043D\u0438 \u0435\u0433\u043E \u2014 \u043C\u043D\u043E\u0433\u0438\u0435 \u0441\u0442\u043E\u043B\u0435\u0442\u0438\u044F. \u0421\u043C\u0435\u0440\u0442\u044C \u0436\u0435 \u043D\u0435\u0441\u0435\u0442 \u043F\u0443\u0442\u0435\u043C \u0434\u0438\u043A\u043E\u0432\u0438\u043D\u043D\u044B\u043C - \u0434\u0430\u0440\u0435\u043D \u0435\u043C\u0443 \u0432\u0437\u0433\u043B\u044F\u0434 \u0443\u0431\u0438\u0439\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0439, \u0442\u0430\u043A \u0447\u0442\u043E \u0435\u0436\u0435\u043B\u0438 \u043A\u0442\u043E \u0441 \u043D\u0438\u043C \u043E\u0447\u0430\u043C\u0438 \u0432\u0441\u0442\u0440\u0435\u0442\u0438\u0442\u0441\u044F, \u0442\u043E\u0442\u0447\u0430\u0441 \u043F\u0440\u0438\u043C\u0435\u0442 \u043A\u043E\u043D\u0447\u0438\u043D\u0443 \u0441\u043A\u043E\u0440\u0443\u044E \u0438 \u0432 \u043C\u0443\u043A\u0430\u0445 \u0432\u0435\u043B\u0438\u043A\u0438\u0445. \u0421\u0430\u043C \u043E\u043D\u044B\u0439 \u0412\u0430\u0441\u0438\u043B\u0438\u0441\u043A \u0441\u0442\u0440\u0430\u0448\u0438\u0442\u0441\u044F \u043B\u0438\u0448\u044C \u043F\u0435\u043D\u0438\u044F \u043F\u0442\u0438\u0447\u044C\u0435\u0433\u043E, \u0440\u043E\u0436\u0434\u0435\u043D\u043D\u043E\u0433\u043E \u0432 \u043E\u0433\u043D\u0435, \u0438\u0431\u043E \u0433\u0438\u0431\u0435\u043B\u044C\u043D\u043E \u043E\u043D\u043E \u0434\u043B\u044F \u043D\u0435\u0433\u043E\u2026\u00BB\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0412\u0435\u043B\u0438\u043A\u043E\u043B\u0435\u043F\u043D\u0430\u044F \u0430\u043B\u0430\u044F \u043F\u0442\u0438\u0446\u0430 \u0432\u0435\u043B\u0438\u0447\u0438\u043D\u043E\u0439 \u0441 \u043B\u0435\u0431\u0435\u0434\u044F, \u0441 \u0434\u043B\u0438\u043D\u043D\u044B\u043C \u0437\u043E\u043B\u043E\u0442\u044B\u043C \u0445\u0432\u043E\u0441\u0442\u043E\u043C, \u0437\u043E\u043B\u043E\u0442\u044B\u043C\u0438 \u043A\u043E\u0433\u0442\u044F\u043C\u0438 \u0438 \u043A\u043B\u044E\u0432\u043E\u043C. \u041E\u0431\u0438\u0442\u0430\u0435\u0442 \u0432 \u043F\u0440\u0438\u0431\u0440\u0435\u0436\u043D\u044B\u0445 \u0440\u0430\u0439\u043E\u043D\u0430\u0445. \u0424\u0435\u043D\u0438\u043A\u0441 \u0436\u0438\u0432\u0435\u0442 \u043D\u0435\u0432\u0435\u0440\u043E\u044F\u0442\u043D\u043E \u0434\u043E\u043B\u0433\u043E, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0441\u043F\u043E\u0441\u043E\u0431\u0435\u043D \u0440\u0435\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C. \u041A\u043E\u0433\u0434\u0430 \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u043C \u0441\u043E\u0432\u0441\u0435\u043C \u043E\u0434\u0440\u044F\u0445\u043B\u0435\u0435\u0442, \u043F\u0442\u0438\u0446\u0430 \u0432\u0441\u043F\u044B\u0445\u0438\u0432\u0430\u0435\u0442 \u0438 \u0441\u0433\u043E\u0440\u0430\u0435\u0442, \u043F\u043E\u0441\u043B\u0435 \u0447\u0435\u0433\u043E \u0432\u043E\u0437\u0440\u043E\u0436\u0434\u0430\u0435\u0442\u0441\u044F \u0438\u0437 \u043F\u0435\u043F\u043B\u0430 \u0432 \u0432\u0438\u0434\u0435 \u043F\u0442\u0435\u043D\u0446\u0430. \u041D\u0440\u0430\u0432 \u0443 \u043D\u0435\u0435 \u043E\u0447\u0435\u043D\u044C \u043A\u0440\u043E\u0442\u043A\u0438\u0439. \u041E\u0433\u043D\u0435\u043D\u043D\u0430\u044F \u043F\u0442\u0438\u0446\u0430 \u043D\u0438\u043A\u043E\u0433\u0434\u0430 \u043D\u0438\u043A\u043E\u0433\u043E \u043D\u0435 \u0443\u0431\u0438\u0432\u0430\u0435\u0442, \u043F\u0438\u0442\u0430\u0435\u0442\u0441\u044F \u0438\u0441\u043A\u043B\u044E\u0447\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u0442\u0440\u0430\u0432\u0430\u043C\u0438. \u041F\u0435\u043D\u0438\u0435 \u0435\u0435 \u043E\u0431\u043B\u0430\u0434\u0430\u0435\u0442 \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u044B\u043C\u0438 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430\u043C\u0438: \u0441\u0447\u0438\u0442\u0430\u0435\u0442\u0441\u044F, \u0447\u0442\u043E \u043E\u043D\u043E \u043F\u0440\u0438\u0434\u0430\u0435\u0442 \u043C\u0443\u0436\u0435\u0441\u0442\u0432\u0430 \u0447\u0438\u0441\u0442\u044B\u043C \u0434\u0443\u0445\u043E\u043C \u0438 \u043F\u043E\u0432\u0435\u0440\u0433\u0430\u0435\u0442 \u0432 \u0441\u0442\u0440\u0430\u0445 \u043D\u0435\u0434\u043E\u0441\u0442\u043E\u0439\u043D\u044B\u0445. \u0410 \u0441\u043B\u0435\u0437\u044B \u0438\u0441\u0446\u0435\u043B\u044F\u044E\u0442 \u0440\u0430\u043D\u044B.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041D\u043E\u0432\u0430\u044F \u043D\u0430\u0431\u0435\u0440\u0435\u0436\u043D\u0430\u044F, \u0442\u0440\u0443\u0431\u0430 \u043E\u043A\u043E\u043B\u043E \u0446\u0435\u043D\u0442\u0440\u0430\u043B\u044C\u043D\u043E\u0439 \u043B\u0435\u0441\u0442\u043D\u0438\u0446\u044B
TASK_CODE_5=F987LN
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u041C\u0438\u0440\u0442\u043B \u0432\u043E\u0441\u0441\u0435\u0434\u0430\u043B\u0430 \u043D\u0430 \u0431\u0430\u0447\u043A\u0435 \u0432 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0439 \u0431\u0443\u0434\u043A\u0435.\n\u2014 \u041C\u0438\u0440\u0442\u043B, \u043A\u0430\u043A \u0442\u044B \u0443\u043C\u0435\u0440\u043B\u0430? \u2014 \u043E\u0442\u0432\u0435\u0442\u0438\u043B \u0413\u0430\u0440\u0440\u0438.\n\u2014 \u0421\u0430\u043C\u0430 \u043D\u0435 \u0437\u043D\u0430\u044E. \u2014 \u043E\u0442\u0432\u0435\u0442\u0438\u043B\u0430 \u043F\u0440\u0438\u0437\u0440\u0430\u043A. \u2014 \u041F\u043E\u043C\u043D\u044E \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u0432\u0430 \u043E\u0433\u0440\u043E\u043C\u043D\u044B\u0445-\u043F\u0440\u0435\u043E\u0433\u0440\u043E\u043C\u043D\u044B\u0445 \u0436\u0435\u043B\u0442\u044B\u0445 \u0433\u043B\u0430\u0437\u0430. \u0412\u0441\u0435 \u043C\u043E\u0435 \u0442\u0435\u043B\u043E \u0441\u0434\u0430\u0432\u0438\u043B\u043E, \u043A\u0443\u0434\u0430-\u0442\u043E \u043F\u043E\u043D\u0435\u0441\u043B\u043E\u2026 \u2014 \u041E\u043D\u0430 \u0442\u0443\u043C\u0430\u043D\u043D\u043E \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u043B\u0430 \u043D\u0430 \u0413\u0430\u0440\u0440\u0438. \u2014 \u0410 \u043F\u043E\u0442\u043E\u043C\u2026 \u043F\u043E\u0442\u043E\u043C \u044F \u0441\u043D\u043E\u0432\u0430 \u0441\u044E\u0434\u0430 \u0432\u0435\u0440\u043D\u0443\u043B\u0430\u0441\u044C. \u042F \u0440\u0435\u0448\u0438\u043B\u0430 \u043F\u043E\u0441\u0442\u043E\u044F\u043D\u043D\u043E \u044F\u0432\u043B\u044F\u0442\u044C\u0441\u044F \u041E\u043B\u0438\u0432\u0438\u0438 \u0421\u0430\u043F\u0438\u0442. \u041D\u0443, \u0442\u044B \u043F\u043E\u043D\u0438\u043C\u0430\u0435\u0448\u044C\u2026 \u041E\u0445, \u043A\u0430\u043A \u043E\u043D\u0430 \u0436\u0430\u043B\u0435\u043B\u0430, \u0447\u0442\u043E \u0441\u043C\u0435\u044F\u043B\u0430\u0441\u044C \u043D\u0430\u0434 \u043C\u043E\u0438\u043C\u0438 \u043E\u0447\u043A\u0430\u043C\u0438\u2026\n\u0413\u0430\u0440\u0440\u0438 \u043D\u0430 \u0441\u0435\u043A\u0443\u043D\u0434\u0443 \u0437\u0430\u0434\u0443\u043C\u0430\u043B\u0441\u044F: \u2014 \u041F\u043E\u043A\u0430\u0436\u0438 \u0442\u043E\u0447\u043D\u043E, \u0433\u0434\u0435 \u0442\u044B \u0432\u0438\u0434\u0435\u043B\u0430 \u044D\u0442\u0438 \u0433\u043B\u0430\u0437\u0430?\n\u2014 \u0410-\u0430, \u0433\u0434\u0435-\u0442\u043E \u0442\u0430\u043C. \u2014 \u041C\u0438\u0440\u0442\u043B \u043D\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E \u043C\u0430\u0445\u043D\u0443\u043B\u0430 \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u0432\u0435\u0440\u0445\u0443\u0448\u043A\u0438 \u0433\u043E\u0440\u043A\u0438 \u043F\u0435\u0440\u0435\u0434 \u0435\u0435 \u0431\u0443\u0434\u043A\u043E\u0439.\n\u0420\u043E\u043D \u0438 \u0413\u0430\u0440\u0440\u0438 \u0441\u0435\u0439\u0447\u0430\u0441 \u0436\u0435 \u043F\u043E\u0434\u043E\u0448\u043B\u0438 \u043A \u043D\u0435\u043C\u0443.  \u041D\u0430 \u043F\u0435\u0440\u0432\u044B\u0439 \u0432\u0437\u0433\u043B\u044F\u0434 \u044D\u0442\u043E \u0431\u044B\u043B\u0430 \u0441\u0430\u043C\u0430\u044F \u043E\u0431\u044B\u043A\u043D\u043E\u0432\u0435\u043D\u043D\u0430\u044F \u0440\u0430\u043A\u043E\u0432\u0438\u043D\u0430. \u041E\u043D\u0438 \u043E\u0431\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u043B\u0438 \u043A\u0430\u0436\u0434\u044B\u0439 \u0441\u0430\u043D\u0442\u0438\u043C\u0435\u0442\u0440 \u0432\u043D\u0443\u0442\u0440\u0438 \u0438 \u0441\u043D\u0430\u0440\u0443\u0436\u0438, \u0432\u043A\u043B\u044E\u0447\u0430\u044F \u0443\u0445\u043E\u0434\u044F\u0449\u0438\u0435 \u0432 \u043F\u043E\u043B \u0442\u0440\u0443\u0431\u044B. \u0418 \u0413\u0430\u0440\u0440\u0438 \u0437\u0430\u043C\u0435\u0442\u0438\u043B \u2014 \u043D\u0430 \u043E\u0434\u043D\u043E\u043C \u043C\u0435\u0434\u043D\u043E\u043C \u043A\u0440\u0430\u043D\u0435 \u043D\u0430\u0446\u0430\u0440\u0430\u043F\u0430\u043D\u0430 \u043B\u0435\u0441\u043D\u0430\u044F \u0437\u043C\u0435\u0439\u043A\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,3
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n- \u0414\u0430-\u0430, \u043E\u0447\u0435\u043D\u044C, \u043E\u0447\u0435\u043D\u044C \u043B\u0435\u0433\u043A\u043E \u0437\u0430\u0431\u044B\u0442\u044C, \u0447\u0442\u043E \u041C\u0438\u0440\u0442\u043B \u0443\u043C\u0435\u0440\u043B\u0430, \u2014 \u0440\u044B\u0434\u0430\u043B\u0430 \u041F\u043B\u0430\u043A\u0441\u0430 \u041C\u0438\u0440\u0442\u043B. \u2014 \u041F\u0440\u043E \u043C\u0435\u043D\u044F \u043F\u0440\u043E \u0436\u0438\u0432\u0443\u044E \u0432\u0441\u0435 \u0437\u0430\u0431\u044B\u0432\u0430\u043B\u0438. \u0410 \u0443\u0436 \u043A\u043E\u0433\u0434\u0430 \u044F \u0443\u043C\u0435\u0440\u043B\u0430, \u043C\u043E\u0451 \u0442\u0435\u043B\u043E \u0438 \u043D\u0435 \u0438\u0441\u043A\u0430\u043B\u0438. \u042F \u0432\u0441\u0451 \u0437\u043D\u0430\u044E, \u0441\u0438\u0434\u0435\u043B\u0430 \u0442\u0430\u043C \u0438 \u0436\u0434\u0430\u043B\u0430. \u041E\u043B\u0438\u0432\u0438\u044F \u0421\u0430\u043F\u0438\u0442, \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u0432\u0441\u0435 \u043D\u0430\u0437\u044B\u0432\u0430\u043B\u0438 "\u0421\u0430\u043F\u0438\u0442\u0441\u043A", \u0432\u043E\u0448\u043B\u0430 \u0432 \u0442\u0443\u0430\u043B\u0435\u0442 \u0438 \u043A\u0440\u0438\u043A\u043D\u0443\u043B\u0430: \u00AB\u041F\u0435\u0440\u0435\u0441\u0442\u0430\u043D\u044C \u0434\u0443\u0442\u044C\u0441\u044F, \u041C\u0438\u0440\u0442\u043B. \u041F\u0440\u043E\u0444\u0435\u0441\u0441\u043E\u0440 \u0414\u0438\u043F\u043F\u0435\u0442 \u0432\u0435\u043B\u0435\u043B \u0442\u0435\u0431\u044F \u043F\u0440\u0438\u0432\u0435\u0441\u0442\u0438\u2026\u00BB \u2014 \u0438 \u0432\u0434\u0440\u0443\u0433 \u0443\u0432\u0438\u0434\u0435\u043B\u0430 \u043C\u043E\u0451 \u0442\u0435\u043B\u043E. \u0414\u043E \u0441\u0430\u043C\u043E\u0439 \u0441\u043C\u0435\u0440\u0442\u0438 \u043F\u043E\u0442\u043E\u043C \u043F\u043E\u043C\u043D\u0438\u043B\u0430 \u2014 \u0443\u0436 \u044F \u043F\u043E\u0441\u0442\u0430\u0440\u0430\u043B\u0430\u0441\u044C.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0421\u0430\u043F\u0438\u0442\u0441\u043A\u0430\u044F \u0433\u043E\u0440\u043A\u0430, \u0437\u0430 \u043C\u043E\u0441\u0442\u043E\u043C.
TASK_CODE_6=F67L1N
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\u041C\u043E\u0449\u043D\u043E \u0432\u0437\u043C\u0430\u0445\u043D\u0443\u0432 \u043A\u0440\u044B\u043B\u044C\u044F\u043C\u0438, \u0424\u043E\u0443\u043A\u0441 \u0441\u0442\u0440\u0435\u043C\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u043F\u0440\u043E\u043D\u0435\u0441\u0441\u044F, \u043D\u0430\u0434 \u0433\u043E\u043B\u043E\u0432\u0430\u043C\u0438 \u043F\u0440\u043E\u0442\u0438\u0432\u043D\u0438\u043A\u043E\u0432 \u0427\u0442\u043E-\u0442\u043E \u0443\u043F\u0430\u043B\u043E \u043A \u0413\u0430\u0440\u0440\u0438 \u043D\u0430 \u043A\u043E\u043B\u0435\u043D\u0438 \u2014 \u0434\u043D\u0435\u0432\u043D\u0438\u043A, \u0432\u0435\u0441\u044C \u0447\u0435\u043C \u0442\u043E \u0441\u043C\u0430\u0437\u0430\u043D\u043D\u044B\u0439! \u041A\u0430\u043A\u0443\u044E-\u0442\u043E \u0434\u043E\u043B\u044E \u0441\u0435\u043A\u0443\u043D\u0434\u044B \u043E\u0431\u0430, \u0438 \u0420\u0435\u0434\u0434\u043B, \u0438 \u0413\u0430\u0440\u0440\u0438, \u0441\u043C\u043E\u0442\u0440\u0435\u043B\u0438 \u043D\u0430 \u043D\u0435\u0433\u043E. \u0413\u0440\u044F\u043D\u0443\u043B \u0434\u043E\u043B\u0433\u0438\u0439, \u043F\u0440\u043E\u0434\u0438\u0440\u0430\u044E\u0449\u0438\u0439 \u0434\u043E \u043C\u043E\u0437\u0433\u0430 \u043A\u043E\u0441\u0442\u0435\u0439 \u0432\u043E\u043F\u043B\u044C. \u0427\u0435\u0440\u043D\u0438\u043B\u0430 \u043F\u043E\u0442\u043E\u043A\u043E\u043C \u0445\u043B\u044B\u043D\u0443\u043B\u0438 \u0438\u0437 \u0434\u043D\u0435\u0432\u043D\u0438\u043A\u0430, \u043F\u043E\u0434\u043E\u0431\u043D\u043E \u043E\u0442\u0440\u0430\u0431\u043E\u0442\u0430\u043D\u043D\u043E\u043C\u0443 \u043C\u0430\u0441\u043B\u0443, \u043F\u043E \u0440\u0443\u043A\u0430\u043C \u0413\u0430\u0440\u0440\u0438 \u043F\u043E\u0442\u0435\u043A\u043B\u0438 \u0440\u0443\u0447\u044C\u0438, \u0441\u043C\u0430\u0437\u044B\u0432\u0430\u044F \u043F\u043E\u043B. \u0420\u0435\u0434\u0434\u043B\u0430 \u043A\u043E\u0440\u0447\u0438\u043B\u043E \u0438 \u0432\u044B\u0432\u043E\u0440\u0430\u0447\u0438\u0432\u0430\u043B\u043E, \u043E\u043D \u0431\u0438\u043B\u0441\u044F \u0438 \u0432\u0438\u0437\u0436\u0430\u043B, \u0430 \u043F\u043E\u0442\u043E\u043C\u2026 \u041F\u043E\u0442\u043E\u043C \u043E\u043D \u0441\u0433\u0438\u043D\u0443\u043B. \u0412\u043E\u043B\u0448\u0435\u0431\u043D\u0430\u044F \u043F\u0430\u043B\u043E\u0447\u043A\u0430 \u0413\u0430\u0440\u0440\u0438 \u0441\u043E \u0441\u0442\u0443\u043A\u043E\u043C \u0443\u043F\u0430\u043B\u0430 \u043D\u0430 \u0445\u043E\u043B\u043E\u0434\u043D\u044B\u0435 \u043F\u043B\u0438\u0442\u044B, \u0438 \u043D\u0430\u0441\u0442\u0443\u043F\u0438\u043B\u0430 \u0442\u0438\u0448\u0438\u043D\u0430. \u041F\u043E\u043B\u043D\u0430\u044F \u0442\u0438\u0448\u0438\u043D\u0430, \u043D\u0430\u0440\u0443\u0448\u0430\u0435\u043C\u0430\u044F \u043B\u0438\u0448\u044C \u0443\u043F\u043E\u0440\u043D\u044B\u043C \u00AB\u043A\u0430\u043F, \u043A\u0430\u043F, \u043A\u0430\u043F\u00BB, \u043A\u0430\u043A \u0443 \u043F\u0440\u043E\u0442\u0435\u043A\u0430\u044E\u0449\u0435\u0433\u043E \u0434\u0432\u0438\u0433\u0430\u0442\u0435\u043B\u044F  \u2014 \u044D\u0442\u043E \u0447\u0435\u0440\u043D\u0438\u043B\u0430 \u0432\u0441\u0435 \u0435\u0449\u0435 \u0441\u043E\u0447\u0438\u043B\u0438\u0441\u044C \u0441\u043E \u0441\u0442\u0440\u0430\u043D\u0438\u0446 \u0434\u043D\u0435\u0432\u043D\u0438\u043A\u0430: \u044F\u0434 \u0432\u0430\u0441\u0438\u043B\u0438\u0441\u043A\u0430 \u043F\u0440\u043E\u0436\u0435\u0433 \u0432 \u043D\u0435\u043C \u0448\u0438\u043F\u044F\u0449\u0443\u044E \u0441\u043A\u0432\u043E\u0437\u043D\u0443\u044E \u0434\u044B\u0440\u0443.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0413\u0430\u0440\u0440\u0438 \u0431\u044B\u0432\u0430\u043B \u0432 \u0425\u043E\u0433\u0432\u0430\u0440\u0442\u0441\u0435 \u043D\u0430 \u043C\u043D\u043E\u0433\u0438\u0445 \u043F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0430\u0445, \u043D\u043E \u043D\u0438\u043A\u043E\u0433\u0434\u0430 \u0435\u0449\u0435 \u043D\u0438\u0447\u0435\u0433\u043E \u043F\u043E\u0434\u043E\u0431\u043D\u043E\u0433\u043E \u043D\u0435 \u043F\u043E\u043C\u044B\u0448\u043B\u044F\u043B: \u0432\u0441\u0435 \u0431\u044B\u043B\u0438 \u0432 \u043F\u0438\u0436\u0430\u043C\u0430\u0445, \u0438 \u0442\u043E\u0440\u0436\u0435\u0441\u0442\u0432\u043E \u0440\u0430\u0441\u0442\u044F\u043D\u0443\u043B\u043E\u0441\u044C \u043D\u0430 \u0446\u0435\u043B\u0443\u044E \u043D\u043E\u0447\u044C. \u0418 \u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0436\u0435 \u0440\u0430\u0434\u043E\u0441\u0442\u0438 \u044D\u0442\u0430 \u043D\u043E\u0447\u044C \u043F\u0440\u0438\u043D\u0435\u0441\u043B\u0430 \u0435\u043C\u0443! \u0413\u0435\u0440\u043C\u0438\u043E\u043D\u0430 \u0432\u0441\u0442\u0440\u0435\u0442\u0438\u043B\u0430 \u0435\u0433\u043E \u0441 \u0432\u043E\u0441\u0442\u043E\u0440\u0436\u0435\u043D\u043D\u044B\u043C \u043A\u0440\u0438\u043A\u043E\u043C: \u00AB\u0422\u044B \u043F\u043E\u0431\u0435\u0434\u0438\u043B, \u0413\u0430\u0440\u0440\u0438!\u00BB, \u041E\u0438\u043B\u0437 \u0438 \u0413\u0440\u0435\u0430\u0441\u0435\u0441 \u0432\u044B\u0441\u043A\u043E\u0447\u0438\u043B\u0438 \u0438\u0437-\u0437\u0430 \u0441\u0442\u043E\u043B\u0430, \u0434\u043E\u043B\u0433\u043E \u0442\u0440\u044F\u0441\u043B\u0438 \u0435\u0433\u043E \u0440\u0443\u043A\u0443, \u0431\u0435\u0441\u043A\u043E\u043D\u0435\u0447\u043D\u043E \u0438\u0437\u0432\u0438\u043D\u044F\u044F\u0441\u044C \u0437\u0430 \u0441\u0432\u043E\u0438 \u043F\u043E\u0434\u043E\u0437\u0440\u0435\u043D\u0438\u044F, \u0430 \u0432 \u043D\u043E\u0447\u044C\u044E \u0432\u043D\u0435\u0437\u0430\u043F\u043D\u043E \u043F\u043E\u044F\u0432\u0438\u043B\u0441\u044F \u0425\u0430\u0433\u0440\u0438\u0434, \u0432\u0435\u0440\u043D\u0443\u0432\u0448\u0438\u0439\u0441\u044F \u0441 \u043F\u0440\u043E\u043C\u044B\u0441\u043B\u0430, \u0438 \u0441 \u0442\u0430\u043A\u0438\u043C \u0436\u0430\u0440\u043E\u043C \u0445\u043B\u043E\u043F\u043D\u0443\u043B \u0413\u0430\u0440\u0440\u0438 \u0438 \u0420\u043E\u043D\u0430 \u043F\u043E \u043F\u043B\u0435\u0447\u0430\u043C, \u0447\u0442\u043E \u0442\u0435 \u0442\u043A\u043D\u0443\u043B\u0438\u0441\u044C \u043D\u043E\u0441\u043E\u043C \u0432 \u0442\u0430\u0440\u0435\u043B\u043A\u0438.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n1\u044F \u041F\u0440\u043E\u043C\u044B\u0448\u043B\u0435\u043D\u043D\u0430\u044F, \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u041C\u0430\u0441\u043B\u0430 \u0438 \u0421\u043C\u0430\u0437\u043A\u0438.
TASK_CODE_7=F4L8N2
BONUS_FIVE_MINUTES=WOT89
BONUS_TEN_MINUTES=4HHH7
BONUS_FIFTEEN_MINUTES=R1R1N8