#Sun Sep 17 21:30:01 MSK 2017
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0441 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0412 1926 \u0433\u043E\u0434\u0443 \u0431\u0440\u0438\u0442\u0430\u043D\u0441\u043A\u0438\u0439 \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u0438\u043A \u0438 \u043C\u0430\u0433\u0438\u0447\u0435\u0441\u043A\u0438\u0439 \u0431\u0438\u043E\u043B\u043E\u0433 \u041D\u044C\u044E\u0442 \u0421\u0430\u043B\u0430\u043C\u0430\u043D\u0434\u0435\u0440 \u043F\u0440\u0438\u0431\u044B\u0432\u0430\u0435\u0442 \u043D\u0430 \u043A\u043E\u0440\u0430\u0431\u043B\u0435 \u0432 \u041D\u044C\u044E-\u0419\u043E\u0440\u043A, \u0445\u043E\u0442\u044F \u0435\u0445\u0430\u0442\u044C \u0435\u043C\u0443 \u0447\u0443\u0442\u043E\u043A \u0434\u0430\u043B\u044C\u0448\u0435 \u0432 \u0410\u0440\u0438\u0437\u043E\u043D\u0443. \u0413\u0443\u043B\u044F\u044F \u043F\u043E \u0430\u043B\u043B\u0435\u044F\u043C \u041D\u044C\u044E-\u0419\u043E\u0440\u043A\u0430 \u043E\u043D \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442 \u0417\u043E\u0438 \u041B\u0443 \u0411\u044D\u0440\u0431\u043E\u0443\u043D, \u0436\u0435\u043D\u0449\u0438\u043D\u0443 \u043D\u0435-\u043C\u0430\u0433\u0430, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0432\u043E\u0437\u0433\u043B\u0430\u0432\u043B\u044F\u0435\u0442 \u0424\u0438\u043B\u0430\u043D\u0442\u0440\u043E\u043F\u0438\u0447\u0435\u0441\u043A\u043E\u0435 \u043E\u0431\u0449\u0435\u0441\u0442\u0432\u043E \u00AB\u041D\u043E\u0432\u044B\u0439 \u0421\u0430\u043B\u0435\u043C\u00BB: -\u0422\u044B, \u0434\u0440\u0443\u0433, \u0447\u0442\u043E \u043F\u0440\u0438\u0432\u0435\u043B\u043E \u0442\u0435\u0431\u044F \u043D\u0430 \u043C\u0438\u0442\u0438\u043D\u0433?
GAME_LEGEND=\u0424\u0430\u043D\u0442\u0430\u0441\u0442\u0438\u0447\u0435\u0441\u043A\u0438\u0435 \u0442\u0432\u0430\u0440\u0438 \u0438 \u0433\u0434\u0435 \u043E\u043D\u0438 \u043E\u0431\u0438\u0442\u0430\u044E\u0442.\n\n\u0427\u0442\u043E \u043C\u043E\u0436\u0435\u0442 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442\u044C \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043D\u043E\u0433\u043E \u043F\u0440\u0438\u043C\u0435\u0440\u043D\u043E \u0437\u0430 \u0446\u0435\u043B\u044B\u0439 \u0432\u0435\u043A \u0434\u043E \u0440\u043E\u0436\u0434\u0435\u043D\u0438\u044F \u0441\u0430\u043C\u043E\u0433\u043E \u0437\u043D\u0430\u043C\u0435\u043D\u0438\u0442\u043E\u0433\u043E \u0444\u044D\u043D\u0442\u0435\u0437\u0438\u0439\u043D\u043E\u0433\u043E \u043C\u0430\u043B\u044C\u0447\u0438\u043A\u0430-\u043C\u0430\u0433\u0430 \u0413\u0430\u0440\u0440\u0438 \u041F\u043E\u0442\u0442\u0435\u0440\u0430? \u0416\u0438\u0437\u043D\u044C \u043F\u0438\u0441\u0430\u0442\u0435\u043B\u044F, \u0437\u043E\u043E\u043B\u043E\u0433\u0430 \u0438 \u043F\u0440\u043E\u0441\u0442\u043E \u0445\u043E\u0440\u043E\u0448\u0435\u0433\u043E \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u041D\u044C\u044E\u0442\u0430 \u0421\u043A\u0430\u043C\u0430\u043D\u0434\u0435\u0440\u0430, \u043A\u043D\u0438\u0433\u0430\u043C\u0438 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0431\u0443\u0434\u0435\u0442 \u0437\u0430\u0447\u0438\u0442\u044B\u0432\u0430\u0442\u044C\u0441\u044F \u041F\u043E\u0442\u0442\u0435\u0440 \u0432\u043E \u0432\u0440\u0435\u043C\u0435\u043D\u0430 \u0441\u0432\u043E\u0435\u0433\u043E \u043E\u0431\u0443\u0447\u0435\u043D\u0438\u044F \u0432 \u0425\u043E\u0433\u0432\u0430\u0440\u0442\u0435, \u043C\u043E\u0436\u0435\u0442 \u043F\u043E\u043A\u0430\u0437\u0430\u0442\u044C\u0441\u044F \u043D\u0435 \u043C\u0435\u043D\u0435\u0435 \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043D\u043E\u0439 \u0438 \u0437\u0430\u0445\u0432\u0430\u0442\u044B\u0432\u0430\u044E\u0449\u0435\u0439, \u0447\u0435\u043C \u0436\u0438\u0437\u043D\u044C \u0441\u0430\u043C\u043E\u0439 \u0448\u043A\u043E\u043B\u044B \u043C\u0430\u0433\u0438\u0438 \u0438 \u0435\u0435 \u043E\u0431\u0438\u0442\u0430\u0442\u0435\u043B\u0435\u0439. \u041D\u044C\u044E\u0442 \u2013 \u043E\u0431\u044B\u0447\u043D\u044B\u0439 \u0441\u0440\u0435\u0434\u043D\u0435\u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u0447\u0435\u0441\u043A\u0438\u0439 \u0440\u0430\u0431\u043E\u0442\u043D\u0438\u043A \u041C\u0438\u043D\u0438\u0441\u0442\u0435\u0440\u0441\u0442\u0432\u0430 \u043C\u0430\u0433\u0438\u0438. \u041D\u0430 \u0434\u043E\u0441\u0443\u0433\u0435 \u043E\u043D \u043F\u043E\u0441\u0432\u044F\u0449\u0430\u0435\u0442 \u0432\u0441\u044E \u0441\u0432\u043E\u044E \u0436\u0438\u0437\u043D\u044C \u0445\u043E\u0431\u0431\u0438, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u043E\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u0435\u0449\u0435 \u0441 \u0434\u0435\u0442\u0441\u043A\u0438\u0445 \u043B\u0435\u0442.\n\u0421\u043C\u044B\u0441\u043B \u0432\u0441\u0435\u0439 \u0436\u0438\u0437\u043D\u0438 \u041D\u044C\u044E\u0442\u0430 \u0421\u043A\u0430\u043C\u0430\u043D\u0434\u0435\u0440\u0430, \u0442\u043E, \u043A \u0447\u0435\u043C\u0443 \u0441\u0442\u0440\u0435\u043C\u0438\u0442\u0441\u044F \u0435\u0433\u043E \u0434\u0443\u0448\u0430 \u0438 \u043E\u043D \u0441\u0430\u043C, - \u044D\u0442\u043E \u0438\u0437\u0443\u0447\u0435\u043D\u0438\u0435 \u0432\u0441\u0435\u0445 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0445 \u043C\u0430\u0433\u0438\u0447\u0435\u0441\u043A\u0438\u0445 \u0432\u0438\u0434\u043E\u0432 \u0444\u043B\u043E\u0440\u044B \u0438 \u0444\u0430\u0443\u043D\u044B, \u0447\u0442\u043E \u043E\u0431\u0438\u0442\u0430\u044E\u0442 \u0432 \u0435\u0433\u043E \u043C\u0438\u0440\u0435. \u0418\u043C\u0435\u043D\u043D\u043E \u043E\u043D \u0441\u043E\u0437\u0434\u0430\u0435\u0442 \u043A\u043B\u0430\u0441\u0441\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044E \u0437\u0432\u0435\u0440\u0435\u0439, \u043F\u043E\u043B\u043D\u043E \u0438 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u043E \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u0438\u0437\u0443\u0435\u0442 \u043A\u0430\u0436\u0434\u043E\u0433\u043E \u0438\u0437 \u043D\u0438\u0445 \u0432 \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438, \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043F\u043E\u043D\u044F\u0442\u0438\u044F \u0444\u0430\u043D\u0442\u0430\u0441\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u0437\u0432\u0435\u0440\u044F \u0438 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0430, \u0430 \u0442\u0430\u043A\u0436\u0435 \u0447\u0435\u0442\u043A\u043E \u043F\u0440\u043E\u0447\u0435\u0440\u0447\u0438\u0432\u0430\u0435\u0442 \u043C\u0435\u0436\u0434\u0443 \u043D\u0438\u043C\u0438 \u0433\u0440\u0430\u043D\u0438\u0446\u0443.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0411\u0440. \u0413\u0430\u0437\u0434\u0430\u043D\u043E\u0432\u044B\u0445, \u043E\u043A\u043E\u043B\u043E \u043F\u0440\u0438\u0431\u043E\u0440\u043E\u0441\u0442\u0440\u043E\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0437\u0430\u0432\u043E\u0434\u0430.
TASK_CODE_6=A3G5N1
START_CODE=ld
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0411\u044B\u0432\u0448\u0438\u0439 \u043C\u0440\u0430\u043A\u043E\u0431\u043E\u0440\u043E\u0435\u0446 \u0422\u0438\u043D\u0430 \u0413\u043E\u043B\u0434\u0448\u0442\u0435\u0439\u043D \u0430\u0440\u0435\u0441\u0442\u043E\u0432\u044B\u0432\u0430\u0435\u0442 \u041D\u044C\u044E\u0442\u0430 \u043A\u0430\u043A \u043D\u0435\u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0433\u043E \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u0438\u043A\u0430 \u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442 \u0435\u0433\u043E \u0432 \u0448\u0442\u0430\u0431-\u043A\u0432\u0430\u0440\u0442\u0438\u0440\u0443 \u0411\u044E\u0440\u043E \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043E\u043A \u0433\u0440\u0430\u0436\u0434\u0430\u043D\u0441\u043A\u043E-\u0430\u043C\u0435\u0440\u0438\u043A\u0430\u043D\u0441\u043A\u043E\u0439 \u0437\u0430\u0449\u0438\u0442\u044B \u0434\u0435\u043B \u0430\u0442 \u043D\u0435-\u043C\u0430\u0433\u043E\u0432, \u0441 \u043E\u0447\u0435\u043D\u044C \u0441\u043B\u043E\u0436\u043D\u043E\u0439 \u0430\u0431\u0431\u0440\u0435\u0432\u0438\u0430\u0442\u0443\u0440\u043E\u0439, \u043D\u0430\u0434\u0435\u044F\u0441\u044C \u0432\u0435\u0440\u043D\u0443\u0442\u044C \u0441\u0435\u0431\u0435 \u043F\u0440\u0435\u0436\u043D\u044E\u044E \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u044C. \u041E\u0434\u043D\u0430\u043A\u043E \u0432 \u0447\u0435\u043C\u043E\u0434\u0430\u043D\u0435 \u043E\u043A\u0430\u0437\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u0435\u0442\u0430\u043B\u0438 \u0441 \u0437\u0430\u0432\u043E\u0434\u0430, \u0438 \u041D\u044C\u044E\u0442\u0430 \u043E\u0442\u043F\u0443\u0441\u043A\u0430\u044E\u0442.
TASK_CODE_4=A7G8N9
TASK_CODE_3=4AG13N
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0417\u0430\u0431\u0440\u043E\u0448\u0435\u043D\u043D\u043E\u0435 \u0437\u0434\u0430\u043D\u0438\u0435 \u043D\u0430 \u0441\u0442\u0430\u0432\u0440\u043E\u043F\u043E\u043B\u044C\u0441\u043A\u043E\u0439.
TASK_CODE_2=A7G3N6
TASK_CODE_1=AGN001
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0413\u043B\u0430\u0432\u0430 \u0414\u0435\u043F\u0430\u0440\u0442\u0430\u043C\u0435\u043D\u0442\u0430 \u043C\u0430\u0433\u0438\u0447\u0435\u0441\u043A\u043E\u0439 \u0431\u0435\u0437\u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u041F\u0435\u0440\u0441\u0438\u0432\u0430\u043B\u044C \u0413\u0440\u0435\u0439\u0432\u0441 \u043E\u0431\u0432\u0438\u043D\u044F\u0435\u0442 \u041D\u044C\u044E\u0442\u0430 \u0432 \u0437\u0430\u0433\u043E\u0432\u043E\u0440\u0435 \u0441 \u043F\u0435\u0447\u0430\u043B\u044C\u043D\u043E \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u043C \u0442\u0435\u043C\u043D\u044B\u043C \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u0438\u043A\u043E\u043C \u041C\u0438\u0440\u0430\u043D\u0434\u043E\u0439 \u0421\u0442\u0430\u0432\u0440\u043E. \u041D\u044C\u044E\u0442 \u0438 \u0422\u0438\u043D\u0430 \u043F\u0440\u0438\u0433\u043E\u0432\u0430\u0440\u0438\u0432\u0430\u044E\u0442\u0441\u044F \u043A \u0441\u043C\u0435\u0440\u0442\u0438, \u043D\u043E \u043B\u0435\u0447\u0443\u0440\u043A\u0430 \u041F\u0438\u043A\u0435\u0442\u0442 \u043E\u0441\u0432\u043E\u0431\u043E\u0436\u0434\u0430\u0435\u0442 \u0438\u0445, \u0432 \u0442\u043E \u0432\u0440\u0435\u043C\u044F \u043A\u0430\u043A \u041A\u0443\u0438\u043D\u0438 \u0441\u043F\u0430\u0441\u0430\u0435\u0442 \u042F\u043A\u043E\u0431\u0430, \u0434\u043E\u0441\u0442\u0430\u0435\u0442 \u0447\u0435\u043C\u043E\u0434\u0430\u043D \u041D\u044C\u044E\u0442\u0430 \u0438 \u0443\u0431\u0435\u0433\u0430\u0435\u0442.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u0430\u0440\u043A \u043C\u0435\u0442\u0430\u043B\u043B\u0443\u0440\u0433\u043E\u0432. \u041F\u043E \u0430\u0432\u0442\u043E\u0434\u043E\u0440\u043E\u0436\u043A\u0435 \u0434\u043E \u043A\u043E\u043D\u0446\u0430. \u0413\u0434\u0435 \u043A\u0438\u043D\u043E\u043B\u043E\u0433\u0438.
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041A\u0440\u0438\u0434\u0435\u043D\u0441 \u043D\u0430\u0445\u043E\u0434\u0438\u0442 \u043F\u0430\u043B\u043E\u0447\u043A\u0443 \u043F\u043E\u0434 \u043A\u0440\u043E\u0432\u0430\u0442\u044C\u044E \u0441\u0432\u043E\u0435\u0439 \u0441\u0435\u0441\u0442\u0440\u044B \u041C\u043E\u0434\u0435\u0441\u0442\u0438, \u0438\u043D\u043E\u0441\u0442\u0440\u0430\u043D\u043D\u043E\u0439 \u0444\u0438\u0440\u043C\u044B A1Z26, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0438 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043A\u043B\u044E\u0447\u043E\u043C \u043A \u0441\u0438\u043C\u0432\u043E\u043B\u0430\u043C. \u041C\u044D\u0440\u0438 \u041B\u0443 \u043F\u0440\u0435\u0434\u043F\u043E\u043B\u0430\u0433\u0430\u0435\u0442, \u0447\u0442\u043E \u044D\u0442\u043E \u043F\u0430\u043B\u043E\u0447\u043A\u0430 \u041A\u0440\u0438\u0434\u0435\u043D\u0441\u0430, \u043D\u043E \u041C\u043E\u0434\u0435\u0441\u0442\u0438 \u0443\u0442\u0432\u0435\u0440\u0436\u0434\u0430\u0435\u0442, \u0447\u0442\u043E \u044D\u0442\u043E \u0435\u0451. \u041A\u043E\u0433\u0434\u0430 \u041C\u044D\u0440\u0438 \u041B\u0443 \u0441\u043E\u0431\u0438\u0440\u0430\u0435\u0442\u0441\u044F \u043D\u0430\u043A\u0430\u0437\u0430\u0442\u044C \u0435\u0451, \u043E\u0431\u0441\u043A\u0443\u0440 \u0440\u0430\u0441\u043A\u0440\u044B\u0432\u0430\u0435\u0442\u0441\u044F, \u0443\u0431\u0438\u0432\u0430\u044F \u0432\u0441\u0435\u0445, \u043A\u0440\u043E\u043C\u0435 \u041A\u0440\u0438\u0434\u0435\u043D\u0441\u0430 \u0438 \u041C\u043E\u0434\u0435\u0441\u0442\u0438. \u0413\u0440\u0435\u0439\u0432\u0441 \u043F\u0440\u0438\u0431\u044B\u0432\u0430\u0435\u0442 \u043D\u0430 \u043C\u0435\u0441\u0442\u043E,  \u0438 \u043E\u0442\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0443\u0447\u0438\u0442\u044C \u0435\u0433\u043E \u043C\u0430\u0433\u0438\u0438. \u041A\u0440\u0438\u0434\u0435\u043D\u0441 \u043F\u043E\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442, \u0447\u0442\u043E \u043E\u043D \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u043E\u0441\u0438\u0442\u0435\u043B\u0435\u043C \u043E\u0431\u0441\u043A\u0443\u0440\u0430, \u043F\u0440\u043E\u0436\u0438\u0432 \u0434\u043E\u043B\u044C\u0448\u0435 \u043B\u044E\u0431\u043E\u0433\u043E \u0434\u0440\u0443\u0433\u043E\u0433\u043E \u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044F \u0438\u0437-\u0437\u0430 \u0441\u0438\u043B\u044B \u0435\u0433\u043E \u043C\u0430\u0433\u0438\u0438. \u0412 \u044F\u0440\u043E\u0441\u0442\u0438 \u043E\u043D \u0432\u044B\u043F\u0443\u0441\u043A\u0430\u0435\u0442 \u043E\u0431\u0441\u043A\u0443\u0440\u0430 \u043D\u0430 \u0433\u043E\u0440\u043E\u0434.
START_TIME=13-00
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0410\u043B\u043B\u0435\u044F \u043C\u0435\u0436\u0434\u0443 \u043F\u0440.\u041A\u043E\u0441\u0442\u0430 \u0438 \u0441\u0442\u0430\u0440\u044B\u043C \u041A\u0435\u0441\u0430\u0435\u0432\u0430 \u043F\u043E \u0417\u043E\u0438 \u041A\u043E\u0441\u043C\u043E\u0434\u0435\u043C\u044C\u044F\u043D\u0441\u043A\u043E\u0439.
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041A\u0442\u043E \u0442\u044B \u043F\u0440\u043E\u0434\u0430\u0432\u0435\u0446, \u0438\u0441\u043A\u0430\u0442\u0435\u043B\u044C, \u043C\u043E\u0436\u0435\u0442 \u0442\u044B \u0438\u0449\u0435\u0448\u044C \u043F\u0440\u0430\u0432\u0434\u0443? \u0418\u043B\u0438 \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0433\u043B\u0430\u0441\u0438\u0435 \u0441 \u0441\u0430\u043C\u0438\u043C \u0441\u043E\u0431\u043E\u0439? \u0422\u0430\u043A \u0435\u0433\u043E \u0434\u0430\u0432\u043D\u043E \u0442\u0430\u043C \u0443\u0436\u0435 \u0438 \u043D\u0435\u0442! - \u0441\u043F\u0440\u0430\u0448\u0438\u0432\u0430\u043B\u0430 \u0435\u0433\u043E \u0417\u043E\u044F. \u0421\u0437\u0430\u0434\u0438 \u0448\u0443\u043C\u0435\u043B \u043F\u0440\u043E\u0441\u043F\u0435\u043A\u0442, \u0447\u0435\u0440\u0435\u0437 \u0442\u043E\u043B\u043F\u0443 \u043F\u0440\u043E\u0434\u0438\u0440\u0430\u043B\u0441\u044F \u043D\u0435-\u043C\u0430\u0433 \u044F\u041A\u041E\u0431 \u043A\u043E\u0432\u0430\u043B\u044C\u0421\u0422\u0410\u043A\u0438\u0439.
TASK_CODE_5=A1G1N1
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041C\u043E\u0441\u0442\u0438\u043A \u043D\u0430 \u0412\u043B\u0430\u0434\u0438\u0432\u043E\u0441\u0442\u043E\u043A\u0441\u043A\u043E\u0439.
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u044C\u044E\u0442 \u0443\u0433\u043E\u0432\u0430\u0440\u0438\u0432\u0430\u0435\u0442 \u042F\u043A\u043E\u0431\u0430 \u043F\u043E\u043C\u043E\u0447\u044C \u043D\u0430\u0439\u0442\u0438 \u043F\u0440\u043E\u043F\u0430\u0432\u0448\u0438\u0445 \u0441\u0443\u0449\u0435\u0441\u0442\u0432. \u041F\u043E\u0439\u043C\u0430\u0432 \u0434\u0432\u0443\u0445 \u0438\u0437 \u0442\u0440\u0435\u0445 \u0441\u0431\u0435\u0436\u0430\u0432\u0448\u0438\u0445 \u0437\u0432\u0435\u0440\u0435\u0439, \u043E\u043D\u0438 \u0441\u043D\u043E\u0432\u0430 \u0432\u0445\u043E\u0434\u044F\u0442 \u0432 \u0447\u0435\u043C\u043E\u0434\u0430\u043D, \u0433\u0434\u0435 \u043C\u043D\u043E\u0436\u0435\u0441\u0442\u0432\u043E \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u044B\u0445 \u0441\u0443\u0449\u0435\u0441\u0442\u0432. \u0421\u0430\u043C\u044B\u0435 \u043D\u0435\u043E\u0431\u044B\u0447\u043D\u044B\u0435 \u044D\u0442\u043E \u0442\u0430\u043A\u0438\u0435 \u043A\u0443\u0447\u0435\u0440\u044F\u0432\u044B\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0430, \u043F\u043E\u0445\u043E\u0436\u0438\u0435 \u043D\u0430 \u0431\u0430\u0440\u0430\u0448\u0435\u043A. \u041E\u043D\u0438 \u0431\u0435\u0433\u0430\u044E\u0442 \u043F\u043E \u043C\u043E\u0441\u0442\u0438\u043A\u0430\u043C \u0438 \u043F\u043E\u0434 \u043D\u0438\u043C\u0438, \u0432\u043D\u0443\u0442\u0440\u0438 \u0447\u0435\u043C\u043E\u0434\u0430\u043D\u0430 \u041D\u044C\u044E\u0442\u0430.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u0430\u043B\u043E\u0435\u0432\u0430/\u041A\u0430\u043B\u0438\u043D\u0438\u043D\u0430(\u0438\u0449\u0438 \u0441\u0438\u043D\u0438\u0435 \u0432\u043E\u0440\u043E\u0442\u0430, \u0441\u0442\u0443\u0447\u0438 \u0432 \u0441\u0435\u0440\u044B\u0435 \u0434\u0432\u0435\u0440\u0438).
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0418\u043C\u044F \u0433\u043E\u0431\u043B\u0438\u043D\u0430 \u0442\u0430\u0438\u043B\u043E \u0432 \u0441\u0435\u0431\u0435 \u0437\u0430\u0433\u0430\u0434\u043A\u0443, \u0431\u0443\u0434\u0442\u043E \u0440\u043E\u0434\u0438\u0442\u0435\u043B\u0438 \u043D\u0430\u0437\u0432\u0430\u043B\u0438 \u0435\u0433\u043E \u0437\u0430\u0434\u043E\u043C-\u043D\u0430\u043F\u0435\u0440\u0435\u0434. \u0422\u0435\u043C \u043D\u0435 \u043C\u0435\u043D\u0435\u0435, \u0431\u043B\u0430\u0433\u043E\u0434\u0430\u0440\u044F \u0435\u0433\u043E \u043F\u043E\u043C\u043E\u0449\u0438 \u0438 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0432\u044B\u0441\u043B\u0435\u0434\u0438\u0442\u044C \u0442\u0432\u0430\u0440\u044C. \u0413\u043B\u0430\u0432\u043D\u043E\u0435 \u043D\u0435 \u0437\u0430\u0431\u044B\u0442\u044C \u0438\u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0430.
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n\u041C\u0435\u0436\u0434\u0443 \u0442\u0435\u043C, \u041F\u0435\u0440\u0441\u0438\u0432\u0430\u043B\u044C \u0413\u0440\u0435\u0439\u0432\u0441 \u043F\u043E\u0434\u0445\u043E\u0434\u0438\u0442 \u043A \u041A\u0440\u0438\u0434\u0435\u043D\u0441\u0443, \u043F\u0440\u0438\u0435\u043C\u043D\u043E\u043C\u0443 \u0441\u044B\u043D\u0443 \u041C\u044D\u0440\u0438 \u041B\u0443, \u0438 \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u0442 \u043E\u0441\u0432\u043E\u0431\u043E\u0434\u0438\u0442\u044C \u0435\u0433\u043E \u043E\u0442 \u0432\u043B\u0430\u0441\u0442\u0438 \u043C\u0430\u0442\u0435\u0440\u0438. \u0412\u0437\u0430\u043C\u0435\u043D \u043E\u043D \u0445\u043E\u0447\u0435\u0442, \u0447\u0442\u043E\u0431\u044B \u041A\u0440\u0438\u0434\u0435\u043D\u0441 \u043D\u0430\u0448\u0451\u043B \u043E\u0431\u0441\u043A\u0443\u0440\u0430 . \u0413\u0440\u0435\u0439\u0432\u0441 \u0441\u0447\u0438\u0442\u0430\u0435\u0442, \u0447\u0442\u043E \u0438\u043C\u0435\u043D\u043D\u043E \u043E\u0431\u0441\u043A\u0443\u0440 \u0432\u044B\u0437\u0432\u0430\u043B \u0442\u0430\u0438\u043D\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0435 \u0440\u0430\u0437\u0440\u0443\u0448\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0438\u043D\u0446\u0438\u0434\u0435\u043D\u0442\u044B \u0432 \u0433\u043E\u0440\u043E\u0434\u0435.  \u041A\u0440\u0438\u0434\u0435\u043D\u0441 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043D\u0430 \u043F\u043E\u0438\u0441\u043A\u0438 \u043F\u043E \u0441\u043B\u0435\u0434\u0430\u043C \u0447\u0443\u0434\u0438\u0449\u0430. \u041D\u0430 \u0432\u0441\u0435\u0445 \u043C\u0435\u0447\u0442\u0430\u0445 \u0435\u0433\u043E \u043F\u043E\u044F\u0432\u043B\u0435\u043D\u0438\u044F \u043F\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044E\u0442 \u0441\u0442\u0440\u0430\u043D\u043D\u044B\u0435 \u0441\u0438\u043C\u0432\u043E\u043B\u044B: 16-1-18-11 13-5-20-1-12-12-21-18-7-15-22\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3
START_DATE=10-03-2018
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165 (\u0441\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0411\u043B\u0430\u0433\u043E\u0434\u0430\u0440\u044F \u043F\u043E\u043C\u043E\u0449\u0438 \u0443\u0433\u043B\u043E\u0432\u0430\u0442\u043E\u0433\u043E \u0433\u043E\u0431\u043B\u0438\u043D\u0430-\u0433\u0430\u043D\u0433\u0441\u0442\u0435\u0440\u0430 \u0419\u043E\u043B\u0430\u043A'\u041D\u0438\u043D\u0438\u043B\u0430\u043A, \u0441\u0442\u0430\u0440\u043E\u0433\u043E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0442\u043E\u0440\u0430 \u0422\u0438\u043D\u044B, \u0447\u0435\u0442\u0432\u0435\u0440\u043A\u0430 \u043D\u0430\u0445\u043E\u0434\u0438\u0442 \u0438 \u043B\u043E\u0432\u0438\u0442 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0435 \u0438\u0437 \u0441\u0443\u0449\u0435\u0441\u0442\u0432. \u041E\u043D\u043E \u0441\u043F\u0440\u044F\u0442\u0430\u043B\u043E\u0441\u044C \u043E\u0447\u0435\u043D\u044C \u0445\u043E\u0440\u043E\u0448\u043E.  \u0421\u0440\u0435\u0434\u0438 \u043B\u044E\u0434\u0435\u0439, \u0437\u0430 \u0441\u0435\u0440\u043E\u0439 \u0434\u0432\u0435\u0440\u044C\u044E \u0441\u043E \u0432\u0441\u0435\u043C \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u044B\u043C \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C, \u0447\u0442\u043E\u0431\u044B \u0435\u0433\u043E \u0432\u044B\u0441\u043B\u0435\u0434\u0438\u0442\u044C \u043D\u0430\u0448\u0438\u043C \u0434\u0440\u0443\u0437\u044C\u044F\u043C \u043F\u0440\u0438\u0448\u043B\u043E\u0441\u044C \u0441\u043C\u0435\u0448\u0430\u0442\u044C\u0441\u044F \u0441 \u0442\u043E\u043B\u043F\u043E\u0439. \u0414\u0430\u0431\u044B \u0431\u044B\u0442\u044C \u0431\u043E\u043B\u0435\u0435 \u043D\u0435 \u0437\u0430\u043C\u0435\u0442\u043D\u044B\u043C\u0438. \u041E\u043D\u0438 \u043F\u043E\u043A\u0430\u0437\u0430\u043B\u0438 \u0435\u043C\u0443 \u0440\u0430\u0441\u043F\u0435\u0447\u0430\u0442\u043A\u0443 \u0441 \u0438\u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u0435\u043C \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0430. \u041E\u043D \u043E\u0442\u043F\u0440\u0430\u0432\u0438\u043B \u0438\u0445 \u043F\u043E \u0441\u043B\u0435\u0434\u0443.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+,2+ (\u0422\u0418\u0428\u0418\u041D\u0410 \u041D\u0410 \u0423\u0420\u041E\u0412\u041D\u0415)
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164 (\u0441\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0418\u0445 \u0430\u0440\u0435\u0441\u0442\u043E\u0432\u044B\u0432\u0430\u044E\u0442, \u043F\u043E\u043B\u0430\u0433\u0430\u044F, \u0447\u0442\u043E \u043E\u0434\u0438\u043D \u0438\u0437 \u0437\u0432\u0435\u0440\u0435\u0439 \u041D\u044C\u044E\u0442\u0430 \u043D\u0435\u0441\u0435\u0442 \u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043D\u043D\u043E\u0441\u0442\u044C \u0437\u0430 \u0443\u0431\u0438\u0439\u0441\u0442\u0432\u043E \u0441\u0435\u043D\u0430\u0442\u043E\u0440\u0430 \u0413\u0435\u043D\u0440\u0438 \u0428\u043E\u0443-\u043C\u043B\u0430\u0434\u0448\u0435\u0433\u043E, \u043F\u043E\u0447\u0435\u0442\u043D\u043E\u0433\u043E \u0436\u0438\u0442\u0435\u043B\u044F \u00AB\u0433\u043E\u0440\u043E\u0434\u0430 \u043A\u0440\u0435\u0441\u0442\u0430\u00BB. \u041E\u043D\u0438 \u0440\u0435\u0448\u0430\u044E\u0442 \u0443\u043D\u0438\u0447\u0442\u043E\u0436\u0438\u0442\u044C \u0447\u0435\u043C\u043E\u0434\u0430\u043D \u041D\u044C\u044E\u0442\u0430 \u0438 \u0441\u0442\u0435\u0440\u0435\u0442\u044C \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0438\u0435 \u0432\u043E\u0441\u043F\u043E\u043C\u0438\u043D\u0430\u043D\u0438\u044F \u042F\u043A\u043E\u0431\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+,3+
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n\u041F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u0422\u0438\u043D\u0430 \u0438 \u041D\u044C\u044E\u0442 \u043D\u0430\u0445\u043E\u0434\u044F\u0442 \u042F\u043A\u043E\u0431\u0430 \u0438 \u0447\u0435\u043C\u043E\u0434\u0430\u043D, \u0422\u0438\u043D\u0430 \u043E\u0442\u0432\u043E\u0434\u0438\u0442 \u0438\u0445 \u0432 \u0441\u0432\u043E\u044E \u043A\u0432\u0430\u0440\u0442\u0438\u0440\u0443 \u0438 \u0437\u043D\u0430\u043A\u043E\u043C\u0438\u0442 \u0438\u0445 \u0441\u043E \u0441\u0432\u043E\u0435\u0439 \u0441\u0435\u0441\u0442\u0440\u043E\u0439 \u041A\u0443\u0438\u043D\u0438. \u041D\u044C\u044E\u0442 \u0431\u0435\u0440\u0435\u0442 \u042F\u043A\u043E\u0431\u0430 \u0432\u043D\u0443\u0442\u0440\u044C \u0441\u0432\u043E\u0435\u0433\u043E \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u043E\u0433\u043E \u0447\u0435\u043C\u043E\u0434\u0430\u043D\u0430, \u0433\u0434\u0435 \u042F\u043A\u043E\u0431 \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442 \u043E\u0431\u0441\u043A\u0443\u0440\u0430 \u2014 \u0442\u0435\u043C\u043D\u043E\u0433\u043E, \u0440\u0430\u0437\u0440\u0443\u0448\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u043F\u0430\u0440\u0430\u0437\u0438\u0442\u0430, \u0432\u043B\u0430\u0434\u0435\u044E\u0449\u0435\u0433\u043E \u0432\u043E\u0441\u0442\u043E\u0447\u043D\u043E\u0439 \u0442\u0430\u0439\u043D\u043E\u0439  \u0438 \u0440\u0430\u0437\u0432\u0438\u0432\u0430\u044E\u0449\u0435\u0433\u043E\u0441\u044F \u0443 \u0434\u0435\u0442\u0435\u0439-\u043C\u0430\u0433\u043E\u0432, \u0435\u0441\u043B\u0438 \u043E\u043D\u0438 \u043F\u043E\u0434\u0430\u0432\u043B\u044F\u044E\u0442 \u0441\u0432\u043E\u0438 \u043C\u0430\u0433\u0438\u0447\u0435\u0441\u043A\u0438\u0435 \u0441\u043F\u043E\u0441\u043E\u0431\u043D\u043E\u0441\u0442\u0438. \u041E\u043D \u0431\u0443\u0434\u0442\u043E \u0440\u0443\u0448\u0438\u0442 \u043C\u043E\u0441\u0442\u0438\u043A \u043C\u0435\u0436\u0434\u0443 \u043D\u0438\u043C\u0438 \u0438 \u0432\u043E\u043B\u0448\u0435\u0431\u0441\u0442\u0432\u043E\u043C.  \u0422\u0430\u043A\u0438\u0435 \u0434\u0435\u0442\u0438-\u0432\u043E\u043B\u0448\u0435\u0431\u043D\u0438\u043A\u0438 \u0447\u0430\u0441\u0442\u043E \u0433\u0438\u0431\u043D\u0443\u0442.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2+
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n\u041A\u043E\u0433\u0434\u0430 \u041D\u044C\u044E\u0442 \u0441\u043B\u0443\u0448\u0430\u0435\u0442 \u0435\u0451 \u0440\u0435\u0447\u044C, \u043D\u044E\u0445\u043B\u0435\u0440 (\u043C\u0430\u043B\u0435\u043D\u044C\u043A\u043E\u0435 \u043A\u0440\u043E\u0442\u043E\u043F\u043E\u0434\u043E\u0431\u043D\u043E\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043E \u0441 \u043D\u0430\u0432\u044F\u0437\u0447\u0438\u0432\u044B\u043C \u0436\u0435\u043B\u0430\u043D\u0438\u0435\u043C \u0443\u043A\u0440\u0430\u0441\u0442\u044C \u0432\u0441\u0435 \u0431\u043B\u0435\u0441\u0442\u044F\u0449\u0435\u0435) \u0443\u0431\u0435\u0433\u0430\u0435\u0442 \u0438\u0437 \u0435\u0433\u043E \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u043E\u0433\u043E \u0447\u0435\u043C\u043E\u0434\u0430\u043D\u0430, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u043D\u0430\u0445\u043E\u0434\u044F\u0442\u0441\u044F \u043C\u043D\u043E\u0436\u0435\u0441\u0442\u0432\u043E \u0432\u043E\u043B\u0448\u0435\u0431\u043D\u044B\u0445 \u0441\u0443\u0449\u0435\u0441\u0442\u0432. \u041E\u0434\u043D\u0430\u043A\u043E \u0435\u0433\u043E \u0447\u0435\u043C\u043E\u0434\u0430\u043D \u043F\u0443\u0442\u0430\u0435\u0442\u0441\u044F \u0441 \u0447\u0435\u043C\u043E\u0434\u0430\u043D\u043E\u043C \u042F\u043A\u043E\u0431\u0430, \u0440\u0430\u0431\u043E\u0442\u043D\u0438\u043A\u0430 \u0437\u0430\u0432\u043E\u0434\u0430 \u043F\u043E \u0440\u0435\u043C\u043E\u043D\u0442\u0443 \u0438 \u0441\u0442\u0440\u043E\u0438\u0442\u0435\u043B\u044C\u0441\u0442\u0432\u0443 \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u044B\u0445 \u043F\u0440\u0438\u0431\u043E\u0440\u043E\u0432. \u0418 \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442\u0441\u044F \u043F\u0443\u0442\u0430\u043D\u0438\u0446\u0430.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 1+
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n\u041D\u044C\u044E\u0442 \u0443\u0437\u043D\u0430\u0435\u0442, \u0447\u0442\u043E \u041A\u0440\u0438\u0434\u0435\u043D\u0441 \u0441\u043A\u0440\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0432 \u0442\u0443\u043D\u043D\u0435\u043B\u0435 \u043D\u0435\u0434\u0430\u043B\u0435\u043A\u043E \u043E\u0442 \u0441\u0442\u0430\u0440\u043E\u0433\u043E \u043C\u0435\u0442\u0440\u043E \u0432\u043E\u0437\u043B\u0435 \u0441\u0442\u0430\u043D\u0446\u0438\u0438 \u00ABL'Ane et le petit Chien\u00BB, \u043D\u043E \u043D\u0430 \u043D\u0435\u0433\u043E \u043D\u0430\u043F\u0430\u0434\u0430\u0435\u0442 \u0413\u0440\u0435\u0439\u0432\u0441. \u0422\u0438\u043D\u0430, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0437\u043D\u0430\u043B\u0430 \u041A\u0440\u0438\u0434\u0435\u043D\u0441\u0430, \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442 \u0438 \u043F\u044B\u0442\u0430\u0435\u0442\u0441\u044F \u0443\u0441\u043F\u043E\u043A\u043E\u0438\u0442\u044C \u0435\u0433\u043E, \u0430 \u0413\u0440\u0435\u0439\u0432\u0441 \u043F\u044B\u0442\u0430\u0435\u0442\u0441\u044F \u0443\u0431\u0435\u0434\u0438\u0442\u044C \u041A\u0440\u0438\u0434\u0435\u043D\u0441\u0430 \u043F\u043E\u0441\u043B\u0443\u0448\u0430\u0442\u044C \u0435\u0433\u043E. \u0412 \u0442\u043E\u0442 \u043C\u043E\u043C\u0435\u043D\u0442, \u043A\u043E\u0433\u0434\u0430 \u041A\u0440\u0438\u0434\u0435\u043D\u0441 \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442 \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u0442\u044C \u0447\u0435\u043B\u043E\u0432\u0435\u0447\u0435\u0441\u043A\u0438\u0439 \u043E\u0431\u043B\u0438\u043A, \u043F\u043E\u044F\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u043C\u0440\u0430\u043A\u043E\u0431\u043E\u0440\u0446\u044B. \u041E\u043D\u0438, \u043A\u0430\u0437\u0430\u043B\u043E\u0441\u044C \u0431\u044B, \u0443\u0431\u0438\u0432\u0430\u044E\u0442 \u041A\u0440\u0438\u0434\u0435\u043D\u0441\u0430 \u0434\u043B\u044F \u0437\u0430\u0449\u0438\u0442\u044B \u043C\u0430\u0433\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043E\u0431\u0449\u0435\u0441\u0442\u0432\u0430, \u043A\u0430\u043A \u043A\u043E\u0433\u0434\u0430 \u0442\u043E \u044D\u0442\u043E \u0443\u0436\u0435 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u043B\u043E 15 \u0438\u044E\u043B\u044F 1841 \u0433\u043E\u0434\u0430. \u041D\u043E \u043A\u0440\u043E\u0448\u0435\u0447\u043D\u044B\u0439 \u0444\u0440\u0430\u0433\u043C\u0435\u043D\u0442 \u043E\u0431\u0441\u043A\u0443\u0440\u0430 \u0443\u0441\u043A\u043E\u043B\u044C\u0437\u0430\u0435\u0442. \u0418 \u043F\u0440\u044F\u0447\u0435\u0442\u0441\u044F \u0443 \u043E\u0433\u0440\u043E\u043C\u043D\u043E\u0439 \u0436\u0435\u043B\u0435\u0437\u043D\u043E\u0439 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u0435\u0439.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0430 \u043C\u043E\u0441\u0442\u0443 \u041D\u044C\u044E\u0442 \u0432\u044B\u043F\u0443\u0441\u043A\u0430\u0435\u0442 \u0441\u0432\u043E\u044E \u043F\u0442\u0438\u0446\u0443, \u0447\u0442\u043E\u0431\u044B \u0440\u0430\u0441\u0441\u0435\u044F\u0442\u044C \u043F\u0440\u0435\u043F\u0430\u0440\u0430\u0442 \u0432 \u0432\u0438\u0434\u0435 \u043B\u0438\u0432\u043D\u044F \u043D\u0430\u0434 \u0433\u043E\u0440\u043E\u0434\u043E\u043C, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0441\u0442\u0438\u0440\u0430\u0435\u0442 \u0432\u0441\u0435 \u043D\u0435\u0434\u0430\u0432\u043D\u0438\u0435 \u0432\u043E\u0441\u043F\u043E\u043C\u0438\u043D\u0430\u043D\u0438\u044F \u0436\u0438\u0442\u0435\u043B\u0435\u0439 \u041D\u044C\u044E-\u0419\u043E\u0440\u043A\u0430.  \u041D\u0430 \u044D\u0442\u043E \u0432\u0441\u0435 \u0441\u0432\u0435\u0440\u0445\u0443 \u0432\u043D\u0438\u0437 \u0432\u0437\u0438\u0440\u0430\u043B \u0447\u0435\u043B\u043E\u0432\u0435\u043A, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u0431\u044B\u043B\u043E  \u00AB\u0434\u0432\u0430 \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430: \u043E\u0434\u0438\u043D \u2014 \u0434\u043E\u0431\u0440\u043E\u0434\u0443\u0448\u043D\u044B\u0439, \u0434\u043B\u044F \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u043E\u0433\u043E \u043A\u0440\u0443\u0436\u043A\u0430 \u0431\u043B\u0438\u0436\u0430\u0439\u0448\u0438\u0445 \u0434\u0440\u0443\u0437\u0435\u0439 \u0438 \u0434\u043B\u044F \u0442\u0435\u0445 \u043D\u0435\u043C\u043D\u043E\u0433\u0438\u0445 \u043B\u0438\u0446, \u043A \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u043E\u043D \u0438\u043C\u0435\u043B \u043E\u0441\u043E\u0431\u0435\u043D\u043D\u043E\u0435 \u0443\u0432\u0430\u0436\u0435\u043D\u0438\u0435; \u0434\u0440\u0443\u0433\u043E\u0439 \u2014 \u0437\u0430\u043D\u043E\u0441\u0447\u0438\u0432\u044B\u0439 \u0438 \u0437\u0430\u0434\u043E\u0440\u043D\u044B\u0439, \u0434\u043B\u044F \u0432\u0441\u0435\u0445 \u043F\u0440\u043E\u0447\u0438\u0445 \u0437\u043D\u0430\u043A\u043E\u043C\u044B\u0445..\u00BB . \u041F\u043E\u0434 \u0441\u0430\u043C\u0438\u043C \u043C\u043E\u0441\u0442\u043E\u043C \u041A\u0443\u0438\u043D\u0438 \u0446\u0435\u043B\u0443\u0435\u0442 \u042F\u043A\u043E\u0431\u0430 \u043D\u0430 \u043F\u0440\u043E\u0449\u0430\u043D\u0438\u0435, \u043A\u043E\u0433\u0434\u0430 \u0434\u043E\u0436\u0434\u044C \u0441\u0442\u0438\u0440\u0430\u0435\u0442 \u0435\u0433\u043E \u0432\u043E\u0441\u043F\u043E\u043C\u0438\u043D\u0430\u043D\u0438\u044F. \u041D\u044C\u044E\u0442 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432 \u0415\u0432\u0440\u043E\u043F\u0443, \u043D\u043E \u043E\u0431\u0435\u0449\u0430\u0435\u0442 \u0432\u0435\u0440\u043D\u0443\u0442\u044C\u0441\u044F \u0438 \u0432\u0441\u0442\u0440\u0435\u0442\u0438\u0442\u044C \u0422\u0438\u043D\u0443, \u043A\u043E\u0433\u0434\u0430 \u0435\u0433\u043E \u043A\u043D\u0438\u0433\u0430 \u0431\u0443\u0434\u0435\u0442 \u0437\u0430\u043A\u043E\u043D\u0447\u0435\u043D\u0430; \u043E\u043D \u0442\u0430\u043A\u0436\u0435 \u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u042F\u043A\u043E\u0431\u0443 \u0447\u0435\u043C\u043E\u0434\u0430\u043D, \u0437\u0430\u043F\u043E\u043B\u043D\u0435\u043D\u043D\u044B\u0439 \u0441\u0435\u0440\u0435\u0431\u0440\u044F\u043D\u043E\u0439 \u044F\u0438\u0447\u043D\u043E\u0439 \u0441\u043A\u043E\u0440\u043B\u0443\u043F\u043E\u0439 \u041E\u043A\u0430\u043C\u0438, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u043E\u0444\u0438\u043D\u0430\u043D\u0441\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0435\u0433\u043E \u043F\u0435\u043A\u0430\u0440\u043D\u044E.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u0434 \u043D\u043E\u0432\u044B\u043C \u043C\u043E\u0441\u0442\u043E\u043C.
TASK_CODE_7=8A2GN4
BONUS_FIVE_MINUTES=FCK007
BONUS_TEN_MINUTES=SGS34
BONUS_FIFTEEN_MINUTES=TOR45