#Sun Sep 17 21:30:01 MSK 2017
GAME_LEGEND="\u0421\u0443\u0434\u043D\u0430\u044F \u043D\u043E\u0447\u044C"\n\n\u041A 2018 \u0433\u043E\u0434\u0443 \u0421\u043E\u0435\u0434\u0438\u043D\u0451\u043D\u043D\u044B\u0435 \u0428\u0442\u0430\u0442\u044B \u0410\u043C\u0435\u0440\u0438\u043A\u0438 \u043F\u0440\u043E\u0446\u0432\u0435\u0442\u0430\u044E\u0442 \u0441 \u0443\u0440\u043E\u0432\u043D\u0435\u043C \u0431\u0435\u0437\u0440\u0430\u0431\u043E\u0442\u0438\u0446\u044B \u0432 1 % \u0438 \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043D\u043E\u0441\u0442\u0438 \u043D\u0430 \u0440\u0435\u043A\u043E\u0440\u0434\u043D\u043E \u043D\u0438\u0437\u043A\u043E\u043C \u0443\u0440\u043E\u0432\u043D\u0435. \u0412 \u043D\u0435\u0434\u0430\u043B\u0435\u043A\u043E\u043C \u0431\u0443\u0434\u0443\u0449\u0435\u043C \u0410\u043C\u0435\u0440\u0438\u043A\u0430 \u043F\u0440\u0435\u0432\u0440\u0430\u0442\u0438\u043B\u0430\u0441\u044C \u0432 \u0442\u043E\u0442\u0430\u043B\u0438\u0442\u0430\u0440\u043D\u043E\u0435 \u0433\u043E\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u043E, \u0432\u043B\u0430\u0441\u0442\u044C \u0437\u0430\u0445\u0432\u0430\u0442\u0438\u043B\u0438 \u041D\u043E\u0432\u044B\u0435 \u041E\u0442\u0446\u044B-\u043E\u0441\u043D\u043E\u0432\u0430\u0442\u0435\u043B\u0438, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0440\u0430\u0437 \u0432 \u0433\u043E\u0434\u0443 \u0441 10 \u0447\u0430\u0441\u043E\u0432 \u0432\u0435\u0447\u0435\u0440\u0430 8 \u0438\u044E\u043D\u044F \u0434\u043E 7 \u0447\u0430\u0441\u043E\u0432 \u0443\u0442\u0440\u0430 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0433\u043E \u0434\u043D\u044F \u0443\u0437\u0430\u043A\u043E\u043D\u0438\u043B\u0438 \u043B\u044E\u0431\u044B\u0435 \u043F\u0440\u0435\u0441\u0442\u0443\u043F\u043B\u0435\u043D\u0438\u044F, \u0432\u043A\u043B\u044E\u0447\u0430\u044F \u0443\u0431\u0438\u0439\u0441\u0442\u0432\u0430. \u0421\u0443\u0434\u043D\u043E\u0439 \u043D\u043E\u0447\u044C\u044E \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442 \u0432\u0435\u043B\u0438\u043A\u0430\u044F \u0427\u0438\u0441\u0442\u043A\u0430, \u0441\u043B\u0443\u0436\u0431\u044B \u0431\u0435\u0437\u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0438 \u043E\u043A\u0430\u0437\u0430\u043D\u0438\u044F \u043C\u0435\u0434\u0438\u0446\u0438\u043D\u0441\u043A\u043E\u0439 \u043F\u043E\u043C\u043E\u0449\u0438 \u043F\u0435\u0440\u0435\u0441\u0442\u0430\u044E\u0442 \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C, \u0431\u0435\u0434\u043D\u044F\u043A\u043E\u0432 \u0438 \u0432\u0441\u0435\u0445, \u043A\u0442\u043E \u043D\u0435 \u0432 \u0441\u043E\u0441\u0442\u043E\u044F\u043D\u0438\u0438 \u0441\u0435\u0431\u044F \u0437\u0430\u0449\u0438\u0442\u0438\u0442\u044C, \u0431\u0435\u0437\u0436\u0430\u043B\u043E\u0441\u0442\u043D\u043E \u0443\u0431\u0438\u0432\u0430\u044E\u0442, \u043E\u043F\u0440\u0430\u0432\u0434\u044B\u0432\u0430\u044F \u0442\u0430\u043A\u0438\u0435 \u043C\u0435\u0440\u044B \u044D\u043A\u043E\u043D\u043E\u043C\u0438\u0447\u0435\u0441\u043A\u043E\u0439 \u0432\u044B\u0433\u043E\u0434\u043E\u0439 \u0438 \u0441\u043F\u043E\u0441\u043E\u0431\u043E\u043C \u0441\u043D\u044F\u0442\u0438\u044F \u0441\u043E\u0446\u0438\u0430\u043B\u044C\u043D\u043E\u0439 \u043D\u0430\u043F\u0440\u044F\u0436\u0435\u043D\u043D\u043E\u0441\u0442\u0438. \u00AB\u0414\u0430 \u0431\u043B\u0430\u0433\u043E\u0441\u043B\u043E\u0432\u0435\u043D\u043D\u044B \u0431\u0443\u0434\u0443\u0442 \u041D\u043E\u0432\u044B\u0435 \u041E\u0442\u0446\u044B-\u041E\u0441\u043D\u043E\u0432\u0430\u0442\u0435\u043B\u0438, \u0447\u0442\u043E \u0434\u0430\u043B\u0438 \u043D\u0430\u043C \u043F\u0440\u0430\u0432\u043E \u0441\u0443\u0434\u0438\u0442\u044C \u0438 \u043E\u0447\u0438\u0441\u0442\u0438\u0442\u044C \u043D\u0430\u0448\u0438 \u0434\u0443\u0448\u0438. ... \u0414\u0430 \u0431\u043B\u0430\u0433\u043E\u0441\u043B\u043E\u0432\u0435\u043D\u043D\u0430 \u0431\u0443\u0434\u0435\u0442 \u0410\u043C\u0435\u0440\u0438\u043A\u0430, \u0432\u043E\u0437\u0440\u043E\u0436\u0434\u0435\u043D\u043D\u0430\u044F \u043D\u0430\u0446\u0438\u044F\u00BB
START_CODE=tp
START_DATE=09-06-2018
START_TIME=22-00
TASK_1=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21161\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0427\u0435\u0440\u0435\u0437 \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u043F\u043E\u0441\u043B\u0435 \u043D\u0430\u0447\u0430\u043B\u0430 \u00AB\u0421\u0443\u0434\u043D\u043E\u0439 \u043D\u043E\u0447\u0438\u00BB \u0410\u043C\u0435\u0440\u0438\u043A\u0430 \u043F\u043E\u0433\u0440\u0443\u0436\u0430\u0435\u0442\u0441\u044F \u0432 \u0445\u0430\u043E\u0441, \u0432\u0435\u0437\u0434\u0435 \u0433\u043E\u0440\u044B \u0442\u0440\u0443\u043F\u043E\u0432, \u043A\u043E\u0441\u0442\u0440\u044B \u0438 \u0434\u0443\u0448\u0435\u0440\u0430\u0437\u0434\u0438\u0440\u0430\u044E\u0449\u0438\u0435 \u043F\u0440\u043E\u0441\u044C\u0431\u044B \u043E \u043F\u043E\u0449\u0430\u0434\u0435. \u0421\u044B\u043D \u0421\u044D\u043D\u0434\u0438\u043D\u043E\u0432 \u0437\u0430\u043C\u0435\u0447\u0430\u0435\u0442, \u043A\u0430\u043A \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u0438\u0445 \u0434\u043E\u043C\u0430 \u043F\u043E \u043F\u043E\u043B\u044F\u043D\u0435 \u0431\u0435\u0433\u0430\u0435\u0442 \u043B\u044B\u0441\u044B\u0439 \u0442\u0435\u043C\u043D\u043E\u043A\u043E\u0436\u0438\u0439 \u043C\u0443\u0436\u0447\u0438\u043D\u0430 \u0438 \u0443\u043C\u043E\u043B\u044F\u0435\u0442 \u0441\u043F\u0430\u0441\u0442\u0438 \u0435\u0433\u043E. \u0427\u0430\u0440\u043B\u0438, \u043F\u043E\u0441\u043B\u0435 \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0440\u0430\u0437\u0434\u0443\u043C\u0438\u0439, \u0432\u043F\u0443\u0441\u043A\u0430\u0435\u0442 \u0435\u0433\u043E. \u0427\u0435\u0440\u0435\u0437 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043C\u0438\u043D\u0443\u0442 \u043A \u0438\u0445 \u0434\u043E\u043C\u0443 \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442 \u0433\u0440\u0443\u043F\u043F\u0430 \u043C\u0435\u0441\u0442\u043D\u044B\u0445 \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u043E\u0432 \u0432 \u0443\u0445\u043C\u044B\u043B\u044F\u044E\u0449\u0438\u0445\u0441\u044F \u043C\u0430\u0441\u043A\u0430\u0445 \u0438 \u0438\u0445 \u0432\u0435\u0436\u043B\u0438\u0432\u044B\u0439 \u043B\u0438\u0434\u0435\u0440 \u0441\u043E\u043E\u0431\u0449\u0430\u0435\u0442 \u0421\u044D\u043D\u0434\u0438\u043D\u0430\u043C, \u0447\u0442\u043E \u043E\u043D\u0438 \u0442\u0435, \u043A\u0442\u043E \u00AB\u0432 \u00AB\u0421\u0443\u0434\u043D\u0443\u044E \u043D\u043E\u0447\u044C\u00BB \u0443\u0431\u0438\u0432\u0430\u044E\u0442 \u0440\u0430\u0437\u043D\u044B\u0435 \u043E\u0442\u0431\u0440\u043E\u0441\u044B \u043E\u0431\u0449\u0435\u0441\u0442\u0432\u0430\u00BB, \u041E\u043D \u0432\u044B\u0434\u0432\u0438\u0433\u0430\u0435\u0442 \u0441\u0435\u043C\u044C\u0435 \u0443\u043B\u044C\u0442\u0438\u043C\u0430\u0442\u0443\u043C \u2014 \u0438\u043B\u0438 \u0421\u044D\u043D\u0434\u0438\u043D\u044B \u043E\u0442\u0434\u0430\u0434\u0443\u0442 \u0438\u043C \u041D\u0435\u0437\u043D\u0430\u043A\u043E\u043C\u0446\u0430, \u0438\u043B\u0438 \u0447\u0435\u0440\u0435\u0437 \u0447\u0430\u0441 \u043E\u043D\u0438 \u0432\u044B\u043F\u0443\u0441\u0442\u044F\u0442 \u043D\u0430 \u043D\u0438\u0445 \u0437\u0432\u0435\u0440\u044F. \u00AB\u041F\u0440\u043E\u0441\u0442\u043E \u043E\u0442\u0434\u0430\u0439 \u043D\u0430\u043C \u0431\u0435\u0437\u0434\u043E\u043C\u043D\u0443\u044E \u0441\u0432\u0438\u043D\u044C\u044E\u00BB - \u043A\u0440\u0438\u0447\u0430\u043B \u043E\u0434\u0438\u043D \u0438\u0437 \u0441\u0442\u0443\u0434\u0435\u043D\u0442\u043E\u0432.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_1_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0421\u0443\u043F\u0440\u0443\u0433\u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u0438\u0441\u043A\u0430\u0442\u044C \u043B\u044B\u0441\u043E\u0433\u043E \u0447\u0435\u0440\u043D\u043E\u043A\u043E\u0436\u0435\u0433\u043E \u043D\u0435\u0437\u043D\u0430\u043A\u043E\u043C\u0446\u0430. \u0427\u0430\u0440\u043B\u0438, \u0433\u043B\u044F\u0434\u044F \u043D\u0430 \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u044E, \u0440\u0430\u0437\u0433\u0443\u043B\u0438\u0432\u0430\u044E\u0449\u0443\u044E \u043F\u043E \u043F\u043E\u043B\u044F\u043D\u0435 \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u0438\u0445 \u0434\u043E\u043C\u0430 \u0432 \u043E\u0436\u0438\u0434\u0430\u043D\u0438\u0438, \u0447\u0443\u0432\u0441\u0442\u0432\u0443\u0435\u0442 \u043A\u043E\u0441\u0442\u0435\u0440 \u0441\u0432\u043E\u0438\u0445 \u043F\u043E\u0433\u0430\u0448\u0435\u043D\u043D\u044B\u0445 \u044D\u043C\u043E\u0446\u0438\u0439, \u0438 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0438\u0434\u0442\u0438 \u043D\u0430 \u043F\u043E\u0432\u043E\u0434\u0443 \u0443 \u0440\u043E\u0434\u0438\u0442\u0435\u043B\u0435\u0439, \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u0441\u0432\u043E\u0435\u0433\u043E \u0441\u0430\u043C\u043E\u0434\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0440\u043E\u0431\u043E\u0442\u0430 \u0441\u043B\u0435\u0436\u0435\u043D\u0438\u044F \u043F\u043E\u043C\u043E\u0433\u0430\u0435\u0442 \u041D\u0435\u0437\u043D\u0430\u043A\u043E\u043C\u0446\u0443 \u043D\u0430\u0439\u0442\u0438 \u043F\u0443\u0442\u044C \u043A \u0443\u043A\u0440\u044B\u0442\u0438\u044E \u0432 \u0448\u043A\u0430\u0444\u0443 \u0441\u0432\u043E\u0435\u0439 \u043A\u043E\u043C\u043D\u0430\u0442\u044B.
HINT_1_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041F\u043E\u043B\u044F\u043D\u0430 \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u043F\u043E\u0432\u043E\u0440\u043E\u0442\u0430 \u043D\u0430 \u041B\u044B\u0441\u0443\u044E \u0433\u043E\u0440\u0443.
TASK_CODE_1=F7L43N
TASK_2=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21162\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0421\u043E\u0441\u0435\u0434\u0438 \u043F\u0440\u0438\u0448\u043B\u0438 \u0447\u0442\u043E\u0431\u044B \u043E\u0442\u043E\u043C\u0441\u0442\u0438\u0442\u044C \u0421\u044D\u043D\u0434\u0438\u043D\u0430\u043C \u0437\u0430 \u0442\u043E, \u0447\u0442\u043E \u043E\u043D\u0438 \u043D\u0430\u0436\u0438\u043B\u0438 \u043D\u0430 \u043D\u0438\u0445 \u0441\u0432\u043E\u0451 \u0434\u0435\u043D\u0435\u0436\u043D\u043E\u0435 \u0441\u043E\u0441\u0442\u043E\u044F\u043D\u0438\u0435. \u0412 \u0441\u0430\u043C\u044B\u0439 \u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u043F\u043E\u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0441\u0432\u043E\u0431\u043E\u0434\u0438\u0432\u0448\u0438\u0439\u0441\u044F \u043E\u0442 \u0441\u043A\u043E\u0442\u0447\u0430 \u041D\u0435\u0437\u043D\u0430\u043A\u043E\u043C\u0435\u0446, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0443\u0431\u0438\u0432\u0430\u0435\u0442 \u0410\u0445\u0440\u0438, \u043F\u043E\u0441\u043B\u0435 \u0447\u0435\u0433\u043E \u0437\u0430\u0445\u0432\u0430\u0442\u044B\u0432\u0430\u0435\u0442 \u0413\u0440\u0435\u0439\u0441 \u0438 \u0442\u0440\u0435\u0431\u0443\u0435\u0442 \u043E\u0442\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u0421\u044D\u043D\u0434\u0438\u043D\u043E\u0432. \u0413\u0440\u0435\u0439\u0441 \u043F\u0440\u043E\u0441\u0438\u0442 \u043D\u0435 \u0442\u044F\u043D\u0443\u0442\u044C \u0438 \u0443\u0431\u0438\u0442\u044C \u0438\u0445, \u043D\u043E \u041C\u044D\u0440\u0438 \u0433\u043E\u0432\u043E\u0440\u0438\u0442, \u0447\u0442\u043E \u0431\u043E\u043B\u044C\u0448\u0435 \u0432 \u0435\u0451 \u0434\u043E\u043C\u0435 \u043D\u0435 \u0431\u0443\u0434\u0435\u0442 \u043D\u0438\u043A\u0430\u043A\u0438\u0445 \u0443\u0431\u0438\u0439\u0441\u0442\u0432. \u041A\u043E\u0433\u0434\u0430 \u0437\u0432\u0443\u0447\u0438\u0442 \u0441\u0438\u0433\u043D\u0430\u043B \u043F\u0440\u0435\u043A\u0440\u0430\u0449\u0435\u043D\u0438\u044F \u00AB\u0421\u0443\u0434\u043D\u043E\u0439 \u043D\u043E\u0447\u0438\u00BB, \u0445\u0430\u0440\u043A\u0430\u044E\u0449\u0430\u044F \u043A\u0440\u043E\u0432\u044C\u044E \u0413\u0440\u0435\u0439\u0441 \u0438 \u0441\u043E\u0441\u0435\u0434\u0438 \u043F\u043E\u043A\u0438\u0434\u0430\u044E\u0442 \u0434\u043E\u043C \u0421\u044D\u043D\u0434\u0438\u043D\u043E\u0432. \u0417\u0430 \u043A\u0430\u0434\u0440\u043E\u043C \u0437\u0432\u0443\u0447\u0430\u0442 \u0441\u0432\u043E\u0434\u043A\u0438 \u043D\u043E\u0432\u043E\u0441\u0442\u0435\u0439: \u0436\u0438\u0442\u0435\u043B\u044C \u041B\u043E\u0441-\u0410\u043D\u0434\u0436\u0435\u043B\u0435\u0441\u0430 \u0433\u043E\u0432\u043E\u0440\u0438\u0442, \u0447\u0442\u043E \u043D\u0430 \u0435\u0433\u043E \u0443\u043B\u0438\u0446\u0430\u0445 \u0442\u0440\u0443\u043F\u044B \u043F\u043E\u043F\u0430\u0434\u0430\u044E\u0442\u0441\u044F \u043D\u0430 \u043A\u0430\u0436\u0434\u043E\u043C \u0448\u0430\u0433\u0443; \u0436\u0438\u0442\u0435\u043B\u044C \u0434\u0440\u0443\u0433\u043E\u0433\u043E \u0433\u043E\u0440\u043E\u0434\u0430 \u0433\u043E\u0432\u043E\u0440\u0438\u0442, \u0447\u0442\u043E \u0431\u043E\u043B\u044C\u043D\u0438\u0446\u0430 \u043E\u0442\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u0442\u044C \u043F\u043E\u0441\u0442\u0440\u0430\u0434\u0430\u0432\u0448\u0438\u0445. \u0421\u0432\u043E\u0434\u043A\u0438 \u0437\u0430\u0432\u0435\u0440\u0448\u0430\u044E\u0442\u0441\u044F \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435\u043C, \u0447\u0442\u043E \u0442\u0435\u043A\u0443\u0449\u0430\u044F \u00AB\u0421\u0443\u0434\u043D\u0430\u044F \u043D\u043E\u0447\u044C\u00BB \u0431\u044B\u043B\u0430 \u0431\u043E\u043B\u0435\u0435 \u043C\u0430\u0441\u0448\u0442\u0430\u0431\u043D\u043E\u0439, \u0447\u0435\u043C \u043F\u0440\u0435\u0434\u044B\u0434\u0443\u0449\u0435\u0439 \u0432\u0435\u0441\u043D\u043E\u0439.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,2
HINT_2_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0422\u0430\u043A\u0436\u0435 \u0432 \u043D\u043E\u0432\u043E\u0441\u0442\u044F\u0445: \u0432 8:00 \u0436\u0438\u0442\u0435\u043B\u0438 \u0423\u044D\u0441\u0442-\u0434\u0436\u043E\u0440\u0434\u0430\u043D\u0430 \u0433\u043E\u0432\u043E\u0440\u044F\u0442, \u0447\u0442\u043E \u0411\u043E\u043B\u044C\u043D\u0438\u0446\u0430 \u0434\u043E \u0441\u0438\u0445 \u043F\u043E\u0440 \u043D\u0435 \u043E\u0442\u043A\u0440\u044B\u043B\u0430\u0441\u044C. \u0415\u043B\u0435 \u0434\u044B\u0448\u0430\u0449\u0438\u0435 \u043F\u0430\u0446\u0438\u0435\u043D\u0442\u044B, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043A\u043E\u0435 \u043A\u0430\u043A \u0434\u043E\u0442\u0435\u0440\u043F\u0435\u043B\u0438 \u0434\u043E \u0420\u0430\u043D\u043D\u0435\u0433\u043E \u0443\u0442\u0440\u0430 \u0441\u043A\u043E\u0440\u0435\u0435 \u0432\u0441\u0435\u0433\u043E \u043F\u043E\u0433\u0438\u0431\u043D\u0443\u0442, \u0442\u0430\u043A \u0438 \u043D\u0435 \u0434\u043E\u0436\u0434\u0430\u0432\u0448\u0438\u0441\u044C \u043F\u043E\u043C\u043E\u0449\u0438. \u0432 \u041A\u043E\u043B\u043E\u0440\u0430\u0434\u043E \u0423 \u043D\u0430\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u043F\u0430\u043C\u044F\u0442\u043D\u0438\u043A\u0430 \u041B\u0435\u0436\u0430\u0442 \u0433\u043E\u0440\u044B \u0442\u0440\u0443\u043F\u043E\u0432, \u0441 \u0415\u0434\u0432\u0430 \u0440\u0430\u0441\u043F\u043E\u0437\u043D\u043E\u0432\u0430\u0435\u043C\u044B\u043C\u0438 \u043B\u0438\u0446\u0430\u043C\u0438. \u0417\u0430\u043A\u043E\u043D\u0447\u0438\u043B\u0430\u0441\u044C \u043E\u0447\u0435\u0440\u0435\u0434\u043D\u0430\u044F \u00AB\u0441\u0443\u0434\u043D\u0430\u044F \u043D\u043E\u0447\u044C\u00BB. \u0412\u0441\u044F \u0410\u043C\u0435\u0440\u0438\u043A\u0430 \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442 \u0433\u043E\u0442\u043E\u0432\u0438\u0442\u044C\u0441\u044F \u043A \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0439 \u0432\u0435\u0441\u043D\u0435.
HINT_2_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0422\u0443\u0431\u0434\u0438\u0441\u043F\u0430\u043D\u0441\u0435\u0440 \u043D\u0430 \u0412\u0435\u0441\u0435\u043D\u043D\u0435\u0439.
TASK_CODE_2=FL81N4
TASK_3=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21163\n9 \u0438\u044E\u043D\u044F 2018 \u0433\u043E\u0434\u0430, \u0432 \u041B\u043E\u0441-\u0410\u043D\u0434\u0436\u0435\u043B\u0435\u0441\u0435 \u043C\u043E\u043B\u043E\u0434\u0430\u044F \u043F\u0430\u0440\u0430 \u2014 \u0428\u0435\u0439\u043D \u0438 \u041B\u0438\u0437\u0430, \u2014 \u0435\u0434\u0443\u0442 \u043A \u0441\u0435\u0441\u0442\u0440\u0435 \u0428\u0435\u0439\u043D\u0430, \u0447\u0442\u043E\u0431\u044B \u043F\u0435\u0440\u0435\u0436\u0434\u0430\u0442\u044C \u0432 \u0435\u0451 \u0434\u043E\u043C\u0435 \u043D\u043E\u0432\u0443\u044E \u00AB\u0421\u0443\u0434\u043D\u0443\u044E \u043D\u043E\u0447\u044C\u00BB, \u0430 \u0437\u0430\u043E\u0434\u043D\u043E \u0441\u043E\u043E\u0431\u0449\u0438\u0442\u044C \u0435\u0439 \u043E\u0431 \u0438\u0445 \u0440\u0430\u0437\u043C\u043E\u043B\u0432\u043A\u0435. \u041F\u0430\u0440\u0430\u043B\u043B\u0435\u043B\u044C\u043D\u043E \u043E\u0444\u0438\u0446\u0438\u0430\u043D\u0442\u043A\u0430 \u0438\u0437 \u043A\u0430\u0444\u0435 \u0415\u0432\u0430 \u0421\u0430\u043D\u0447\u0435\u0441 \u0440\u0430\u0441\u0441\u0447\u0438\u0442\u044B\u0432\u0430\u0435\u0442 \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u043F\u043E\u0432\u044B\u0448\u0435\u043D\u0438\u0435 \u043F\u043E \u0441\u043B\u0443\u0436\u0431\u0435, \u0442\u0430\u043A \u043A\u0430\u043A \u0443 \u043D\u0435\u0451 \u043D\u0430 \u0438\u0436\u0434\u0438\u0432\u0435\u043D\u0438\u0438 \u043D\u0430\u0445\u043E\u0434\u044F\u0442\u0441\u044F \u0435\u0451 \u0434\u043E\u0447\u044C-\u043F\u043E\u0434\u0440\u043E\u0441\u0442\u043E\u043A \u041A\u0430\u043B\u0438 \u0438 \u0431\u043E\u043B\u044C\u043D\u043E\u0439, \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u043D\u0443\u0436\u043D\u044B \u043B\u0435\u043A\u0430\u0440\u0441\u0442\u0432\u0430, \u043D\u043E \u0442\u0430\u043A \u0438 \u043D\u0435 \u043F\u043E\u043B\u0443\u0447\u0430\u0435\u0442 \u0435\u0433\u043E. \u0421\u0435\u0440\u0436\u0430\u043D\u0442 \u043F\u043E\u043B\u0438\u0446\u0438\u0438 \u041B\u0435\u043E \u0411\u0430\u0440\u043D\u0441 \u0441\u043E\u0431\u0438\u0440\u0430\u0435\u0442\u0441\u044F \u043F\u0440\u0438\u043D\u044F\u0442\u044C  \u0443\u0447\u0430\u0441\u0442\u0438\u0435 \u0432 \u00AB\u0421\u0443\u0434\u043D\u043E\u0439 \u043D\u043E\u0447\u0438\u00BB \u043F\u043E \u043B\u0438\u0447\u043D\u044B\u043C \u043F\u0440\u0438\u0447\u0438\u043D\u0430\u043C, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0441\u0432\u044F\u0437\u0430\u043D\u044B \u0441 \u0435\u0433\u043E \u0443\u043C\u0435\u0440\u0448\u0438\u043C \u0441\u044B\u043D\u043E\u043C \u041D\u0438\u043A\u043E\u043B\u0430\u0441\u043E\u043C.. \u041D\u0443 \u0438 \u00AB\u0433\u0434\u0435 \u043B\u043E\u0433\u0438\u043A\u0430?\u00BB \u0441\u043F\u0440\u043E\u0441\u0438\u0442\u0435 \u0432\u044B.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2
HINT_3_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0430 \u0444\u043E\u043D\u0435 \u0432\u0441\u0435\u0433\u043E \u044D\u0442\u043E\u0433\u043E \u0432 \u0441\u0435\u0442\u0438 \u0440\u0430\u0441\u043F\u0440\u043E\u0441\u0442\u0440\u0430\u043D\u044F\u044E\u0442\u0441\u044F \u0432\u0438\u0434\u0435\u043E\u0440\u043E\u043B\u0438\u043A\u0438 \u0441 \u043E\u0431\u0440\u0430\u0449\u0435\u043D\u0438\u0435\u043C \u043B\u0438\u0434\u0435\u0440\u0430 \u043D\u0435\u043A\u043E\u0433\u043E \u043F\u043E\u0432\u0441\u0442\u0430\u043D\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u0434\u0432\u0438\u0436\u0435\u043D\u0438\u044F \u041C\u043E\u0440\u0442\u0438\u043C\u0435\u0440\u0430 \u041A\u0430\u0440\u043C\u0435\u043B\u043E , \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043F\u044B\u0442\u0430\u0435\u0442\u0441\u044F \u043E\u0442\u043A\u0440\u044B\u0442\u044C \u0436\u0438\u0442\u0435\u043B\u044F\u043C \u0421\u0428\u0410 \u043F\u0440\u0430\u0432\u0434\u0443: \u00AB\u0421\u0443\u0434\u043D\u0430\u044F \u043D\u043E\u0447\u044C\u00BB \u043D\u0435 \u0438\u043C\u0435\u0435\u0442 \u043D\u0438\u043A\u0430\u043A\u043E\u0433\u043E \u043E\u0442\u043D\u043E\u0448\u0435\u043D\u0438\u044F \u043A \u044D\u043A\u043E\u043D\u043E\u043C\u0438\u0447\u0435\u0441\u043A\u043E\u043C\u0443 \u0431\u043B\u0430\u0433\u043E\u043F\u043E\u043B\u0443\u0447\u0438\u044E \u0441\u0442\u0440\u0430\u043D\u044B \u2014 \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u00AB\u0421\u0443\u0434\u043D\u043E\u0439 \u043D\u043E\u0447\u0438\u00BB \u043F\u043E\u0433\u0438\u0431\u0430\u0435\u0442 \u0434\u043E \u0442\u043E\u0433\u043E \u043C\u043D\u043E\u0433\u043E \u043B\u044E\u0434\u0435\u0439, \u0447\u0442\u043E \u043D\u043E\u0432\u043E\u043C\u0443 \u043F\u0440\u0430\u0432\u0438\u0442\u0435\u043B\u044C\u0441\u0442\u0432\u0443 \u0421\u0428\u0410, \u041D\u043E\u0432\u044B\u043C \u041E\u0442\u0446\u0430\u043C-\u043E\u0441\u043D\u043E\u0432\u0430\u0442\u0435\u043B\u044F\u043C \u0410\u043C\u0435\u0440\u0438\u043A\u0438, \u043F\u043E\u0441\u043B\u0435 \u044D\u0442\u043E\u0433\u043E \u043B\u0435\u0433\u0447\u0435 \u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0442\u044C \u043B\u044E\u0434\u0441\u043A\u0438\u0435 \u0440\u0435\u0441\u0443\u0440\u0441\u044B. \u041A\u0430\u043B\u0438 \u043D\u0430\u0445\u043E\u0434\u0438\u0442 \u043B\u043E\u0433\u0438\u043A\u0443 \u0432 \u0435\u0433\u043E \u0441\u043B\u043E\u0432\u0430\u0445.
HINT_3_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B\u0438\u0446\u0430 \u0421\u0430\u0434\u043E\u043D\u0441\u043A\u0430\u044F, \u0432\u044B\u0445\u043E\u0434 \u043A \u0436\u0435\u043B\u0435\u0437\u043D\u043E\u0434\u043E\u0440\u043E\u0436\u043D\u044B\u043C \u043F\u0443\u0442\u044F\u043C.
TASK_CODE_3=F3L39N
TASK_4=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21164\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u0412 \u044D\u0442\u043E\u0442 \u043B\u0435\u0442\u043D\u0438\u0439 \u0434\u0435\u043D\u044C. \u0412\u043E \u0432\u0440\u0435\u043C\u044F \u043A\u0440\u0430\u0442\u043A\u043E\u0439 \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u0438 \u0428\u0435\u0439\u043D \u0438 \u041B\u0438\u0437\u0430 \u0441\u0442\u0430\u043B\u043A\u0438\u0432\u0430\u044E\u0442\u0441\u044F \u0441 \u0433\u0440\u0443\u043F\u043F\u043E\u0439 \u043C\u043E\u043B\u043E\u0434\u044B\u0445 \u043C\u0430\u0440\u043E\u0434\u0451\u0440\u043E\u0432, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0441\u043E\u0431\u0438\u0440\u0430\u044E\u0442\u0441\u044F \u0443\u0447\u0430\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C \u0432 \u00AB\u0421\u0443\u0434\u043D\u043E\u0439 \u043D\u043E\u0447\u0438\u00BB. \u0421\u0440\u0435\u0434\u0438 \u043D\u0438\u0445 \u043E\u0441\u043E\u0431\u0435\u043D\u043D\u043E \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0434\u0438\u043D \u0432 \u0431\u0435\u043B\u043E\u0439 \u043C\u0430\u0441\u043A\u0435, \u043D\u0430 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u043E \u00ABGOD\u00BB. \u0413\u0440\u0443\u043F\u043F\u0430 \u043D\u0435 \u043F\u0440\u043E\u044F\u0432\u043B\u044F\u0435\u0442 \u043A \u043D\u0438\u043C \u043E\u0441\u043E\u0431\u043E\u0433\u043E \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u0430, \u043D\u043E \u0432\u044B\u0433\u043B\u044F\u0434\u0438\u0442 \u043E\u0447\u0435\u043D\u044C \u0432\u0440\u0430\u0436\u0434\u0435\u0431\u043D\u043E\u0439. \u0412 \u044D\u0442\u043E \u0436\u0435 \u0432\u0440\u0435\u043C\u044F \u043E\u0444\u0438\u0446\u0438\u0430\u043D\u0442\u043A\u0430 \u0415\u0432\u0430 \u0421\u0430\u043D\u0447\u0435\u0441 \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442 \u0432 \u043C\u043E\u0442\u0435\u043B\u044C. \u041E\u043D\u0430 \u0441\u043E\u0431\u0438\u0440\u0430\u0435\u0442\u0441\u044F \u043F\u043E\u0443\u0436\u0438\u043D\u0430\u0442\u044C \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u043E\u0442\u0446\u043E\u043C \u0438 \u0434\u043E\u0447\u0435\u0440\u044C\u044E, \u043D\u043E \u041B\u0435\u0436\u0430\u0432\u0430 \u0433\u043E\u0432\u043E\u0440\u0438\u0442, \u0447\u0442\u043E \u0441\u0438\u043B\u044C\u043D\u043E \u0443\u0441\u0442\u0430\u043B, \u0443\u0445\u043E\u0434\u0438\u0442 \u0432 \u0441\u0432\u043E\u044E \u043A\u043E\u043C\u043D\u0430\u0442\u0443 \u0438 \u043F\u0440\u043E\u0441\u0438\u0442 \u0435\u0433\u043E \u043D\u0435 \u0431\u0443\u0434\u0438\u0442\u044C. \u041F\u043E\u0437\u0436\u0435 \u043E\u043D \u0442\u0430\u0439\u043A\u043E\u043C \u0443\u0445\u043E\u0434\u0438\u0442 \u0438\u0437 \u0434\u043E\u043C\u0430 \u0438 \u0441\u0430\u0434\u0438\u0442\u0441\u044F \u0432 \u043B\u0438\u043C\u0443\u0437\u0438\u043D \u0441 \u0448\u043E\u0444\u0451\u0440\u043E\u043C. \u0413\u0434\u0435-\u0442\u043E \u043F\u043E\u0441\u0440\u0435\u0434\u0438 \u0448\u043E\u0441\u0441\u0435 \u043C\u0430\u0448\u0438\u043D\u0430 \u0428\u0435\u0439\u043D\u0430 \u0438 \u041B\u0438\u0437\u044B \u0433\u043B\u043E\u0445\u043D\u0435\u0442 \u2014 \u0431\u0430\u043D\u0434\u0430 \u043C\u0430\u0440\u043E\u0434\u0451\u0440\u043E\u0432, \u0441 \u043A\u043E\u0442\u043E\u0440\u044B\u043C\u0438 \u043E\u043D\u0438 \u0434\u043E \u044D\u0442\u043E\u0433\u043E \u0441\u0442\u043E\u043B\u043A\u043D\u0443\u043B\u0438\u0441\u044C, \u0432\u044B\u0432\u0435\u043B\u0430 \u0438\u0437 \u0441\u0442\u0440\u043E\u044F \u0435\u0451. \u041F\u043E\u0441\u043B\u0435\u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u00AB\u0421\u0443\u0434\u043D\u0430\u044F \u043D\u043E\u0447\u044C\u00BB \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442\u0441\u044F, \u043F\u0430\u0440\u0430 \u0432\u0438\u0434\u0438\u0442 \u0432\u0434\u0430\u043B\u0438 \u043D\u0430 \u0448\u043E\u0441\u0441\u0435 \u0442\u0435\u0445 \u0441\u0430\u043C\u044B\u0445 \u0432\u043E\u043E\u0440\u0443\u0436\u0435\u043D\u043D\u044B\u0445 \u043C\u0430\u0440\u043E\u0434\u0451\u0440\u043E\u0432. \u0412 \u044D\u0442\u043E \u0441\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0432\u0435\u0441\u044C \u0433\u043E\u0440\u043E\u0434 \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442 \u0432 \u0431\u043E\u0435\u0432\u0443\u044E \u0433\u043E\u0442\u043E\u0432\u043D\u043E\u0441\u0442\u044C \u2014 \u043D\u0430 \u0443\u043B\u0438\u0446\u044B \u0432\u044B\u0445\u043E\u0434\u044F\u0442 \u0432\u043E\u043E\u0440\u0443\u0436\u0435\u043D\u043D\u044B\u0435 \u0431\u0430\u043D\u0434\u044B \u0438 \u0443\u0431\u0438\u0439\u0446\u044B-\u043E\u0434\u0438\u043D\u043E\u0447\u043A\u0438, \u043D\u0430 \u043A\u0440\u044B\u0448\u0430\u0445 \u0437\u0430\u043D\u0438\u043C\u0430\u044E\u0442 \u043F\u043E\u0437\u0438\u0446\u0438\u0438 \u0441\u043D\u0430\u0439\u043F\u0435\u0440\u044B, \u0433\u043E\u0440\u044F\u0442 \u0432\u0430\u0433\u043E\u043D\u044B, \u0430 \u043F\u043E \u0434\u043E\u0440\u043E\u0433\u0430\u043C \u0435\u0437\u0434\u044F\u0442 \u0447\u043E\u043A\u043D\u0443\u0442\u044B\u0435 \u0432\u043E\u0434\u0438\u043B\u044B, \u0438 \u0437\u0430\u0431\u0438\u0442\u044B\u0435 \u0433\u043E\u043B\u043E\u0432\u043E\u0440\u0435\u0437\u0430\u043C\u0438 \u0448\u043A\u043E\u043B\u044C\u043D\u044B\u0435 \u0430\u0432\u0442\u043E\u0431\u0443\u0441\u044B.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3,3
HINT_4_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041E\u0441\u0442\u0430\u0432\u0438\u0432 \u0441\u0432\u043E\u044E \u043C\u0430\u0448\u0438\u043D\u0443 \u043D\u0435\u043F\u043E\u0434\u0430\u043B\u0435\u043A\u0443 \u043E\u0442 \u0437\u0430\u043A\u0440\u044B\u0442\u043E\u0433\u043E \u043C\u043E\u0442\u0435\u043B\u044F. \u0428\u0435\u0439\u043D \u0438 \u041B\u0438\u0437\u0430 \u0432\u044B\u043D\u0443\u0436\u0434\u0435\u043D\u044B \u0431\u0435\u0436\u0430\u0442\u044C \u0432\u0434\u043E\u043B\u044C \u0448\u043E\u0441\u0441\u0435 \u0447\u0442\u043E\u0431 \u0441\u043F\u0440\u044F\u0442\u0430\u0442\u044C\u0441\u044F, \u0438 \u043F\u0435\u0440\u0435\u0436\u0434\u0430\u0442\u044C \u0433\u0434\u0435-\u043D\u0438\u0431\u0443\u0434\u044C \u044D\u0442\u0443 \u0436\u0443\u0442\u043A\u0443\u044E \u043D\u043E\u0447\u044C. \u0415\u0432\u0430 \u0438 \u041A\u0430\u043B\u0438 \u0437\u0430\u0445\u043E\u0434\u044F\u0442 \u0432 \u043A\u043E\u043C\u043D\u0430\u0442\u0443 \u043A \u043E\u0442\u0446\u0443 \u0438 \u043D\u0430\u0445\u043E\u0434\u044F\u0442 \u043F\u0438\u0441\u044C\u043C\u043E \u041B\u0435\u0436\u0430\u0432\u044B, \u0438\u0437 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0443\u0437\u043D\u0430\u044E\u0442, \u0447\u0442\u043E \u043E\u043D \u043D\u0435 \u0437\u0430\u0445\u043E\u0442\u0435\u043B \u043F\u0440\u043E\u0434\u043E\u043B\u0436\u0430\u0442\u044C \u043E\u0441\u0442\u0430\u0432\u0430\u0442\u044C\u0441\u044F \u0434\u043B\u044F \u043D\u0438\u0445 \u043E\u0431\u0443\u0437\u043E\u0439 (\u0435\u0433\u043E \u0431\u043E\u043B\u0435\u0437\u043D\u044C \u0431\u044B\u043B\u0430 \u043D\u0435\u0438\u0437\u043B\u0435\u0447\u0438\u043C\u043E\u0439, \u0430 \u043D\u0430 \u043B\u0435\u043A\u0430\u0440\u0441\u0442\u0432\u0430 \u0432 \u0433\u043E\u0434 \u0443\u0445\u043E\u0434\u0438\u043B\u043E \u043E\u043A\u043E\u043B\u043E 1992 \u0434\u043E\u043B\u043B\u0430\u0440\u043E\u0432.), \u0438 \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u0441\u043E\u0433\u043B\u0430\u0441\u0438\u043B\u0441\u044F \u043D\u0430 \u0441\u0434\u0435\u043B\u043A\u0443 \u0441 \u0431\u043E\u0433\u0430\u0442\u043E\u0439 \u0441\u0435\u043C\u044C\u0451\u0439 \u0422\u043E\u0440\u043D. \u0422\u0430 \u043F\u0435\u0440\u0435\u0432\u0435\u043B\u0430 \u043D\u0430 \u0438\u0445 \u0431\u0430\u043D\u043A\u043E\u0432\u0441\u043A\u0438\u0439 \u0441\u0447\u0451\u0442 100 \u0442\u044B\u0441\u044F\u0447 \u0434\u043E\u043B\u043B\u0430\u0440\u043E\u0432, \u0430 \u0432 \u043E\u0431\u043C\u0435\u043D \u041B\u0435\u0436\u0430\u0432\u0430 \u043F\u043E\u0437\u0432\u043E\u043B\u0438\u043B \u0422\u043E\u0440\u043D\u0430\u043C \u0443\u0431\u0438\u0442\u044C \u0435\u0433\u043E \u0432 \u0433\u043E\u0441\u0442\u0438\u043D\u043E\u0439 \u0438\u0445 \u0434\u043E\u043C\u0430.
HINT_4_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u041A\u0430\u043D\u0430\u0442\u043D\u0430\u044F \u0434\u043E\u0440\u043E\u0433\u0430. \u0421\u0442\u0430\u043D\u0446\u0438\u044F \u00AB\u041C\u043E\u0442\u0435\u043B\u044C\u00BB \u043F\u043E \u041C\u043E\u0441\u043A\u043E\u0432\u0441\u043A\u043E\u043C\u0443 \u0448\u043E\u0441\u0441\u0435.
TASK_CODE_4=F12LN1
TASK_5=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21165\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u041B\u0435\u043E, \u043F\u043E\u0434\u0441\u043B\u0443\u0448\u0430\u0432 \u0440\u0430\u0437\u0433\u043E\u0432\u043E\u0440, \u043F\u043E\u043D\u0438\u043C\u0430\u0435\u0442, \u0447\u0442\u043E \u0441\u0435\u0439\u0447\u0430\u0441 \u0432\u043E\u0435\u043D\u043D\u044B\u0435 \u043E\u0445\u043E\u0442\u044F\u0442\u0441\u044F \u0437\u0430 \u043D\u0438\u043C, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u043E\u043D \u043F\u0435\u0440\u0435\u0431\u0438\u043B \u043D\u0430\u0435\u043C\u043D\u0438\u043A\u043E\u0432 \u0432 \u0444\u0443\u0440\u0433\u043E\u043D\u0435 \u0438 \u0441\u043F\u0430\u0441 \u0415\u0432\u0443 \u0438 \u041A\u0430\u043B\u0438. \u041F\u043E\u0441\u043B\u0435 \u044D\u0442\u043E\u0433\u043E \u043D\u0430 \u043D\u0438\u0445 \u043D\u0430\u043F\u0430\u0434\u0430\u044E\u0442 \u043C\u0430\u0440\u043E\u0434\u0451\u0440\u044B \u0438 \u0437\u0430\u043F\u0438\u0445\u0438\u0432\u0430\u044E\u0442 \u0438\u0445 \u0432 \u0444\u0443\u0440\u0433\u043E\u043D. \u041C\u0430\u0440\u043E\u0434\u0451\u0440 \u0432 \u043C\u0430\u0441\u043A\u0435 \u0441 \u043D\u0430\u0434\u043F\u0438\u0441\u044C\u044E \u00ABGod\u00BB \u043E\u0431\u044A\u044F\u0441\u043D\u044F\u0435\u0442 \u0438\u043C, \u0447\u0442\u043E \u043E\u043D\u0438 \u043D\u0435 \u0443\u0431\u0438\u0432\u0430\u044E\u0442, \u0430 \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0442\u043B\u0430\u0432\u043B\u0438\u0432\u0430\u044E\u0442 \u0432\u044B\u0436\u0438\u0432\u0448\u0438\u0445 \u0434\u043B\u044F \u0437\u0430\u043A\u0430\u0437\u0447\u0438\u043A\u0430. \u0413\u0440\u0443\u043F\u043F\u0430 \u0431\u043E\u0433\u0430\u0442\u044B\u0445 \u0430\u0440\u0438\u0441\u0442\u043E\u043A\u0440\u0430\u0442\u043E\u0432 \u0443\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u044E\u0442 \u0434\u043B\u044F \u0441\u0435\u0431\u044F \u0438\u0433\u0440\u0443 \u0433\u0434\u0435 \u043E\u0445\u043E\u0442\u044F\u0442\u0441\u044F \u043D\u0430 \u0431\u0435\u0437\u043E\u0440\u0443\u0436\u043D\u044B\u0445 \u043B\u044E\u0434\u0435\u0439. \u0415\u0432\u0430 \u043F\u0440\u043E\u0441\u0438\u0442 \u041B\u0435\u043E, \u0437\u0430\u0449\u0438\u0442\u0438\u0442 \u041A\u0430\u043B\u0438, \u0432\u0435\u0434\u044C \u043A\u0430\u043A \u043E\u043D\u0430 \u0432\u044B\u0440\u0430\u0437\u0438\u043B\u0430\u0441\u044C. - \u00AB\u0416\u0438\u0442\u044C \u0411\u0435\u0437 \u041A\u0430\u043B\u0438, \u044F \u043D\u0435 \u0441\u043C\u043E\u0433\u0443.\u00BB\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 3, \u0410\u0433\u0435\u043D\u0442
HINT_5_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u041D\u0430 \u0430\u0440\u0435\u043D\u0443 \u0432\u044B\u0448\u043B\u0438 \u0431\u043E\u0433\u0430\u0447\u0438 \u0412\u043E\u043E\u0440\u0443\u0436\u0435\u043D\u043D\u044B\u0445 \u0434\u043E \u0417\u0443\u0431\u043E\u0432, \u0432\u0441\u044F\u043A\u043E\u0433\u043E \u0440\u043E\u0434\u0430 \u0416\u0435\u043B\u0435\u0437\u043A\u0430\u043C\u0438, \u0411\u0438\u0442\u0430\u043C\u0438 \u0438 \u041A\u0430\u0441\u0442\u0435\u0442\u0430\u043C\u0438. \u041B\u0435\u043E, \u0441\u043F\u0440\u044F\u0442\u0430\u0432 \u0415\u0432\u0443, \u0428\u0435\u0439\u043D\u0430, \u041A\u0430\u043B\u0438 \u0438 \u041B\u0438\u0437\u0443 \u0432 \u0443\u043A\u0440\u043E\u043C\u043D\u043E\u043C \u043C\u0435\u0441\u0442\u0435 \u0438 \u043F\u043E\u043B\u044C\u0437\u0443\u044F\u0441\u044C \u0442\u0435\u043C, \u0447\u0442\u043E \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435 \u043D\u0430 \u0430\u0440\u0435\u043D\u0435 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442 \u0432 \u0442\u0435\u043C\u043D\u043E\u0442\u0435, \u0432\u0441\u0442\u0443\u043F\u0430\u0435\u0442 \u0432 \u043D\u0435\u0440\u0430\u0432\u043D\u0443\u044E \u0441\u0445\u0432\u0430\u0442\u043A\u0443 (\u0443 \u043D\u0435\u0433\u043E \u043D\u0435\u0442 \u043E\u0440\u0443\u0436\u0438\u044F, \u0430 \u043F\u0440\u0435\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u0438 \u043D\u0435 \u0432 \u043F\u0435\u0440\u0432\u043E\u0439 \u043F\u0440\u043E\u043C\u044B\u0448\u043B\u044F\u044E\u0442 \u043E\u0445\u043E\u0442\u043E\u0439 \u043D\u0430 \u043B\u044E\u0434\u0435\u0439 \u0432 \u00AB\u0421\u0443\u0434\u043D\u0443\u044E \u041D\u043E\u0447\u044C\u00BB.). \u041B\u0435\u043E \u0432 \u043E\u0434\u0438\u043D\u043E\u0447\u043A\u0443 \u0443\u0431\u0438\u0432\u0430\u0435\u0442 \u043F\u044F\u0442\u0435\u0440\u044B\u0445 \u00AB\u043F\u043E\u043A\u0443\u043F\u0430\u0442\u0435\u043B\u0435\u0439\u00BB, \u0430 \u043E\u0441\u0442\u0430\u0432\u0448\u0438\u0435\u0441\u044F \u0434\u0432\u0430, \u0438\u0441\u043F\u0443\u0433\u0430\u0432\u0448\u0438\u0441\u044C, \u0441\u0431\u0435\u0433\u0430\u044E\u0442. \u0422\u043E\u0433\u0434\u0430 \u0445\u043E\u0437\u044F\u0439\u043A\u0430 \u0430\u0443\u043A\u0446\u0438\u043E\u043D\u0430, \u042D\u043B\u0438\u0437\u0430\u0431\u0435\u0442 \u0432\u044B\u043F\u0443\u0441\u043A\u0430\u0435\u0442 \u043D\u0430 \u00AB\u0430\u0440\u0435\u043D\u0443\u00BB \u0431\u043E\u043B\u044C\u0448\u0443\u044E \u0433\u0440\u0443\u043F\u043F\u0443 \u043E\u0445\u0440\u0430\u043D\u044B. \u0413\u0435\u0440\u043E\u0438, \u0437\u0430\u0432\u043B\u0430\u0434\u0435\u0432 \u043E\u0440\u0443\u0436\u0438\u0435\u043C \u00AB\u043F\u043E\u043A\u0443\u043F\u0430\u0442\u0435\u043B\u0435\u0439\u00BB, \u043D\u0430\u0447\u0438\u043D\u0430\u044E\u0442 \u043E\u0442\u0441\u0442\u0440\u0435\u043B\u0438\u0432\u0430\u0442\u044C\u0441\u044F.
HINT_5_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0417\u0430\u0432\u043E\u0434 \u0412\u0417\u0416\u0411\u041A, \u0443\u0433\u043E\u043B 1-\u0439 \u043F\u0440\u043E\u043C\u044B\u0448\u043B\u0435\u043D\u043D\u043E\u0439 \u0438 \u0427\u0435\u0440\u043C\u0435\u043D\u0441\u043A\u043E\u0433\u043E \u0448\u043E\u0441\u0441\u0435.
TASK_CODE_5=F52LN2
TASK_6=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21166\n(\u0421\u043E\u0441\u0442\u0430\u0432\u043D\u043E\u0439 \u043A\u043E\u0434)\n\u00AB\u041E\u0442\u0446\u044B-\u043E\u0441\u043D\u043E\u0432\u0430\u0442\u0435\u043B\u0438\u00BB \u0432\u043E \u0433\u043B\u0430\u0432\u0435 \u0441 \u043B\u0438\u0434\u0435\u0440\u043E\u043C \u041A\u0430\u043B\u0435\u0431\u043E\u043C \u0423\u043E\u0440\u0440\u0435\u043D\u0437\u043E\u043C \u0437\u0430\u0442\u0435\u0432\u0430\u044E\u0442 \u043F\u0440\u043E\u0442\u0438\u0432 \u0427\u0430\u0440\u043B\u0438 \u0442\u0430\u0439\u043D\u044B\u0439 \u0437\u0430\u0433\u043E\u0432\u043E\u0440, \u0447\u0442\u043E\u0431\u044B \u043D\u0435 \u0434\u0430\u0442\u044C \u0435\u0439 \u0441\u043E\u0432\u0435\u0440\u0448\u0438\u0442\u044C \u0437\u0430\u0434\u0443\u043C\u0430\u043D\u043D\u043E\u0435, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443, \u0435\u0441\u043B\u0438 \u043E\u043D\u0430 \u043F\u043E\u0431\u0435\u0434\u0438\u0442 \u043D\u0430 \u0432\u044B\u0431\u043E\u0440\u0430\u0445, \u0442\u043E \u044D\u0442\u0430 \u00AB\u0421\u0443\u0434\u043D\u0430\u044F \u043D\u043E\u0447\u044C\u00BB \u0441\u0442\u0430\u043D\u0435\u0442 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0439. \u0410 \u0432 \u0441\u0432\u043E\u0438\u0445 \u0434\u0435\u0431\u0430\u0442\u0430\u0445 \u0427\u0430\u0440\u043B\u0438 \u043E\u0431\u0440\u0430\u0449\u0430\u043B\u0430\u0441\u044C \u043A \u043B\u044E\u0434\u044F\u043C \u0441 \u00AB\u043F\u0440\u0438\u0437\u044B\u0432\u043E\u043C \u043A \u0431\u043E\u0440\u044C\u0431\u0435\u00BB, \u0447\u0442\u043E \u043E\u043D\u0438 \u043B\u044E\u0434\u0438 \u00AB\u0438\u0434\u0443\u0449\u0438\u0435 \u043A \u0441\u0447\u0430\u0441\u0442\u044C\u044E\u00BB \u0438 \u0447\u0442\u043E\u0431 \u0440\u0430\u0437 \u0432 \u0433\u043E\u0434\u0443 \u043D\u0435 \u0437\u0432\u0443\u0447\u0430\u043B\u0430 \u00AB\u043D\u0430\u0431\u0430\u0442\u00BB \u043F\u0435\u0440\u0435\u0434 \u0434\u043E\u043C\u043E\u043C, \u00AB\u043D\u0430\u0440\u043E\u0434\u00BB \u0410\u043C\u0435\u0440\u0438\u043A\u0438 \u0434\u043E\u043B\u0436\u0435\u043D \u043E\u0442\u043A\u0430\u0437\u0430\u0442\u044C\u0441\u044F \u043E\u0442 \u00AB\u0421\u0443\u0434\u043D\u043E\u0439 \u043D\u043E\u0447\u0438\u00BB. \u041D\u043E\u0447\u044C\u044E \u043D\u0430 \u0434\u043E\u043C \u0427\u0430\u0440\u043B\u0438 \u0431\u044B\u043B\u043E \u0441\u043E\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E \u043D\u0430\u043F\u0430\u0434\u0435\u043D\u0438\u0435 \u0438 \u043E\u043D\u0438 \u0431\u044B\u043B\u0438 \u0432\u044B\u043D\u0443\u0436\u0434\u0435\u043D\u044B \u0431\u044B\u043B\u0438 \u0431\u0435\u0436\u0430\u0442\u044C. \u041F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E \u043A\u0430\u043A \u0438\u043C \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0441\u043A\u0440\u044B\u0442\u044C\u0441\u044F \u043E\u043D\u0438 \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u044E\u0442\u0441\u044F \u0441 \u0414\u0430\u043D\u0442\u0435 \u0411\u0438\u0448\u043E\u043F\u043E\u043C, \u0438 \u0438\u0445 \u0432\u0435\u0434\u0443\u0442 \u0432 \u0441\u0435\u043A\u0440\u0435\u0442\u043D\u043E\u0435 \u0443\u0431\u0435\u0436\u0438\u0449\u0435 \u0434\u043B\u044F \u0431\u0435\u0434\u043D\u044F\u043A\u043E\u0432.. \u0427\u0430\u0440\u043B\u0438 \u0441 \u0443\u0436\u0430\u0441\u043E\u043C \u043F\u043E\u043D\u0438\u043C\u0430\u0435\u0442, \u0447\u0442\u043E \u0432 \u044D\u0442\u0443 \u043D\u043E\u0447\u044C \u0414\u0430\u043D\u0442\u0435 \u0438 \u0435\u0433\u043E \u043B\u044E\u0434\u0438 \u0445\u043E\u0442\u044F\u0442 \u0441\u043E\u0432\u0435\u0440\u0448\u0438\u0442\u044C \u043F\u043E\u043A\u0443\u0448\u0435\u043D\u0438\u0435 \u043D\u0430 \u042D\u0434\u0432\u0438\u0434\u0436\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043A\u0430\u0436\u0434\u0443\u044E \u00AB\u0421\u0443\u0434\u043D\u0443\u044E \u043D\u043E\u0447\u044C\u00BB \u043E\u0442\u0434\u0430\u0435\u0442 \u0434\u0430\u043D\u044C \u0432 \u0434\u043E\u043C\u0435 \u043C\u043E\u043B\u0438\u0442\u0432.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 2,3
HINT_6_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0427\u0430\u0440\u043B\u0438 \u043F\u0440\u043E\u0441\u0438\u0442 \u0414\u0430\u043D\u0442\u0435 \u043D\u0435 \u0443\u0431\u0438\u0432\u0430\u0442\u044C \u0426\u043E\u043C\u0430\u043A\u0430, \u043F\u043E\u0442\u043E\u043C\u0443 \u0447\u0442\u043E \u0445\u043E\u0447\u0435\u0442, \u0447\u0442\u043E\u0431\u044B \u0435\u0451 \u043F\u043E\u0431\u0435\u0434\u0430 \u043D\u0430 \u0432\u044B\u0431\u043E\u0440\u0430\u0445 \u0431\u044B\u043B\u0430 \u0447\u0435\u0441\u0442\u043D\u043E\u0439, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043F\u043E\u0442\u043E\u043C\u0443, \u0447\u0442\u043E \u00AB\u041D\u043E\u0432\u044B\u0435 \u041E\u0442\u0446\u044B-\u043E\u0441\u043D\u043E\u0432\u0430\u0442\u0435\u043B\u0438\u00BB \u0442\u043E\u0433\u0434\u0430 \u043F\u0440\u0438\u0440\u0430\u0432\u043D\u044F\u044E\u0442 \u042D\u0434\u0432\u0438\u0434\u0436\u0430 \u043A \u043C\u0443\u0447\u0435\u043D\u0438\u043A\u0430\u043C, \u0447\u0442\u043E \u043F\u043E\u0434\u043E\u0440\u0432\u0451\u0442 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u0443 \u0427\u0430\u0440\u043B\u0438 \u043D\u0430 \u0432\u044B\u0431\u043E\u0440\u0430\u0445. \u0418 \u0434\u0430\u0431\u044B \u043D\u0435 \u043E\u043F\u043E\u0437\u043E\u0440\u0438\u0442\u044C \u00AB\u0447\u0435\u0441\u0442\u044C \u043F\u0440\u0435\u0434\u043A\u043E\u0432\u00BB. \u0414\u0430\u043D\u0442\u0435 \u0435\u0451 \u043D\u0435 \u0441\u043B\u0443\u0448\u0430\u0435\u0442, \u043D\u043E \u0432 \u044D\u0442\u043E \u0432\u0440\u0435\u043C\u044F \u043A \u0443\u0431\u0435\u0436\u0438\u0449\u0443 \u043F\u043E\u0434\u044A\u0435\u0437\u0436\u0430\u0435\u0442 \u0443\u0436\u0435 \u0446\u0435\u043B\u0430\u044F \u0430\u0440\u043C\u0438\u044F \u043F\u0440\u0430\u0432\u0438\u0442\u0435\u043B\u044C\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0445 \u043D\u0430\u0451\u043C\u043D\u0438\u043A\u043E\u0432, \u0438 \u043B\u044E\u0434\u0435\u0439 \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442\u0441\u044F \u0441\u0440\u043E\u0447\u043D\u043E \u044D\u0432\u0430\u043A\u0443\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0438\u0437 \u0434\u043E\u043C\u0430 \u043C\u043E\u043B\u0438\u0442\u0432.
HINT_6_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0423\u043B\u0438\u0446\u0430 \u0426\u043E\u043C\u0430\u043A\u0430 \u0413\u0430\u0434\u0438\u0435\u0432\u0430(\u043F\u043E\u0432\u043E\u0440\u043E\u0442 \u043D\u0430 \u0414\u0430\u0440\u044C\u044F\u043B \u0432\u043E\u0437\u043B\u0435 \u0414\u043E\u043C\u0430 \u041C\u043E\u043B\u0438\u0442\u0432).
TASK_CODE_6=F9L48N
TASK_7=\u0417\u0430\u0434\u0430\u043D\u0438\u0435 \u21167\n(\u0421 \u0410\u0433\u0435\u043D\u0442\u043E\u043C)\n\u0427\u0430\u0440\u043B\u0438 \u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u0441\u044F \u0441\u0432\u0438\u0434\u0435\u0442\u0435\u043B\u044C\u043D\u0438\u0446\u0435\u0439 \u0442\u043E\u0433\u043E, \u0447\u0442\u043E \u042D\u0434\u0432\u0438\u0434\u0436 \u043F\u0440\u043E\u0432\u043E\u0434\u0438\u0442 \u0434\u043B\u044F \u044D\u043B\u0438\u0442\u044B \u043F\u0443\u0431\u043B\u0438\u0447\u043D\u043E\u0435 \u0443\u0431\u0438\u0435\u043D\u0438\u0435 \u0432\u0441\u0435\u0445 \u043A\u0442\u043E, \u043F\u043E \u0435\u0433\u043E \u0441\u043B\u043E\u0432\u0430\u043C, \u043D\u0435 \u0434\u0430\u0451\u0442 \u0430\u043C\u0435\u0440\u0438\u043A\u0430\u043D\u0441\u043A\u043E\u043C\u0443 \u043E\u0431\u0449\u0435\u0441\u0442\u0432\u0443 \u00AB\u043E\u0447\u0438\u0441\u0442\u0438\u0442\u044C\u0441\u044F \u043E\u0442 \u0441\u043A\u0432\u0435\u0440\u043D\u044B\u00BB. \u0422\u0430\u043A, \u043D\u0430 \u0435\u0451 \u0433\u043B\u0430\u0437\u0430\u0445 \u043D\u0430\u0443\u0441\u044C\u043A\u0430\u043D\u043D\u044B\u0439 \u042D\u0434\u0432\u0438\u0434\u0436\u0435\u043C \u0435\u0433\u043E \u043F\u043E\u043C\u043E\u0449\u043D\u0438\u043A-\u0441\u0432\u044F\u0449\u0435\u043D\u043D\u0438\u043A \u0419\u0430\u043C\u0430\u0442 \u0437\u0430\u043A\u0430\u043B\u044B\u0432\u0430\u0435\u0442 \u043D\u043E\u0436\u043E\u043C \u043C\u0435\u0441\u0442\u043D\u043E\u0433\u043E \u043D\u0430\u0440\u043A\u043E\u043C\u0430\u043D\u0430 \u00AB\u043D\u0438\u0433\u0435\u0440\u0430\u00BB. \u041A\u043E\u0433\u0434\u0430 \u0434\u043E\u0445\u043E\u0434\u0438\u0442 \u043E\u0447\u0435\u0440\u0435\u0434\u044C \u0434\u043E \u0427\u0430\u0440\u043B\u0438, \u0442\u043E \u0438-\u0437\u0430 \u0443\u0433\u043B\u0430 \u0435\u0435 \u0432\u044B\u043A\u0430\u0434\u044B\u0432\u0430\u0435\u0442 \u0419\u0430\u043C\u0430\u0442 \u0438 \u042D\u0434\u0432\u0438\u0434\u0436, \u043F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u0427\u0430\u0440\u043B\u0438 \u2014 \u0441\u043B\u0443\u0447\u0430\u0439 \u043E\u0441\u043E\u0431\u044B\u0439, \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u0442 \u043F\u0440\u043E\u0432\u0435\u0441\u0442\u0438 \u043D\u0430\u0434 \u043D\u0435\u0439 \u044D\u043A\u0437\u0435\u043A\u0443\u0446\u0438\u044E \u0432\u0441\u0435\u043C 18-\u0442\u0438 \u00AB\u041E\u0442\u0446\u0430\u043C-\u043E\u0441\u043D\u043E\u0432\u0430\u0442\u0435\u043B\u044F\u043C\u00BB. \u0412 \u0441\u0430\u043C\u044B\u0439 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0432 \u0448\u043A\u043E\u043B\u0443 \u0432\u0440\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u0414\u0430\u043D\u0442\u0435 \u0441\u043E \u0441\u0432\u043E\u0435\u0439 \u0433\u0440\u0443\u043F\u043F\u043E\u0439, \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u0443\u0434\u0430\u0451\u0442\u0441\u044F \u043F\u0435\u0440\u0435\u0441\u0442\u0440\u0435\u043B\u044F\u0442\u044C \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u00AB\u041E\u0442\u0446\u043E\u0432-\u043E\u0441\u043D\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439\u00BB, \u0438\u0445 \u043E\u0445\u0440\u0430\u043D\u0443 \u0438 \u043D\u0430\u0451\u043C\u043D\u0438\u043A\u043E\u0432.\n\u041A\u043E\u0434 \u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438 \u0410\u0433\u0435\u043D\u0442
HINT_7_1=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 1\n\u0417\u0430 \u0443\u0433\u043B\u043E\u043C \u0412\u0430\u0440\u0444\u043E\u043B\u043E\u043C\u0435\u0439 \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u0435\u0442\u0441\u044F \u0441 \u00AB\u043D\u0438\u0433\u0435\u0440\u043E\u043C\u00BB. \u0418 \u043E\u0431\u0441\u0447\u0438\u0442\u0430\u0432 \u0442\u0440\u0443\u043F\u044B \u043F\u043E\u043D\u0438\u043C\u0430\u044E\u0442 \u0447\u0442\u043E \u0438\u0437 18-\u0442\u0438 \u00AB\u043E\u0442\u0446\u043E\u0432-\u043E\u0441\u043D\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439\u00BB \u043E\u0434\u0438\u043D \u0441\u043C\u043E\u0433 \u0432\u044B\u0431\u0440\u0430\u0442\u044C\u0441\u044F \u0438\u0437 \u0448\u043A\u043E\u043B\u044B,\u0433\u0434\u0435 \u0441\u0443\u0434\u0438\u043B\u0438 \u0432 \u00AB\u0421\u0443\u0434\u043D\u0443\u044E \u041D\u043E\u0447\u044C\u00BB,. \u041B\u0435\u043E \u0434\u0435\u0440\u0451\u0442\u0441\u044F \u0441 \u042D\u0440\u043B\u043E\u043C \u0432\u0440\u0443\u043A\u043E\u043F\u0430\u0448\u043D\u0443\u044E \u0438, \u0445\u043E\u0442\u044F \u043F\u0435\u0440\u0435\u0432\u0435\u0441 \u043D\u0430 \u0441\u0442\u043E\u0440\u043E\u043D\u0435 \u042D\u0440\u043B\u0430 (\u043F\u043E\u0442\u043E\u043C\u0443 \u0447\u0442\u043E \u043E\u043D \u043E\u0434\u0435\u0442 \u0432 \u0431\u0440\u043E\u043D\u0435\u0436\u0438\u043B\u0435\u0442, \u0430 \u041B\u0435\u043E \u2014 \u0440\u0430\u043D\u0435\u043D \u0432 \u043F\u043B\u0435\u0447\u043E), \u041B\u0435\u043E \u0443\u0434\u0430\u0451\u0442\u0441\u044F \u0432 \u043A\u043E\u043D\u0435\u0447\u043D\u043E\u043C \u0438\u0442\u043E\u0433\u0435 \u0435\u0433\u043E \u0443\u0431\u0438\u0442\u044C \u043D\u043E\u0436\u043E\u043C. \u0422\u0435\u043C \u0432\u0440\u0435\u043C\u0435\u043D\u0435\u043C, \u043D\u0430 \u0427\u0430\u0440\u043B\u0438 \u043D\u0430\u043F\u0430\u0434\u0430\u0435\u0442 \u0432\u044B\u0436\u0438\u0432\u0448\u0438\u0439 \u0432 \u043F\u0435\u0440\u0435\u0441\u0442\u0440\u0435\u043B\u043A\u0435 \u0419\u0430\u043C\u0430\u0442, \u043D\u043E \u00AB\u0413\u044B\u0446\u0446\u044B\u00BB \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u0435\u0442 \u043D\u0430 \u0441\u0435\u0431\u044F \u043E\u0433\u043E\u043D\u044C.
HINT_7_2=\u041F\u043E\u0434\u0441\u043A\u0430\u0437\u043A\u0430 2\n\u0417\u0434\u0430\u043D\u0438\u0435 \u0431\u044B\u0432\u0448\u0435\u0439 18-\u0439 \u0448\u043A\u043E\u043B\u044B \u043D\u0430 \u0443\u0433\u043B\u0443 \u0414\u0436\u0430\u043D\u0430\u0435\u0432\u0430 \u0438 \u0422\u0430\u043C\u0430\u0435\u0432\u0430.
TASK_CODE_7=FL12N5
BONUS_FIVE_MINUTES=GAGI1
BONUS_TEN_MINUTES=1GAGI
BONUS_FIFTEEN_MINUTES=IGAG1